
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>09. 输入输出操作 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="10.LibrariesAndTop-levelPrograms.html" />
    
    
    <link rel="prev" href="08.NumericOperations.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="00.Terminology.html">
            
                <a href="00.Terminology.html">
            
                    
                    00. 术语表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="01.Introduction.html">
            
                <a href="01.Introduction.html">
            
                    
                    01. 简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="02.UsingChezScheme.html">
            
                <a href="02.UsingChezScheme.html">
            
                    
                    02. 使用Chez Scheme
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="03.Debugging.html">
            
                <a href="03.Debugging.html">
            
                    
                    03. Debugging
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="04.ForeignInterface.html">
            
                <a href="04.ForeignInterface.html">
            
                    
                    04. 外部接口
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="05.BindingForms.html">
            
                <a href="05.BindingForms.html">
            
                    
                    05. 绑定
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="06.ControlStructures.html">
            
                <a href="06.ControlStructures.html">
            
                    
                    06. 控制结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="07.OperationsOnObjects.html">
            
                <a href="07.OperationsOnObjects.html">
            
                    
                    07. 对象操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="08.NumericOperations.html">
            
                <a href="08.NumericOperations.html">
            
                    
                    08. 数字操作
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.11" data-path="09.InputOutputOperations.html">
            
                <a href="09.InputOutputOperations.html">
            
                    
                    09. 输入输出操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.LibrariesAndTop-levelPrograms.html">
            
                <a href="10.LibrariesAndTop-levelPrograms.html">
            
                    
                    10. 库和顶层程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="11.SyntacticExtensionAndModules.html">
            
                <a href="11.SyntacticExtensionAndModules.html">
            
                    
                    11. 语法扩展和模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.SystemOperations.html">
            
                <a href="12.SystemOperations.html">
            
                    
                    12. 系统操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.StorageManagement.html">
            
                <a href="13.StorageManagement.html">
            
                    
                    13. 存储系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.ExpressionEditor.html">
            
                <a href="14.ExpressionEditor.html">
            
                    
                    14. 扩展编辑器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.ThreadSystem.html">
            
                <a href="15.ThreadSystem.html">
            
                    
                    15. 线程系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="16.CompatibilityFeatures.html">
            
                <a href="16.CompatibilityFeatures.html">
            
                    
                    16. 兼容功能
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >09. 输入输出操作</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="9-&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x64CD;&#x4F5C;">9. &#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x64CD;&#x4F5C;</h1>
<p>&#x672C;&#x7AE0;&#x4ECB;&#x7ECD;&#x4E86; Chez Scheme &#x7684;&#x901A;&#x7528;&#x7AEF;&#x53E3;&#x5DE5;&#x5177;&#xFF0C;&#x7AEF;&#x53E3;&#x64CD;&#x4F5C;&#xFF0C;&#x4EE5;&#x53CA; Chez Scheme &#x5BF9;&#x6807;&#x51C6;&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x64CD;&#x4F5C;&#x96C6;&#x7684;&#x591A;&#x79CD;&#x6269;&#x5C55;&#x3002;&#x6709;&#x5173;&#x6807;&#x51C6;&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x64CD;&#x4F5C;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x53EF;&#x53C2;&#x89C1;&#x300A;Scheme &#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x300B;&#x7B2C; 4 &#x7248;&#x7684;&#x7B2C; 7 &#x7AE0;&#xFF0C;&#x6216;&#x300A;Scheme &#x8BED;&#x8A00;&#x4FEE;&#x8BA2;<sup>6</sup>&#x62A5;&#x544A;&#x300B;&#x3002;9.17 &#x8282;&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x4E9B;&#x901A;&#x7528;&#x7AEF;&#x53E3;&#x6837;&#x4F8B;&#x7684;&#x5B9A;&#x4E49;&#x3002;</p>
<p>&#x5728;&#x7A0B;&#x5E8F;&#x4E0D;&#x518D;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x6587;&#x4EF6;&#x7AEF;&#x53E3;&#x540E;&#xFF0C;&#x6216;&#x5728; Scheme &#x7A0B;&#x5E8F;&#x9000;&#x51FA;&#x65F6;&#xFF0C;Chez Scheme &#x4F1A;&#x81EA;&#x52A8;&#x5173;&#x95ED;&#x6587;&#x4EF6;&#x7AEF;&#x53E3;&#xFF0C;&#x4F46;&#x6700;&#x597D;&#x5C3D;&#x53EF;&#x80FD;&#x663E;&#x5F0F;&#x5730;&#x5173;&#x95ED;&#x7AEF;&#x53E3;&#x3002;</p>
<h2 id="91-&#x901A;&#x7528;&#x7AEF;&#x53E3;">9.1. &#x901A;&#x7528;&#x7AEF;&#x53E3;</h2>
<p>Chez Scheme &#x7684;&#x201C;&#x901A;&#x7528;&#x7AEF;&#x53E3;&#x201D;&#x5DE5;&#x5177;&#x652F;&#x6301;&#x7A0B;&#x5E8F;&#x5458;&#x6DFB;&#x52A0;&#x5177;&#x6709;&#x4EFB;&#x610F;&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x8BED;&#x4E49;&#x7684;&#x65B0;&#x6587;&#x672C;&#x7AEF;&#x53E3;&#x7C7B;&#x578B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;&#x4EFB;&#x4F55;&#x5185;&#x7F6E;&#x7684; Common Lisp [30]&#x6D41;&#x7C7B;&#x578B;&#xFF0C;&#x5373;&#xFF0C;&#x5F02;&#x540D;&#x6D41;&#xFF0C;&#x5E7F;&#x64AD;&#x6D41;&#xFF0C;&#x7EA7;&#x8054;&#x6D41;&#xFF0C;&#x53CC;&#x5411;&#x6D41;&#xFF0C;&#x56DE;&#x663E;&#x6D41;&#x548C;&#x5B57;&#x7B26;&#x4E32;&#x6D41;&#x3002;&#x5B83;&#x8FD8;&#x53EF;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;&#x66F4;&#x591A;&#x72EC;&#x7279;&#x7684;&#x7AEF;&#x53E3;&#xFF0C;&#x4F8B;&#x5982;&#x8868;&#x793A;&#x4F4D;&#x6620;&#x5C04;&#x663E;&#x793A;&#x5668;&#x4E0A;&#x7684;&#x7A97;&#x53E3;&#x7684;&#x7AEF;&#x53E3;&#xFF0C;&#x6216;&#x8868;&#x793A;&#x901A;&#x8FC7;&#x7BA1;&#x9053;&#x6216;&#x5957;&#x63A5;&#x5B57;&#x8FDE;&#x63A5;&#x5230;&#x5F53;&#x524D;&#x8FDB;&#x7A0B;&#x7684;&#x8FDB;&#x7A0B;&#x7684;&#x7AEF;&#x53E3;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x7AEF;&#x53E3;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x5173;&#x8054;&#x7684;&#x7AEF;&#x53E3;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x3002;&#x7AEF;&#x53E3;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x662F;&#x4E00;&#x79CD;&#x63A5;&#x53D7;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x98CE;&#x683C;&#x7684;&#x6D88;&#x606F;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x6BCF;&#x6761;&#x6D88;&#x606F;&#x5BF9;&#x5E94;&#x7AEF;&#x53E3;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x4F4E;&#x7EA7; Scheme &#x64CD;&#x4F5C;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;read-char &#x548C; close-input-port&#xFF08;&#x4F46; read &#x4E0D;&#x662F;&#xFF0C;&#x5B83;&#x662F;&#x57FA;&#x4E8E;&#x4F4E;&#x7EA7;&#x522B;&#x7684;&#x64CD;&#x4F5C;&#x5B9A;&#x4E49;&#x7684;&#xFF09;&#x3002; &#x5927;&#x591A;&#x6570;&#x6B64;&#x7C7B;&#x64CD;&#x4F5C;&#x53EA;&#x662F;&#x7ACB;&#x5373;&#x4EE5;&#x76F8;&#x5E94;&#x7684;&#x6D88;&#x606F;&#x8C03;&#x7528;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x6807;&#x51C6;&#x6D88;&#x606F;&#x9075;&#x5FAA;&#x4EE5;&#x4E0B;&#x7EA6;&#x5B9A;&#xFF1A;&#x6D88;&#x606F;&#x540D;&#x79F0;&#x662F;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x3002; &#x5B83;&#x603B;&#x662F;&#x4E00;&#x4E2A;&#x7B26;&#x53F7;&#xFF0C;&#x4E14;&#x603B;&#x662F;&#x4E00;&#x4E2A;&#x539F;&#x751F; Scheme &#x7AEF;&#x53E3;&#x64CD;&#x4F5C;&#x7684;&#x540D;&#x79F0;&#x3002; &#x9644;&#x52A0;&#x53C2;&#x6570;&#x4E0E;&#x539F;&#x751F;&#x8FC7;&#x7A0B;&#x7684;&#x53C2;&#x6570;&#x76F8;&#x540C;&#xFF0C;&#x5E76;&#x4EE5;&#x76F8;&#x540C;&#x7684;&#x987A;&#x5E8F;&#x51FA;&#x73B0;&#x3002;&#xFF08;&#x67D0;&#x4E9B;&#x539F;&#x751F;&#x8FC7;&#x7A0B;&#x7684; port &#x53C2;&#x6570;&#x662F;&#x53EF;&#x9009;&#x7684;&#xFF1B;&#x5BF9;&#x4E8E;&#x4F20;&#x9012;&#x7ED9;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x59CB;&#x7EC8;&#x63D0;&#x4F9B; port &#x53C2;&#x6570;&#x3002;&#xFF09;&#x4E3A;&#x5185;&#x7F6E;&#x7AEF;&#x53E3;&#x5B9A;&#x4E49;&#x4E86;&#x4EE5;&#x4E0B;&#x6D88;&#x606F;&#xFF1A;</p>
<pre><code>block-read port string count
block-write port string count
char-ready? port
clear-input-port port
clear-output-port port
close-port port
file-position port
file-position port position
file-length port
flush-output-port port
peek-char port
port-name port
read-char port
unread-char char port
write-char char port
</code></pre><p>&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x7684;&#x7AEF;&#x53E3;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x5176;&#x5B83;&#x6D88;&#x606F;&#x3002;</p>
<p>Chez Scheme &#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x901A;&#x5E38;&#x4F1A;&#x88AB;&#x7F13;&#x51B2;&#x4EE5;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#x3002;&#x4E3A;&#x4E86;&#x652F;&#x6301;&#x7F13;&#x51B2;&#xFF0C;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x6BCF;&#x4E2A;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x7F13;&#x51B2;&#x533A;&#x3002;&#x53CC;&#x5411;&#x7AEF;&#x53E3;&#xFF0C;&#x65E2;&#x662F;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x53C8;&#x662F;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x7684;&#x7AEF;&#x53E3;&#xFF0C;&#x5305;&#x542B;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x7F13;&#x51B2;&#x533A;&#x3002;&#x5982;&#x679C;&#x8F93;&#x5165;&#x7F13;&#x51B2;&#x533A;&#x662F;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5219;&#x4E0D;&#x7F13;&#x51B2;&#x8F93;&#x5165;&#xFF0C;&#x5982;&#x679C;&#x8F93;&#x51FA;&#x7F13;&#x51B2;&#x533A;&#x662F;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5219;&#x4E0D;&#x7F13;&#x51B2;&#x8F93;&#x51FA;&#x3002;&#x5728;&#x65E0;&#x7F13;&#x51B2;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5BF9; read-char&#xFF0C;write-char &#x548C;&#x7C7B;&#x4F3C;&#x6D88;&#x606F;&#x7684;&#x8C03;&#x7528;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x7ACB;&#x5373;&#x4EE5;&#x76F8;&#x5E94;&#x7684;&#x6D88;&#x606F;&#x8C03;&#x7528;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x3002;&#x5BF9;&#x4E8E;&#x7F13;&#x51B2;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#xFF0C;&#x5BF9;&#x8FD9;&#x4E9B;&#x8FC7;&#x7A0B;&#x7684;&#x8C03;&#x7528;&#x4F1A;&#x5BFC;&#x81F4;&#x7F13;&#x51B2;&#x533A;&#x88AB;&#x66F4;&#x65B0;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x4E0D;&#x4F1A;&#x8C03;&#x7528;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#xFF0C;&#x76F4;&#x5230;&#x7F13;&#x51B2;&#x533A;&#x53D8;&#x7A7A;&#xFF08;&#x5BF9;&#x4E8E;&#x8F93;&#x5165;&#xFF09;&#x6216;&#x53D8;&#x6EE1;&#xFF08;&#x5BF9;&#x4E8E;&#x8F93;&#x51FA;&#xFF09;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5F53;&#x63A5;&#x6536;&#x5230; read-char&#xFF0C;write-char &#x548C;&#x7C7B;&#x4F3C;&#x6D88;&#x606F;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x6709;&#x4EE5;&#x4E0B;&#x53EF;&#x80FD;&#x6027;&#xFF1A;&#xFF08;a&#xFF09;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x901A;&#x8FC7;&#x67D0;&#x79CD;&#x5176;&#x4ED6;&#x673A;&#x5236;&#x8C03;&#x7528;&#xFF0C;&#x6216;&#xFF08;b&#xFF09;&#x5BF9;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x7684;&#x8C03;&#x7528;&#x88AB;&#x4E2D;&#x65AD;&#xFF0C;&#x56E0;&#x800C;&#x7F13;&#x51B2;&#x7AEF;&#x53E3;&#x7684;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x4E00;&#x5B9A;&#x4E0D;&#x80FD;&#x4F9D;&#x8D56;&#x4E8E;&#x7F13;&#x51B2;&#x533A;&#x4E3A;&#x7A7A;&#x6216;&#x4E3A;&#x6EE1;&#x3002;</p>
<p>&#x5728;&#x5B58;&#x5728;&#x952E;&#x76D8;&#xFF0C;&#x5B9A;&#x65F6;&#x5668;&#x548C;&#x5176;&#x4ED6;&#x4E2D;&#x65AD;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x4E2D;&#x65AD;&#x5BF9;&#x7AEF;&#x53E3;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x7684;&#x8C03;&#x7528;&#x6216;&#x8005;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x672C;&#x8EAB;&#x3002;&#x5982;&#x679C;&#x7AEF;&#x53E3;&#x53EF;&#x4EE5;&#x5728;&#x88AB;&#x4E2D;&#x65AD;&#x7684;&#x4EE3;&#x7801;&#x4E4B;&#x5916;&#x8BBF;&#x95EE;&#xFF0C;&#x5219;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x5728;&#x7AEF;&#x53E3;&#x4E0A;&#x6267;&#x884C;&#x8F93;&#x5165;&#x6216;&#x8F93;&#x51FA;&#x3002;&#x5982;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x5F53;&#x63A5;&#x6536;&#x5230; read-char&#xFF0C;write-char &#x6216;&#x7C7B;&#x4F3C;&#x6D88;&#x606F;&#x65F6;&#xFF0C;&#x7AEF;&#x53E3;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x4E00;&#x5B9A;&#x4E0D;&#x80FD;&#x4F9D;&#x8D56;&#x4E8E;&#x8F93;&#x5165;&#x7F13;&#x51B2;&#x533A;&#x4E3A;&#x7A7A;&#x6216;&#x8F93;&#x51FA;&#x7F13;&#x51B2;&#x533A;&#x5DF2;&#x6EE1;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x7AEF;&#x53E3;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x53EA;&#x5728;&#x7981;&#x7528;&#x4E2D;&#x65AD;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x9700;&#x8981;&#x64CD;&#x4F5C;&#x7F13;&#x51B2;&#x533A;&#xFF08;&#x4F7F;&#x7528; with-interrupts-disabled&#xFF09;&#x3002;</p>
<p>&#x901A;&#x7528;&#x7AEF;&#x53E3;&#x662F;&#x901A;&#x8FC7;&#x672C;&#x7AE0;&#x540E;&#x9762;&#x5B9A;&#x4E49;&#x7684;&#x7AEF;&#x53E3;&#x6784;&#x9020;&#x8FC7;&#x7A0B; make-input-port&#xFF0C;make-output-port &#x548C; make-input/output-port &#x4E4B;&#x4E00;&#x521B;&#x5EFA;&#x7684;&#x3002;&#x7AEF;&#x53E3;&#x6709;&#x4E03;&#x4E2A;&#x53EF;&#x8BBF;&#x95EE;&#x5B57;&#x6BB5;&#xFF1A;</p>
<p>handler,
    &#x901A;&#x8FC7; port-handler &#x8BBF;&#x95EE;; 
output-buffer,
    &#x901A;&#x8FC7; port-output-buffer &#x8BBF;&#x95EE;, 
output-size,
    &#x901A;&#x8FC7; port-output-size &#x8BBF;&#x95EE;, 
output-index,
    &#x901A;&#x8FC7; port-output-index &#x8BBF;&#x95EE;, 
input-buffer,
    &#x901A;&#x8FC7; port-input-buffer &#x8BBF;&#x95EE;, 
input-size,
    &#x901A;&#x8FC7; port-input-size &#x8BBF;&#x95EE;, &#x4EE5;&#x53CA; 
input-index,
    &#x901A;&#x8FC7; port-input-index &#x8BBF;&#x95EE;. </p>
<p>output-size &#x548C; output-index &#x5B57;&#x6BB5;&#x4EC5;&#x5BF9;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x6709;&#x6548;&#xFF0C;input-size &#x548C; input-index &#x5B57;&#x6BB5;&#x4EC5;&#x5BF9;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x6709;&#x6548;&#x3002;&#x8F93;&#x51FA;&#x548C;&#x8F93;&#x5165;&#x7684;&#x5927;&#x5C0F;&#x548C;&#x7D22;&#x5F15;&#x5B57;&#x6BB5;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x76F8;&#x5E94;&#x7684; &quot;set-field!&quot; &#x8FC7;&#x7A0B;&#x8FDB;&#x884C;&#x66F4;&#x65B0;&#x3002;</p>
<p>&#x7AEF;&#x53E3;&#x7684;&#x8F93;&#x51FA;&#x5927;&#x5C0F;&#x51B3;&#x5B9A;&#x4E86;&#x5B9E;&#x9645;&#x53EF;&#x7528;&#x4E8E; write-char &#x5199;&#x5165;&#x7684;&#x7AEF;&#x53E3;&#x8F93;&#x51FA;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x8F93;&#x51FA;&#x5927;&#x5C0F;&#x901A;&#x5E38;&#x4E0E;&#x7AEF;&#x53E3;&#x8F93;&#x51FA;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x957F;&#x5EA6;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x7F16;&#x7A0B;&#x4EBA;&#x5458;&#x7684;&#x5224;&#x65AD;&#x5C06;&#x5176;&#x8BBE;&#x7F6E;&#x5F97;&#x66F4;&#x5C0F;&#xFF08;&#x4F46;&#x4E0D;&#x5C0F;&#x4E8E;&#x96F6;&#xFF09;&#x3002;&#x8F93;&#x51FA;&#x7D22;&#x5F15;&#x51B3;&#x5B9A;&#x5C06;&#x5728;&#x7AEF;&#x53E3;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x7684;&#x54EA;&#x4E2A;&#x4F4D;&#x7F6E;&#x5199;&#x5165;&#x4E0B;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x3002;&#x8F93;&#x51FA;&#x7D22;&#x5F15;&#x5E94;&#x4ECB;&#x4E8E; 0 &#x548C;&#x8F93;&#x51FA;&#x5927;&#x5C0F;&#x4E4B;&#x95F4;&#xFF08;&#x4E24;&#x7AEF;&#x5305;&#x542B;&#xFF09;&#x3002;&#x5982;&#x679C;&#x81EA;&#x4E0A;&#x6B21;&#x5237;&#x65B0;&#x7F13;&#x51B2;&#x533A;&#x4EE5;&#x6765;&#x672A;&#x53D1;&#x751F;&#x4EFB;&#x4F55;&#x8F93;&#x51FA;&#xFF0C;&#x5219;&#x8F93;&#x51FA;&#x7D22;&#x5F15;&#x5E94;&#x4E3A; 0. &#x5982;&#x679C;&#x7D22;&#x5F15;&#x5C0F;&#x4E8E;&#x8F93;&#x51FA;&#x5927;&#x5C0F;&#xFF0C;&#x5219; write-char &#x5C06;&#x5176;&#x5B57;&#x7B26;&#x53C2;&#x6570;&#x5B58;&#x50A8;&#x5230;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x7684;&#x6307;&#x5B9A;&#x5B57;&#x7B26;&#x4F4D;&#x7F6E;&#x5E76;&#x9012;&#x589E;&#x7D22;&#x5F15;&#x3002;&#x5982;&#x679C;&#x7D22;&#x5F15;&#x7B49;&#x4E8E;&#x8F93;&#x51FA;&#x5927;&#x5C0F;&#xFF0C;&#x5219; write-char &#x4FDD;&#x6301;&#x7AEF;&#x53E3;&#x7684;&#x5B57;&#x6BB5;&#x4E0D;&#x53D8;&#x5E76;&#x8C03;&#x7528;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x7AEF;&#x53E3;&#x7684;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#x51B3;&#x5B9A;&#x4E86;&#x5B9E;&#x9645;&#x53EF;&#x7528;&#x4E8E; read-char &#x8BFB;&#x53D6;&#x7684;&#x7AEF;&#x53E3;&#x8F93;&#x5165;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x7AEF;&#x53E3;&#x7684;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#x548C;&#x8F93;&#x5165;&#x7D22;&#x5F15;&#x7684;&#x7EA6;&#x675F;&#x65B9;&#x5F0F;&#x4E0E;&#x8F93;&#x51FA;&#x5927;&#x5C0F;&#x548C;&#x8F93;&#x51FA;&#x7D22;&#x5F15;&#x76F8;&#x540C;&#xFF0C;&#x5373;&#xFF0C;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#x5FC5;&#x987B;&#x4ECB;&#x4E8E; 0 &#x548C;&#x8F93;&#x5165;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x957F;&#x5EA6;&#xFF08;&#x4E24;&#x7AEF;&#x5305;&#x542B;&#xFF09;&#x4E4B;&#x95F4;&#xFF0C;&#x8F93;&#x5165;&#x7D22;&#x5F15;&#x5FC5;&#x987B;&#x4ECB;&#x4E8E; 0 &#x548C;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#x4E4B;&#x95F4;&#xFF08;&#x4E24;&#x7AEF;&#x5305;&#x542B;&#xFF09;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x7531;&#x4E8E;&#x53EF;&#x8BFB;&#x53D6;&#x7684;&#x5B57;&#x7B26;&#x6570;&#x5C11;&#x4E8E;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x5BB9;&#x91CF;&#xFF0C;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#x5C0F;&#x4E8E;&#x8F93;&#x5165;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x957F;&#x5EA6;&#x3002;&#x8F93;&#x5165;&#x7D22;&#x5F15;&#x51B3;&#x5B9A;&#x5C06;&#x4ECE;&#x8F93;&#x5165;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x7684;&#x54EA;&#x4E2A;&#x4F4D;&#x7F6E;&#x8BFB;&#x53D6;&#x4E0B;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x3002;&#x5982;&#x679C;&#x7D22;&#x5F15;&#x5C0F;&#x4E8E;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#xFF0C;&#x5219; read-char &#x5C06;&#x63D0;&#x53D6;&#x6B64;&#x4F4D;&#x7F6E;&#x4E2D;&#x7684;&#x5B57;&#x7B26;&#xFF0C;&#x9012;&#x589E;&#x7D22;&#x5F15;&#x5E76;&#x8FD4;&#x56DE;&#x8BE5;&#x5B57;&#x7B26;&#x3002;&#x5982;&#x679C;&#x7D22;&#x5F15;&#x7B49;&#x4E8E;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#xFF0C;&#x5219; read-char &#x4FDD;&#x6301;&#x7AEF;&#x53E3;&#x7684;&#x5B57;&#x6BB5;&#x4E0D;&#x53D8;&#x5E76;&#x8C03;&#x7528;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>peek-char &#x7684;&#x64CD;&#x4F5C;&#x7C7B;&#x4F3C;&#x4E8E; read-char&#xFF0C;&#x9664;&#x4E86;&#x5B83;&#x4E0D;&#x589E;&#x52A0;&#x8F93;&#x5165;&#x7D22;&#x5F15;&#x3002;&#x5982;&#x679C;&#x8F93;&#x5165;&#x7D22;&#x5F15;&#x5927;&#x4E8E; 0&#xFF0C;&#x5219; unread-char &#x4F1A;&#x9012;&#x51CF;&#x8F93;&#x5165;&#x7D22;&#x5F15;&#xFF0C;&#x5426;&#x5219;&#x5B83;&#x4F1A;&#x8C03;&#x7528;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x3002;&#x5982;&#x679C;&#x8F93;&#x5165;&#x7D22;&#x5F15;&#x5C0F;&#x4E8E;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#xFF0C;&#x5219; char-ready? &#x8FD4;&#x56DE;#t&#xFF0C;&#x5426;&#x5219;&#x5B83;&#x8C03;&#x7528;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x4E0A;&#x9762;&#x663E;&#x793A;&#x548C;&#x8BA8;&#x8BBA;&#x7684;&#x5B57;&#x6BB5;&#x5728;&#x903B;&#x8F91;&#x4E0A;&#x5B58;&#x5728;&#x4E8E;&#x7AEF;&#x53E3;&#x4E2D;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x53EF;&#x80FD;&#x4E0D;&#x540C;&#x3002;&#x5F53;&#x524D;&#x7684; Chez Scheme &#x5B9E;&#x73B0;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x8868;&#x793A;&#xFF0C;&#x5141;&#x8BB8;&#x4EE5;&#x6700;&#x5C0F;&#x7684;&#x5F00;&#x9500;&#x5BF9; read-char&#xFF0C;write-char &#x53CA;&#x7C7B;&#x4F3C;&#x64CD;&#x4F5C;&#x8FDB;&#x884C;&#x5F00;&#x653E;&#x7F16;&#x7801;&#x3002;&#x8BBF;&#x95EE;&#x548C;&#x8D4B;&#x503C;&#x8FD0;&#x7B97;&#x7B26;&#x6267;&#x884C;&#x5B9E;&#x9645;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#x4E0E;&#x4E0A;&#x9762;&#x663E;&#x793A;&#x7684;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#x4E4B;&#x95F4;&#x7684;&#x8F6C;&#x6362;&#x3002;</p>
<p>&#x63A5;&#x6536;&#x6D88;&#x606F;&#x7684;&#x7AEF;&#x53E3;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x8FD4;&#x56DE;&#x9002;&#x7528;&#x4E8E;&#x76F8;&#x5E94;&#x64CD;&#x4F5C;&#x7684;&#x503C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x63A5;&#x6536; read-char &#x6D88;&#x606F;&#x7684;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x6216; eof &#x5BF9;&#x8C61;&#xFF08;&#x5982;&#x679C;&#x5B83;&#x8FD4;&#x56DE;&#xFF09;&#x3002;&#x5BF9;&#x4E8E;&#x8FD4;&#x56DE;&#x672A;&#x6307;&#x5B9A;&#x503C;&#x7684;&#x64CD;&#x4F5C;&#xFF08;&#x4F8B;&#x5982; close-port&#xFF09;&#xFF0C;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x4E0D;&#x9700;&#x8981;&#x8FD4;&#x56DE;&#x4EFB;&#x4F55;&#x7279;&#x5B9A;&#x503C;&#x3002;</p>
<h2 id="92-&#x6587;&#x4EF6;&#x9009;&#x9879;">9.2. &#x6587;&#x4EF6;&#x9009;&#x9879;</h2>
<p>&#x300A;Scheme &#x8BED;&#x8A00;&#x4FEE;&#x8BA2;<sup>6</sup>&#x62A5;&#x544A;&#x300B;&#x8981;&#x6C42;&#x6587;&#x4EF6;&#x9009;&#x9879;&#x679A;&#x4E3E;&#x96C6;&#x5408;&#x7684;&#x5168;&#x96C6;&#x5FC5;&#x987B;&#x5305;&#x542B; no-create&#xFF0C;no-fail &#x548C; no-truncate&#xFF0C;&#x5176;&#x542B;&#x4E49;&#x5728;&#x300A;Scheme &#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x300B;&#x7B2C; 4 &#x7248; 7.2 &#x8282;&#x4E2D;&#x5173;&#x4E8E;&#x6587;&#x4EF6;&#x9009;&#x9879;&#x8BED;&#x6CD5;&#x7684;&#x4ECB;&#x7ECD;&#x4E2D;&#x6709;&#x6240;&#x63CF;&#x8FF0;&#x3002;Chez Scheme &#x5B9A;&#x4E49;&#x4E86;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x6587;&#x4EF6;&#x9009;&#x9879;&#xFF1A;</p>
<p>compressed:
    &#x5199;&#x5165;&#x65F6;&#x5E94;&#x538B;&#x7F29;&#x8F93;&#x51FA;&#x6587;&#x4EF6;; &#x8BFB;&#x53D6;&#x65F6;&#x5E94;&#x89E3;&#x538B;&#x7F29;&#x538B;&#x7F29;&#x7684;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x3002;</p>
<p>replace:
    &#x4EC5;&#x7528;&#x4E8E;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#xFF0C;&#x66FF;&#x6362;&#xFF08;&#x5220;&#x9664;&#x5E76;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#xFF09;&#x73B0;&#x6709;&#x6587;&#x4EF6;&#xFF08;&#x5982;&#x679C;&#x5B58;&#x5728;&#xFF09;&#x3002;</p>
<p>exclusive:
    &#x4EC5;&#x7528;&#x4E8E;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#xFF0C;&#x9501;&#x5B9A;&#x6587;&#x4EF6;&#x4EE5;&#x8FDB;&#x884C;&#x72EC;&#x5360;&#x8BBF;&#x95EE;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x9501;&#x5B9A;&#x662F;&#x5EFA;&#x8BAE;&#x6027;&#x7684;&#xFF0C;&#x5373;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x5176;&#x5B83;&#x8FDB;&#x7A0B;&#x4E5F;&#x8BD5;&#x56FE;&#x72EC;&#x5360;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x5B83;&#x624D;&#x4F1A;&#x7981;&#x6B62;&#x5B83;&#x4EEC;&#x8BBF;&#x95EE;&#x3002;</p>
<p>append:
    &#x4EC5;&#x7528;&#x4E8E;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#xFF0C;&#x5728;&#x6BCF;&#x6B21;&#x5199;&#x5165;&#x4E4B;&#x524D;&#x5C06;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x7F6E;&#x4E8E;&#x6587;&#x4EF6;&#x672B;&#x5C3E;&#xFF0C;&#x4ECE;&#x800C;&#x59CB;&#x7EC8;&#x5C06;&#x53D1;&#x9001;&#x5230;&#x7AEF;&#x53E3;&#x7684;&#x8F93;&#x51FA;&#x9644;&#x52A0;&#x5230;&#x6587;&#x4EF6;&#x672B;&#x5C3E;&#x3002;</p>
<p>perm-set-user-id:
    &#x4EC5;&#x7528;&#x4E8E;&#x57FA;&#x4E8E; Unix &#x7684;&#x7CFB;&#x7EDF;&#x4E0B;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#xFF0C;&#x8BBE;&#x7F6E; user-id &#x4F4D;&#x3002;</p>
<p>perm-set-group-id:
    &#x4EC5;&#x7528;&#x4E8E;&#x57FA;&#x4E8E; Unix &#x7684;&#x7CFB;&#x7EDF;&#x4E0B;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#xFF0C;&#x8BBE;&#x7F6E; group-id &#x4F4D;&#x3002;</p>
<p>perm-sticky:
    &#x4EC5;&#x7528;&#x4E8E;&#x57FA;&#x4E8E; Unix &#x7684;&#x7CFB;&#x7EDF;&#x4E0B;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#xFF0C;&#x8BBE;&#x7F6E; sticky &#x4F4D;&#x3002;</p>
<p>perm-no-user-read:
    &#x4EC5;&#x7528;&#x4E8E;&#x57FA;&#x4E8E; Unix &#x7684;&#x7CFB;&#x7EDF;&#x4E0B;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#xFF0C;&#x4E0D;&#x8BBE;&#x7F6E;&#x7528;&#x6237;&#x8BFB;&#x53D6;&#x4F4D;&#x3002;&#xFF08;&#x7528;&#x6237;&#x8BFB;&#x53D6;&#x4F4D;&#x9ED8;&#x8BA4;&#x662F;&#x8BBE;&#x7F6E;&#x7684;&#xFF0C;&#x9664;&#x975E;&#x88AB;&#x8FDB;&#x7A0B; umask &#x5C4F;&#x853D;&#x3002;&#xFF09;</p>
<p>perm-no-user-write:
    &#x4EC5;&#x7528;&#x4E8E;&#x57FA;&#x4E8E; Unix &#x7684;&#x7CFB;&#x7EDF;&#x4E0B;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#xFF0C;&#x4E0D;&#x8BBE;&#x7F6E;&#x7528;&#x6237;&#x5199;&#x5165;&#x4F4D;&#x3002;&#xFF08;&#x7528;&#x6237;&#x5199;&#x5165;&#x4F4D;&#x9ED8;&#x8BA4;&#x662F;&#x8BBE;&#x7F6E;&#x7684;&#xFF0C;&#x9664;&#x975E;&#x88AB;&#x8FDB;&#x7A0B; umask &#x5C4F;&#x853D;&#x3002;&#xFF09;</p>
<p>perm-user-execute:
    &#x4EC5;&#x7528;&#x4E8E;&#x57FA;&#x4E8E; Unix &#x7684;&#x7CFB;&#x7EDF;&#x4E0B;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#xFF0C;&#x9664;&#x975E;&#x88AB;&#x8FDB;&#x7A0B; umask &#x5C4F;&#x853D;&#xFF0C;&#x5426;&#x5219;&#x8BBE;&#x7F6E;&#x7528;&#x6237;&#x6267;&#x884C;&#x4F4D;&#x3002;&#xFF08;&#x7528;&#x6237;&#x6267;&#x884C;&#x4F4D;&#x9ED8;&#x8BA4;&#x662F;&#x4E0D;&#x8BBE;&#x7F6E;&#x7684;&#x3002;&#xFF09;</p>
<p>perm-no-group-read:
    &#x4EC5;&#x7528;&#x4E8E;&#x57FA;&#x4E8E; Unix &#x7684;&#x7CFB;&#x7EDF;&#x4E0B;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#xFF0C;&#x4E0D;&#x8BBE;&#x7F6E;&#x7EC4;&#x8BFB;&#x53D6;&#x4F4D;&#x3002;&#xFF08;&#x7EC4;&#x8BFB;&#x53D6;&#x4F4D;&#x9ED8;&#x8BA4;&#x662F;&#x8BBE;&#x7F6E;&#x7684;&#xFF0C;&#x9664;&#x975E;&#x88AB;&#x8FDB;&#x7A0B; umask &#x5C4F;&#x853D;&#x3002;&#xFF09;</p>
<p>perm-no-group-write:
    &#x4EC5;&#x7528;&#x4E8E;&#x57FA;&#x4E8E; Unix &#x7684;&#x7CFB;&#x7EDF;&#x4E0B;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#xFF0C;&#x4E0D;&#x8BBE;&#x7F6E;&#x7EC4;&#x5199;&#x5165;&#x4F4D;&#x3002;&#xFF08;&#x7EC4;&#x5199;&#x5165;&#x4F4D;&#x9ED8;&#x8BA4;&#x662F;&#x8BBE;&#x7F6E;&#x7684;&#xFF0C;&#x9664;&#x975E;&#x88AB;&#x8FDB;&#x7A0B; umask &#x5C4F;&#x853D;&#x3002;&#xFF09;</p>
<p>perm-group-execute:
    &#x4EC5;&#x7528;&#x4E8E;&#x57FA;&#x4E8E; Unix &#x7684;&#x7CFB;&#x7EDF;&#x4E0B;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#xFF0C;&#x9664;&#x975E;&#x88AB;&#x8FDB;&#x7A0B; umask &#x5C4F;&#x853D;&#xFF0C;&#x5426;&#x5219;&#x8BBE;&#x7F6E;&#x7EC4;&#x6267;&#x884C;&#x4F4D;&#x3002;&#xFF08;&#x7EC4;&#x6267;&#x884C;&#x4F4D;&#x9ED8;&#x8BA4;&#x662F;&#x4E0D;&#x8BBE;&#x7F6E;&#x7684;&#x3002;&#xFF09;</p>
<p>perm-no-other-read:
    &#x4EC5;&#x7528;&#x4E8E;&#x57FA;&#x4E8E; Unix &#x7684;&#x7CFB;&#x7EDF;&#x4E0B;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#xFF0C;&#x4E0D;&#x8BBE;&#x7F6E;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x8BFB;&#x53D6;&#x4F4D;&#x3002;&#xFF08;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x8BFB;&#x53D6;&#x4F4D;&#x9ED8;&#x8BA4;&#x662F;&#x8BBE;&#x7F6E;&#x7684;&#xFF0C;&#x9664;&#x975E;&#x88AB;&#x8FDB;&#x7A0B; umask &#x5C4F;&#x853D;&#x3002;&#xFF09;</p>
<p>perm-no-other-write:
    &#x4EC5;&#x7528;&#x4E8E;&#x57FA;&#x4E8E; Unix &#x7684;&#x7CFB;&#x7EDF;&#x4E0B;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#xFF0C;&#x4E0D;&#x8BBE;&#x7F6E;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x5199;&#x5165;&#x4F4D;&#x3002;&#xFF08;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x5199;&#x5165;&#x4F4D;&#x9ED8;&#x8BA4;&#x662F;&#x8BBE;&#x7F6E;&#x7684;&#xFF0C;&#x9664;&#x975E;&#x88AB;&#x8FDB;&#x7A0B; umask &#x5C4F;&#x853D;&#x3002;&#xFF09;</p>
<p>perm-other-execute:
    &#x4EC5;&#x7528;&#x4E8E;&#x57FA;&#x4E8E; Unix &#x7684;&#x7CFB;&#x7EDF;&#x4E0B;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#xFF0C;&#x9664;&#x975E;&#x88AB;&#x8FDB;&#x7A0B; umask &#x5C4F;&#x853D;&#xFF0C;&#x5426;&#x5219;&#x8BBE;&#x7F6E;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x6267;&#x884C;&#x4F4D;&#x3002;&#xFF08;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x6267;&#x884C;&#x4F4D;&#x9ED8;&#x8BA4;&#x662F;&#x4E0D;&#x8BBE;&#x7F6E;&#x7684;&#x3002;&#xFF09;</p>
<h2 id="93-&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;">9.3. &#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;</h2>
<p>&#x300A;Scheme &#x8BED;&#x8A00;&#x4FEE;&#x8BA2;<sup>6</sup>&#x62A5;&#x544A;&#x300B;&#x63D0;&#x4F9B;&#x4E86;&#x4E09;&#x79CD;&#x5185;&#x7F6E;&#x7F16;&#x89E3;&#x7801;&#x5668;&#xFF1A;latin-1 &#x7F16;&#x89E3;&#x7801;&#x5668;&#xFF0C;utf-8 &#x7F16;&#x89E3;&#x7801;&#x5668;&#x548C; utf-16 &#x7F16;&#x89E3;&#x7801;&#x5668;&#x3002;Chez Scheme &#x63D0;&#x4F9B;&#x4E86;&#x4E09;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x7F16;&#x89E3;&#x7801;&#x5668;&#xFF1A;utf-16le &#x7F16;&#x89E3;&#x7801;&#x5668;&#xFF0C;utf-16be &#x7F16;&#x89E3;&#x7801;&#x5668;&#x548C;&#x7528;&#x4E8E;&#x975E; Unicode &#x5B57;&#x7B26;&#x96C6;&#x7684;&#x201C;iconv&#x201D;&#x7F16;&#x89E3;&#x7801;&#x5668;&#x3002;&#x5B83;&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x6807;&#x51C6; utf-16 &#x7F16;&#x89E3;&#x7801;&#x5668;&#x7684;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#xFF0C;&#x9ED8;&#x8BA4;&#x4E3A;&#x5C0F;&#x7AEF;&#x5E8F;&#x683C;&#x5F0F;&#x800C;&#x4E0D;&#x662F;&#x9ED8;&#x8BA4;&#x7684;&#x5927;&#x7AEF;&#x5E8F;&#x683C;&#x5F0F;&#x3002;&#x672C;&#x8282;&#x63CF;&#x8FF0;&#x4E86;&#x8FD9;&#x4E9B;&#x7F16;&#x89E3;&#x7801;&#x5668;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A; current-transcoder &#x53C2;&#x6570;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#x4E3A;&#x9690;&#x5F0F;&#x65F6;&#x51B3;&#x5B9A;&#x7528;&#x4E8E;&#x6587;&#x672C;&#x7AEF;&#x53E3;&#x7684;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#xFF0C;&#x5982; open-input-file &#x6216; load&#xFF0C;&#x4EE5;&#x53CA;&#x8C13;&#x8BCD; transcoder?, &#x6807;&#x51C6;&#x4E2D;&#x5E94;&#x8BE5;&#x5305;&#x542B;&#xFF0C;&#x4F46;&#x5374;&#x6CA1;&#x6709;&#x3002;</p>
<p>procedure: <code>(utf-16-codec)</code>
procedure: <code>(utf-16-codec endianness)</code>
procedure: <code>(utf-16le-codec)</code>
procedure: <code>(utf-16be-codec)</code>
returns: &#x4E00;&#x4E2A;&#x7F16;&#x89E3;&#x7801;&#x5668;
libraries: (chezscheme)</p>
<p>endianness &#x5FC5;&#x987B;&#x662F;&#x7B26;&#x53F7; big &#x6216;&#x7B26;&#x53F7; little.</p>
<p>utf-16-codec &#x8FD4;&#x56DE;&#x7684;&#x7F16;&#x89E3;&#x7801;&#x5668;&#x53EF;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x548C;&#x5904;&#x7406; UTF-16 &#x683C;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x3002;&#x5F53;&#x8C03;&#x7528;&#x65F6;&#x4E0D;&#x4F20;&#x5165;&#x53C2;&#x6570; endianness &#x6216;&#x53C2;&#x6570; endianness &#x4E3A; big &#x65F6;&#xFF0C;utf-16-codec &#x8FD4;&#x56DE;&#x6807;&#x51C6; UTF-16 &#x6570;&#x636E;&#x7684;&#x7F16;&#x89E3;&#x7801;&#x5668;&#xFF0C;&#x5373;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x5B57;&#x8282;&#x987A;&#x5E8F;&#x6807;&#x8BB0;&#xFF08;BOM&#xFF09;&#xFF0C;&#x5219;&#x9ED8;&#x8BA4;&#x4E3A;&#x5927;&#x7AEF;&#x5E8F;&#x683C;&#x5F0F;&#x7684;&#x7F16;&#x89E3;&#x7801;&#x5668;&#x3002;</p>
<p>&#x5F53;&#x4F7F;&#x7528;&#x57FA;&#x4E8E;&#x6B64;&#x7F16;&#x89E3;&#x7801;&#x5668;&#x7684;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#x5BF9;&#x8F93;&#x51FA;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x65F6;&#xFF0C;&#x4F1A;&#x5728;&#x5199;&#x5165;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E4B;&#x524D;&#x53D1;&#x51FA; BOM&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x5B57;&#x7B26;&#x90FD;&#x4EE5;&#x5927;&#x7AEF;&#x5E8F;&#x683C;&#x5F0F;&#x5199;&#x4E3A; UTF-16 &#x5B57;&#x7B26;&#x3002; &#x5BF9;&#x4E8E;&#x8F93;&#x5165;&#xFF0C;&#x5728;&#x8F93;&#x5165;&#x7684;&#x5F00;&#x59CB;&#x5904;&#x67E5;&#x627E; BOM&#xFF0C;&#x5982;&#x679C;&#x5B58;&#x5728;&#xFF0C;&#x5219;&#x63A7;&#x5236;&#x5176;&#x4F59; UTF-16 &#x5B57;&#x7B26;&#x7684;&#x5B57;&#x8282;&#x5E8F;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709; BOM&#xFF0C;&#x5219;&#x5047;&#x5B9A;&#x4E3A;&#x5927;&#x7AEF;&#x5E8F;&#x3002;&#x5BF9;&#x4E8E;&#x8F93;&#x5165;-&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x5199;&#x5165;&#x4E4B;&#x524D;&#x8BFB;&#x53D6;&#x6587;&#x4EF6;&#xFF0C;&#x5219;&#x4E0D;&#x4F1A;&#x53D1;&#x51FA; BOM&#xFF0C;&#x5982;&#x679C;&#x5728;&#x8BFB;&#x53D6;&#x4E4B;&#x524D;&#x5199;&#x5165;&#x6587;&#x4EF6;&#xFF0C;&#x5219;&#x4E0D;&#x4F1A;&#x67E5;&#x627E; BOM&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x901A;&#x8FC7; transcoded-port &#x521B;&#x5EFA;&#x7684;&#x6587;&#x672C;&#x7AEF;&#x53E3;&#xFF0C;&#x4EC5;&#x5F53;&#x4F20;&#x9012;&#x7ED9; transcoded-port &#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x7AEF;&#x53E3;&#x4F4D;&#x4E8E;&#x6570;&#x636E;&#x6D41;&#x6216;&#x6587;&#x4EF6;&#x7684;&#x5F00;&#x5934;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#x5199;&#x5165;&#x6216;&#x8BFB;&#x53D6;&#x7684; BOM &#x624D;&#x4F1A;&#x51FA;&#x73B0;&#x5728;&#x5E95;&#x5C42;&#x6570;&#x636E;&#x6D41;&#x6216;&#x6587;&#x4EF6;&#x7684;&#x5F00;&#x5934;&#x3002;&#x5F53;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x662F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x5C1D;&#x8BD5;&#x5C06;&#x7AEF;&#x53E3;&#x91CD;&#x65B0;&#x5B9A;&#x4F4D;&#x5230;&#x6570;&#x636E;&#x6D41;&#x6216;&#x6587;&#x4EF6;&#x7684;&#x5F00;&#x5934;&#xFF0C;&#x5B83;&#x4F1A;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x6807;&#x5FD7;&#xFF0C;&#x8BE5;&#x6807;&#x5FD7;&#x4F1A;&#x5BFC;&#x81F4; set-port-position! &#x5C06;&#x7AEF;&#x53E3;&#x5B9A;&#x4F4D;&#x5728; BOM &#x4E4B;&#x540E;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F; BOM &#x5F97;&#x4EE5;&#x4FDD;&#x7559;&#x3002;</p>
<p>&#x8C03;&#x7528;&#x65F6;&#x53C2;&#x6570; endianness &#x4E3A; little &#x65F6;&#xFF0C;utf-16-codec &#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x9ED8;&#x8BA4;&#x4E3A;&#x5C0F;&#x7AEF;&#x5E8F;&#x683C;&#x5F0F;&#x7684;&#x7F16;&#x89E3;&#x7801;&#x5668;&#xFF0C;&#x7528;&#x4E8E;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x3002;&#x5BF9;&#x4E8E;&#x5728;&#x8BFB;&#x53D6;&#x4E4B;&#x524D;&#x5199;&#x5165;&#x7684;&#x7EAF;&#x8F93;&#x51FA;&#x6D41;&#x6216;&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x6D41;&#xFF0C;&#x7ED3;&#x679C;&#x4E3A;&#x6807;&#x51C6;&#x7684; UTF-16&#xFF0C;&#x5176;&#x4E2D; BOM &#x6307;&#x5B9A;&#x5C0F;&#x7AEF;&#x5E8F;&#x683C;&#x5F0F;&#xFF0C;&#x540E;&#x9762;&#x8DDF;&#x7740;&#x5C0F;&#x7AEF;&#x5B57;&#x8282;&#x5E8F;&#x7684;&#x5B57;&#x7B26;&#x3002;&#x5BF9;&#x4E8E;&#x5728;&#x5199;&#x5165;&#x4E4B;&#x524D;&#x8BFB;&#x53D6;&#x7684;&#x7EAF;&#x8F93;&#x5165;&#x6D41;&#x6216;&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x6D41;&#xFF0C;&#x6B64;&#x7F16;&#x89E3;&#x7801;&#x5668;&#x5141;&#x8BB8;&#x7A0B;&#x5E8F;&#x4ECE;&#x8F93;&#x5165;&#x6D41;&#x4E2D;&#x8BFB;&#x53D6;&#xFF0C;&#x8FD9;&#x4E9B;&#x8F93;&#x5165;&#x6D41;&#x4EE5; BOM &#x5F00;&#x5934;&#x6216;&#x4EE5; UTF-16LE &#x683C;&#x5F0F;&#x7F16;&#x7801;&#x3002;&#x8FD9;&#x5BF9;&#x4E8E;&#x5904;&#x7406;&#x53EF;&#x80FD;&#x7531;&#x58F0;&#x79F0;&#x751F;&#x6210; UTF-16 &#x6587;&#x4EF6;&#x4F46;&#x5B9E;&#x9645;&#x751F;&#x6210; UTF-16LE &#x6587;&#x4EF6;&#x7684;&#x65E7; Windows &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x751F;&#x6210;&#x7684;&#x6587;&#x4EF6;&#x683C;&#x5916;&#x6709;&#x7528;&#x3002;</p>
<p>&#x300A;Scheme &#x8BED;&#x8A00;&#x4FEE;&#x8BA2;<sup>6</sup>&#x62A5;&#x544A;&#x300B;&#x7248;&#x672C;&#x7684; utf-16-codec &#x7F3A;&#x5C11;&#x53EF;&#x9009;&#x7684; endianness &#x53C2;&#x6570;&#x3002;</p>
<p>utf-16le-codec &#x548C; utf-16be-codec &#x8FD4;&#x56DE;&#x7684;&#x7F16;&#x89E3;&#x7801;&#x5668;&#x7528;&#x4E8E;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165; UTF-16LE &#x548C; UTF-16BE &#x683C;&#x5F0F;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5373;&#xFF0C;&#x91C7;&#x7528;&#x5C0F;&#x7AEF;&#x6216;&#x5927;&#x7AEF;&#x5B57;&#x8282;&#x5E8F;&#xFF0C;&#x4E14;&#x4E0D;&#x5E26;&#x6709; BOM &#x7684; UTF-16. &#x5BF9;&#x4E8E;&#x8F93;&#x51FA;&#xFF0C;&#x7531;&#x4E8E; BOM &#x4E0D;&#x4F1A;&#x9690;&#x5F0F;&#x6DFB;&#x52A0;&#xFF0C;&#x5E76;&#x4E14; BOM &#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x666E;&#x901A;&#x5B57;&#x7B26;&#x663E;&#x5F0F;&#x6DFB;&#x52A0;&#xFF0C;&#x56E0;&#x800C;&#x8FD9;&#x4E9B;&#x7F16;&#x89E3;&#x7801;&#x5668;&#x5BF9;&#x4E8E;&#x63A7;&#x5236;&#x662F;&#x5426;&#x4EE5;&#x53CA;&#x5728;&#x4F55;&#x5904;&#x6DFB;&#x52A0; BOM &#x5341;&#x5206;&#x6709;&#x7528;&#x3002;&#x5BF9;&#x4E8E;&#x8F93;&#x5165;&#xFF0C;&#x8FD9;&#x4E9B;&#x7F16;&#x89E3;&#x7801;&#x5668;&#x5BF9;&#x4E8E;&#x5904;&#x7406;&#x5DF2;&#x77E5;&#x4E3A;&#x5C0F;&#x7AEF;&#x5E8F;&#x6216;&#x5927;&#x7AEF;&#x5E8F;&#x683C;&#x5F0F;&#x800C;&#x6CA1;&#x6709; BOM &#x7684;&#x6587;&#x4EF6;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;</p>
<p>procedure: <code>(iconv-codec code-page)</code>
returns: &#x4E00;&#x4E2A;&#x7F16;&#x89E3;&#x7801;&#x5668;
libraries: (chezscheme)</p>
<p>code-page &#x5FC5;&#x987B;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x6807;&#x8BC6;&#x76EE;&#x6807;&#x673A;&#x5668;&#x4E0A;&#x5B89;&#x88C5;&#x7684; iconv &#x5E93;&#x63A5;&#x53D7;&#x7684;&#x7F16;&#x89E3;&#x7801;&#x5668;&#x3002;&#x6B64;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x7684;&#x7F16;&#x89E3;&#x7801;&#x5668;&#x53EF;&#x7528;&#x4E8E;&#x8F6C;&#x6362; iconv &#x652F;&#x6301;&#x7684;&#x975E; Unicode &#x5355;&#x5B57;&#x8282;&#x548C;&#x591A;&#x5B57;&#x8282;&#x5B57;&#x7B26;&#x96C6;&#x3002;&#x5F53;&#x5728;&#x8F93;&#x5165;&#x65B9;&#x5411;&#x4E0A;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x7F16;&#x89E3;&#x7801;&#x5668;&#x5C06;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#x8F6C;&#x6362;&#x4E3A; Scheme &#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5E76;&#x4E14;&#x5F53;&#x5728;&#x8F93;&#x51FA;&#x65B9;&#x5411;&#x4E0A;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x5B83;&#x5C06; Scheme &#x5B57;&#x7B26;&#x4E32;&#x8F6C;&#x6362;&#x4E3A;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#x3002;</p>
<p>&#x652F;&#x6301;&#x7684;&#x4EE3;&#x7801;&#x9875;&#x96C6;&#x53D6;&#x51B3;&#x4E8E; iconv &#x7684;&#x53EF;&#x7528;&#x7248;&#x672C;; &#x8BF7;&#x53C2;&#x9605; iconv &#x6587;&#x6863;&#x6216;&#x4F7F;&#x7528; shell &#x547D;&#x4EE4; iconv &#x2013;list &#x83B7;&#x53D6;&#x652F;&#x6301;&#x7684;&#x4EE3;&#x7801;&#x9875;&#x5217;&#x8868;&#x3002;</p>
<p>&#x867D;&#x7136; Windows &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0D;&#x63D0;&#x4F9B; iconv &#x5E93;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x63D0;&#x4F9B; iconv &#x52A8;&#x6001;&#x94FE;&#x63A5;&#x5E93;&#xFF08;&#x540D;&#x4E3A; iconv.dll&#xFF0C;libiconv.dll &#x6216; libiconv-2.dll&#xFF09;&#x5728; Windows &#x7CFB;&#x7EDF;&#x4E0A;&#x4F7F;&#x7528; iconv-codec. &#x8FD9;&#x4E9B;&#x52A8;&#x6001;&#x94FE;&#x63A5;&#x5E93;&#x63D0;&#x4F9B;&#x4E86;&#x7B26;&#x5408; Posix &#x6807;&#x51C6;&#x7684; iconv<sub>open</sub>&#xFF0C;iconv &#x548C; iconv<sub>close</sub> &#x5165;&#x53E3;&#xFF0C;&#x53EF;&#x80FD;&#x5C31;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x540D;&#x79F0;&#xFF0C;&#x6216;&#x4F7F;&#x7528;&#x66FF;&#x4EE3;&#x540D;&#x79F0; libiconv<sub>open</sub>&#xFF0C;libiconv &#x548C; libiconv<sub>close</sub>&#x3002;dll &#x5FC5;&#x987B;&#x4F4D;&#x4E8E; dll &#x7684;&#x6807;&#x51C6;&#x4F4D;&#x7F6E;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x8FDB;&#x7A0B;&#x7B2C;&#x4E00;&#x6B21;&#x8C03;&#x7528; iconv-codec &#x65F6;&#x7684;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E2D;&#x3002;</p>
<p>thread parameter: <code>current-transcoder</code>
libraries: (chezscheme)</p>
<p>&#x6BCF;&#x5F53;&#x4F7F;&#x7528;&#x9690;&#x5F0F;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#x6253;&#x5F00;&#x6587;&#x672C;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x901A;&#x8FC7; open-input-file &#x548C;&#x5176;&#x4ED6;&#x4FBF;&#x6377;&#x7684; I/O &#x8FC7;&#x7A0B;&#xFF0C;compile-file include, load, &#x548C; pretty-file, &#x5C31;&#x4F7F;&#x7528;&#x53C2;&#x6570;&#x5BF9;&#x8C61; current-transcoder &#x7684;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#x503C;&#x3002;&#x5B83;&#x7684;&#x521D;&#x59CB;&#x503C;&#x662F; native-transcoder &#x8FC7;&#x7A0B;&#x7684;&#x503C;&#x3002;</p>
<p>procedure: <code>(transcoder? obj)</code>
&#x8FD4;&#x56DE;: &#x5982;&#x679C; <code>obj</code> &#x662F;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#xFF0C;&#x5219;&#x4E3A; <code>#t</code>, &#x5426;&#x5219;&#x4E3A; <code>#f</code>.
libraries: (chezscheme)</p>
<h2 id="94-&#x7AEF;&#x53E3;&#x64CD;&#x4F5C;">9.4. &#x7AEF;&#x53E3;&#x64CD;&#x4F5C;</h2>
<p>&#x672C;&#x8282;&#x63CF;&#x8FF0;&#x4E86;&#x7528;&#x4E8E;&#x76F4;&#x63A5;&#x521B;&#x5EFA;&#xFF0C;&#x8BBF;&#x95EE;&#x548C;&#x66F4;&#x6539;&#x7AEF;&#x53E3;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x8FD8;&#x63CF;&#x8FF0;&#x4E86;&#x7AEF;&#x53E3;&#x4E0A;&#x7684;&#x4E00;&#x4E9B;&#x975E;&#x6807;&#x51C6;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x9664;&#x975E;&#x53E6;&#x6709;&#x8BF4;&#x660E;&#xFF0C;&#x5426;&#x5219;&#x8981;&#x6C42;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x6216;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x7684;&#x8FC7;&#x7A0B;&#x4E5F;&#x63A5;&#x53D7;&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF0C;&#x5373;&#xFF0C;&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x65E2;&#x662F;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x53C8;&#x662F;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;</p>
<p>procedure: <code>(make-input-port handler input-buffer)</code>
procedure: <code>(make-output-port handler output-buffer)</code>
procedure: <code>(make-input/output-port handler input-buffer output-buffer)</code>
returns: &#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6587;&#x672C;&#x7AEF;&#x53E3;
libraries: (chezscheme)</p>
<p>handler &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;input-buffer &#x548C; output-buffer &#x5FC5;&#x987B;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x6BCF;&#x4E2A;&#x8FC7;&#x7A0B;&#x90FD;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x7AEF;&#x53E3;&#x3002;&#x4E0E;&#x7AEF;&#x53E3;&#x5173;&#x8054;&#x7684;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x662F; handler&#xFF0C;&#x8F93;&#x5165;&#x7F13;&#x51B2;&#x533A;&#x662F; input-buffer, &#x8F93;&#x51FA;&#x7F13;&#x51B2;&#x533A;&#x662F; output-buffer. &#x5BF9;&#x4E8E; make-input-port&#xFF0C;&#x8F93;&#x51FA;&#x7F13;&#x51B2;&#x533A;&#x672A;&#x5B9A;&#x4E49;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E; make-output-port&#xFF0C;&#x8F93;&#x5165;&#x7F13;&#x51B2;&#x533A;&#x672A;&#x5B9A;&#x4E49;&#x3002;</p>
<p>&#x8F93;&#x5165;&#x6216;&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x7684;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#x521D;&#x59CB;&#x5316;&#x4E3A;&#x8F93;&#x5165;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x957F;&#x5EA6;&#xFF0C;&#x8F93;&#x5165;&#x7D22;&#x5F15;&#x8BBE;&#x7F6E;&#x4E3A; 0. &#x8F93;&#x51FA;&#x6216;&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x7684;&#x8F93;&#x51FA;&#x5927;&#x5C0F;&#x548C;&#x7D22;&#x5F15;&#x4E5F;&#x7C7B;&#x4F3C;&#x5730;&#x521D;&#x59CB;&#x5316;&#x3002;</p>
<p>&#x8F93;&#x5165;&#x6216;&#x8F93;&#x51FA;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x957F;&#x5EA6;&#x53EF;&#x4EE5;&#x4E3A;&#x96F6;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7F13;&#x51B2;&#x5B9E;&#x9645;&#x4E0A;&#x88AB;&#x7981;&#x7528;&#x3002;</p>
<p>procedure: <code>(port-handler port)</code>
returns: &#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;
libraries: (chezscheme)</p>
<p>&#x5BF9;&#x4E8E;&#x901A;&#x7528;&#x7AEF;&#x53E3;&#xFF0C;port-handler &#x8FD4;&#x56DE;&#x4F20;&#x9012;&#x7ED9;&#x4E0A;&#x8FF0;&#x901A;&#x7528;&#x7AEF;&#x53E3;&#x521B;&#x5EFA;&#x8FC7;&#x7A0B;&#x4E4B;&#x4E00;&#x7684;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x3002;&#x5BF9;&#x4E8E;&#x7531; open-input-file &#x548C;&#x7C7B;&#x4F3C;&#x8FC7;&#x7A0B;&#x521B;&#x5EFA;&#x7684;&#x7AEF;&#x53E3;&#xFF0C;port-handler &#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BE5;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x7528;&#x4E0E;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x8C03;&#x7528;&#x3002;</p>
<p>procedure: <code>(port-input-buffer input-port)</code>
procedure: <code>(port-input-size input-port)</code>
procedure: <code>(port-input-index input-port)</code>
procedure: <code>(textual-port-input-buffer textual-input-port)</code>
procedure: <code>(textual-port-input-size textual-input-port)</code>
procedure: <code>(textual-port-input-index textual-input-port)</code>
procedure: <code>(binary-port-input-buffer binary-input-port)</code>
procedure: <code>(binary-port-input-size binary-input-port)</code>
procedure: <code>(binary-port-input-index binary-input-port)</code>
returns: &#x53C2;&#x89C1;&#x4E0B;&#x6587;
libraries: (chezscheme)</p>
<p>&#x8FD9;&#x4E9B;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x7684;&#x8F93;&#x5165;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x5927;&#x5C0F;&#x6216;&#x7D22;&#x5F15;&#x3002;&#x4E13;&#x7528;&#x4E8E;&#x6587;&#x672C;&#x6216;&#x4E8C;&#x8FDB;&#x5236;&#x7AEF;&#x53E3;&#x7684;&#x53D8;&#x4F53;&#x8981;&#x6BD4;&#x5B83;&#x4EEC;&#x5BF9;&#x5E94;&#x7684;&#x901A;&#x7528;&#x7248;&#x672C;&#x7565;&#x4E3A;&#x9AD8;&#x6548;&#x3002;</p>
<p>procedure: <code>(set-port-input-index! input-port n)</code>
procedure: <code>(set-port-input-size! input-port n)</code>
procedure: <code>(set-port-input-buffer! input-port x)</code>
procedure: <code>(set-textual-port-input-index! textual-input-port n)</code>
procedure: <code>(set-textual-port-input-size! textual-input-port n)</code>
procedure: <code>(set-textual-port-input-buffer! textual-input-port string)</code>
procedure: <code>(set-binary-port-input-index! binary-input-port n)</code>
procedure: <code>(set-binary-port-input-size! binary-input-port n)</code>
procedure: <code>(set-binary-port-input-buffer! binary-input-port bytevector)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>&#x8FC7;&#x7A0B; set-port-input-index! &#x5C06; input-port &#x7684;&#x8F93;&#x5165;&#x7D22;&#x5F15;&#x5B57;&#x6BB5;&#x8BBE;&#x7F6E;&#x4E3A; n&#xFF0C;&#x8BE5;&#x5B57;&#x6BB5;&#x5FC5;&#x987B;&#x662F;&#x5C0F;&#x4E8E;&#x6216;&#x7B49;&#x4E8E;&#x7AEF;&#x53E3;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#x7684;&#x975E;&#x8D1F;&#x6574;&#x6570;&#x3002;</p>
<p>&#x8FC7;&#x7A0B; set-port-input-size! &#x5C06; input-port &#x7684;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#x5B57;&#x6BB5;&#x8BBE;&#x7F6E;&#x4E3A; n&#xFF0C;&#x8BE5;&#x5B57;&#x6BB5;&#x5FC5;&#x987B;&#x662F;&#x5C0F;&#x4E8E;&#x6216;&#x7B49;&#x4E8E;&#x7AEF;&#x53E3;&#x8F93;&#x5165;&#x7F13;&#x51B2;&#x533A;&#x5B57;&#x7B26;&#x4E32;&#x957F;&#x5EA6;&#x7684;&#x975E;&#x8D1F;&#x6574;&#x6570;&#x3002;&#x5B83;&#x8FD8;&#x5C06;&#x8F93;&#x5165;&#x7D22;&#x5F15;&#x8BBE;&#x7F6E;&#x4E3A; 0&#x3002;
&#x8FC7;&#x7A0B; set-port-input-buffer! &#x5C06; input-port &#x7684;&#x8F93;&#x5165;&#x7F13;&#x51B2;&#x533A;&#x5B57;&#x6BB5;&#x8BBE;&#x7F6E;&#x4E3A; x&#xFF0C;&#x8BE5;&#x5B57;&#x6BB5;&#x5FC5;&#x987B;&#x662F;&#x6587;&#x672C;&#x7AEF;&#x53E3;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x548C;&#x4E8C;&#x8FDB;&#x5236;&#x7AEF;&#x53E3;&#x7684;&#x5B57;&#x8282;&#x5411;&#x91CF;&#x3002;&#x5B83;&#x8FD8;&#x5C06;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#x8BBE;&#x7F6E;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#x6216; bytevector &#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x5E76;&#x5C06;&#x8F93;&#x5165;&#x7D22;&#x5F15;&#x8BBE;&#x7F6E;&#x4E3A; 0&#x3002;</p>
<p>&#x4E13;&#x7528;&#x4E8E;&#x6587;&#x672C;&#x6216;&#x4E8C;&#x8FDB;&#x5236;&#x7AEF;&#x53E3;&#x7684;&#x53D8;&#x4F53;&#x8981;&#x6BD4;&#x5B83;&#x4EEC;&#x5BF9;&#x5E94;&#x7684;&#x901A;&#x7528;&#x7248;&#x672C;&#x7565;&#x4E3A;&#x9AD8;&#x6548;&#x3002;</p>
<p>procedure: <code>(port-input-count input-port)</code>
procedure: <code>(textual-port-input-count textual-input-port)</code>
procedure: <code>(binary-port-input-count binary-input-port)</code>
returns: &#x53C2;&#x89C1;&#x4E0B;&#x6587;
libraries: (chezscheme)</p>
<p>&#x8FD9;&#x4E9B;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x7CBE;&#x786E;&#x7684;&#x6574;&#x6570;&#xFF0C;&#x8868;&#x793A;&#x8981;&#x4ECE;&#x7AEF;&#x53E3;&#x7684;&#x8F93;&#x5165;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x8BFB;&#x53D6;&#x7684;&#x5269;&#x4F59;&#x5B57;&#x7B26;&#x6216;&#x5B57;&#x8282;&#x6570;&#xFF0C;&#x5373;&#x7F13;&#x51B2;&#x533A;&#x5927;&#x5C0F;&#x548C;&#x7D22;&#x5F15;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x503C;&#x3002;</p>
<p>&#x4E13;&#x7528;&#x4E8E;&#x6587;&#x672C;&#x6216;&#x4E8C;&#x8FDB;&#x5236;&#x7AEF;&#x53E3;&#x7684;&#x53D8;&#x4F53;&#x8981;&#x6BD4;&#x5B83;&#x4EEC;&#x5BF9;&#x5E94;&#x7684;&#x901A;&#x7528;&#x7248;&#x672C;&#x7565;&#x4E3A;&#x9AD8;&#x6548;&#x3002;</p>
<p>procedure: <code>(port-input-empty? input-port)</code>
&#x8FD4;&#x56DE;: &#x5982;&#x679C;&#x7AEF;&#x53E3;&#x7684;&#x8F93;&#x5165;&#x7F13;&#x51B2;&#x533A;&#x4E0D;&#x5305;&#x542B;&#x66F4;&#x591A;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x4E3A; <code>#t</code>, &#x5426;&#x5219;&#x4E3A; <code>#f</code>.
libraries: (chezscheme)</p>
<p>&#x6B64;&#x8FC7;&#x7A0B;&#x786E;&#x5B9A;&#x7AEF;&#x53E3;&#x7684;&#x8F93;&#x5165;&#x8BA1;&#x6570;&#x662F;&#x5426;&#x4E3A;&#x96F6;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x8BA1;&#x7B97;&#x6216;&#x8FD4;&#x56DE;&#x5B9E;&#x9645;&#x8BA1;&#x6570;&#x3002;</p>
<p>procedure: <code>(port-output-buffer output-port)</code>
procedure: <code>(port-output-size output-port)</code>
procedure: <code>(port-output-index output-port)</code>
procedure: <code>(textual-port-output-buffer output-port)</code>
procedure: <code>(textual-port-output-size output-port)</code>
procedure: <code>(textual-port-output-index output-port)</code>
procedure: <code>(binary-port-output-buffer output-port)</code>
procedure: <code>(binary-port-output-size output-port)</code>
procedure: <code>(binary-port-output-index output-port)</code>
returns: &#x53C2;&#x89C1;&#x4E0B;&#x6587;
libraries: (chezscheme)</p>
<p>&#x8FD9;&#x4E9B;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x7684;&#x8F93;&#x51FA;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x5927;&#x5C0F;&#x6216;&#x7D22;&#x5F15;&#x3002;&#x4E13;&#x7528;&#x4E8E;&#x6587;&#x672C;&#x6216;&#x4E8C;&#x8FDB;&#x5236;&#x7AEF;&#x53E3;&#x7684;&#x53D8;&#x4F53;&#x8981;&#x6BD4;&#x5B83;&#x4EEC;&#x5BF9;&#x5E94;&#x7684;&#x901A;&#x7528;&#x7248;&#x672C;&#x7565;&#x4E3A;&#x9AD8;&#x6548;&#x3002;</p>
<p>procedure: <code>(set-port-output-index! output-port n)</code>
procedure: <code>(set-port-output-size! output-port n)</code>
procedure: <code>(set-port-output-buffer! output-port x)</code>
procedure: <code>(set-textual-port-output-index! textual-output-port n)</code>
procedure: <code>(set-textual-port-output-size! textual-output-port n)</code>
procedure: <code>(set-textual-port-output-buffer! textual-output-port string)</code>
procedure: <code>(set-binary-port-output-index! output-port n)</code>
procedure: <code>(set-binary-port-output-size! output-port n)</code>
procedure: <code>(set-binary-port-output-buffer! binary-output-port bytevector)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>&#x8FC7;&#x7A0B; set-port-output-index! &#x5C06;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x7684;&#x8F93;&#x51FA;&#x7D22;&#x5F15;&#x5B57;&#x6BB5;&#x8BBE;&#x7F6E;&#x4E3A; n&#xFF0C;&#x8BE5;&#x5B57;&#x6BB5;&#x5FC5;&#x987B;&#x662F;&#x5C0F;&#x4E8E;&#x6216;&#x7B49;&#x4E8E;&#x7AEF;&#x53E3;&#x8F93;&#x51FA;&#x5927;&#x5C0F;&#x7684;&#x975E;&#x8D1F;&#x6574;&#x6570;&#x3002;</p>
<p>&#x8FC7;&#x7A0B; set-port-output-size! &#x5C06;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x7684;&#x8F93;&#x51FA;&#x5927;&#x5C0F;&#x5B57;&#x6BB5;&#x8BBE;&#x7F6E;&#x4E3A; n&#xFF0C;&#x8BE5;&#x5B57;&#x6BB5;&#x5FC5;&#x987B;&#x662F;&#x5C0F;&#x4E8E;&#x6216;&#x7B49;&#x4E8E;&#x7AEF;&#x53E3;&#x8F93;&#x51FA;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x957F;&#x5EA6;&#x7684;&#x975E;&#x8D1F;&#x6574;&#x6570;&#x3002;&#x5B83;&#x8FD8;&#x5C06;&#x8F93;&#x51FA;&#x7D22;&#x5F15;&#x8BBE;&#x7F6E;&#x4E3A; 0&#x3002;</p>
<p>&#x8FC7;&#x7A0B; set-port-output-buffer! &#x5C06; output-port &#x7684;&#x8F93;&#x51FA;&#x7F13;&#x51B2;&#x533A;&#x5B57;&#x6BB5;&#x8BBE;&#x7F6E;&#x4E3A; x&#xFF0C;&#x8BE5;&#x5B57;&#x6BB5;&#x5FC5;&#x987B;&#x662F;&#x6587;&#x672C;&#x7AEF;&#x53E3;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x548C;&#x4E8C;&#x8FDB;&#x5236;&#x7AEF;&#x53E3;&#x7684;&#x5B57;&#x8282;&#x5411;&#x91CF;&#x3002;&#x5B83;&#x8FD8;&#x5C06;&#x8F93;&#x51FA;&#x5927;&#x5C0F;&#x8BBE;&#x7F6E;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#x6216;&#x5B57;&#x8282;&#x5411;&#x91CF;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x5E76;&#x5C06;&#x8F93;&#x51FA;&#x7D22;&#x5F15;&#x8BBE;&#x7F6E;&#x4E3A; 0&#x3002;</p>
<p>&#x4E13;&#x7528;&#x4E8E;&#x6587;&#x672C;&#x6216;&#x4E8C;&#x8FDB;&#x5236;&#x7AEF;&#x53E3;&#x7684;&#x53D8;&#x4F53;&#x8981;&#x6BD4;&#x5B83;&#x4EEC;&#x5BF9;&#x5E94;&#x7684;&#x901A;&#x7528;&#x7248;&#x672C;&#x7565;&#x4E3A;&#x9AD8;&#x6548;&#x3002;</p>
<p>procedure: <code>(port-output-count output-port)</code>
procedure: <code>(textual-port-output-count textual-output-port)</code>
procedure: <code>(binary-port-output-count binary-output-port)</code>
returns: &#x53C2;&#x89C1;&#x4E0B;&#x6587;
libraries: (chezscheme)</p>
<p>&#x8FD9;&#x4E9B;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x7CBE;&#x786E;&#x7684;&#x6574;&#x6570;&#xFF0C;&#x8868;&#x793A;&#x53EF;&#x5728;&#x7AEF;&#x53E3;&#x8F93;&#x51FA;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x5199;&#x5165;&#x7684;&#x4EE5;&#x5B57;&#x7B26;&#x6216;&#x5B57;&#x8282;&#x8BA1;&#x7684;&#x7A7A;&#x95F4;&#x91CF;&#xFF0C;&#x5373;&#x7F13;&#x51B2;&#x533A;&#x5927;&#x5C0F;&#x548C;&#x7D22;&#x5F15;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x503C;&#x3002;</p>
<p>&#x4E13;&#x7528;&#x4E8E;&#x6587;&#x672C;&#x6216;&#x4E8C;&#x8FDB;&#x5236;&#x7AEF;&#x53E3;&#x7684;&#x53D8;&#x4F53;&#x8981;&#x6BD4;&#x5B83;&#x4EEC;&#x5BF9;&#x5E94;&#x7684;&#x901A;&#x7528;&#x7248;&#x672C;&#x7565;&#x4E3A;&#x9AD8;&#x6548;&#x3002;</p>
<p>procedure: <code>(port-output-full? output-port)</code>
&#x8FD4;&#x56DE;: &#x5982;&#x679C;&#x7AEF;&#x53E3;&#x7684;&#x8F93;&#x51FA;&#x7F13;&#x51B2;&#x533A;&#x6CA1;&#x6709;&#x66F4;&#x591A;&#x7A7A;&#x95F4;&#xFF0C;&#x5219;&#x4E3A; <code>#t</code>, &#x5426;&#x5219;&#x4E3A; <code>#f</code>.
libraries: (chezscheme)</p>
<p>&#x6B64;&#x8FC7;&#x7A0B;&#x786E;&#x5B9A;&#x7AEF;&#x53E3;&#x7684;&#x8F93;&#x51FA;&#x8BA1;&#x6570;&#x662F;&#x5426;&#x4E3A;&#x96F6;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x8BA1;&#x7B97;&#x6216;&#x8FD4;&#x56DE;&#x5B9E;&#x9645;&#x8BA1;&#x6570;&#x3002;</p>
<p>procedure: <code>(mark-port-closed! port)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>&#x6B64;&#x8FC7;&#x7A0B;&#x76F4;&#x63A5;&#x628A;&#x7AEF;&#x53E3;&#x6807;&#x8BB0;&#x4E3A;&#x5173;&#x95ED;&#xFF0C;&#x4ECE;&#x800C;&#x7981;&#x6B62;&#x66F4;&#x591A;&#x7684;&#x8F93;&#x5165;&#x6216;&#x8F93;&#x51FA;&#x64CD;&#x4F5C;&#x3002;&#x5B83;&#x901A;&#x5E38;&#x5728;&#x63A5;&#x6536;&#x5230; close-port &#x6D88;&#x606F;&#x65F6;&#x7531;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x3002;</p>
<p>procedure: <code>(port-closed? port)</code>
&#x8FD4;&#x56DE;: &#x5982;&#x679C; <code>port</code> &#x5DF2;&#x5173;&#x95ED;&#xFF0C;&#x5219;&#x4E3A; <code>#t</code>, &#x5426;&#x5219;&#x4E3A; <code>#f</code>.
libraries: (chezscheme)</p>
<pre><code>(let ([p (open-output-string)])
  (port-closed? p)) \Rightarrow #f

(let ([p (open-output-string)])
  (close-port p)
  (port-closed? p)) \Rightarrow #t
</code></pre><p>procedure: <code>(set-port-bol! output-port obj)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>&#x5F53; obj &#x4E3A;#f &#x65F6;&#xFF0C;&#x7AEF;&#x53E3;&#x7684;&#x884C;&#x9996;&#xFF08;BOL&#xFF09;&#x6807;&#x5FD7;&#x88AB;&#x6E05;&#x9664;; &#x5426;&#x5219;&#xFF0C;&#x8BBE;&#x7F6E;&#x7AEF;&#x53E3;&#x7684; BOL &#x6807;&#x5FD7;&#x3002;</p>
<p>BOL &#x6807;&#x5FD7;&#x7531; fresh-line&#xFF08;&#x7B2C; 240 &#x9875;&#xFF09;&#x67E5;&#x8BE2;&#xFF0C;&#x4EE5;&#x786E;&#x5B9A;&#x662F;&#x5426;&#x9700;&#x8981;&#x5F00;&#x542F;&#x4E00;&#x4E2A;&#x65B0;&#x884C;&#x3002;&#x5BF9;&#x4E8E;&#x6587;&#x4EF6;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x548C;&#x8F6C;&#x5F55;&#x7AEF;&#x53E3;&#xFF0C;&#x6B64;&#x6807;&#x5FD7;&#x662F;&#x81EA;&#x52A8;&#x7EF4;&#x62A4;&#x7684;&#x3002;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x6587;&#x4EF6;&#x548C;&#x5B57;&#x7B26;&#x4E32;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x4F1A;&#x8BBE;&#x7F6E;&#x6B64;&#x6807;&#x5FD7;&#xFF0C;&#x4F46;&#x4F7F;&#x7528; append &#x9009;&#x9879;&#x521B;&#x5EFA;&#x7684;&#x6587;&#x4EF6;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x9664;&#x5916;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BE5;&#x6807;&#x5FD7;&#x4F1A;&#x88AB;&#x91CD;&#x7F6E;&#x3002;&#x5BF9;&#x4E8E;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x901A;&#x7528;&#x7AEF;&#x53E3;&#xFF0C;&#x4F1A;&#x6E05;&#x9664; BOL &#x6807;&#x5FD7;&#xFF0C;&#x5E76;&#x4E14;&#x4ECE;&#x4E0D;&#x81EA;&#x52A8;&#x8BBE;&#x7F6E;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; set-port-bol!&#x663E;&#x5F0F;&#x8BBE;&#x7F6E;&#x3002;&#x5728;&#x67E5;&#x8BE2;&#x6807;&#x5FD7;&#x4E4B;&#x524D;&#xFF0C;&#x603B;&#x662F;&#x7ACB;&#x5373;&#x5237;&#x65B0;&#x7AEF;&#x53E3;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x9700;&#x8981;&#x9010;&#x5B57;&#x7B26;&#x5730;&#x7EF4;&#x62A4;&#x7F13;&#x51B2;&#x7AEF;&#x53E3;&#x3002;</p>
<p>procedure: <code>(port-bol? port)</code>
&#x8FD4;&#x56DE;: &#x5982;&#x679C; <code>port</code> &#x7684; BOL &#x6807;&#x5FD7;&#x5DF2;&#x8BBE;&#x7F6E;&#xFF0C;&#x5219;&#x4E3A; <code>#t</code>, &#x5426;&#x5219;&#x4E3A; <code>#f</code>.
libraries: (chezscheme)</p>
<p>procedure: <code>(set-port-eof! input-port obj)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>&#x5F53; obj &#x4E0D;&#x662F;#f &#x65F6;&#xFF0C;set-port-eof! &#x6807;&#x8BB0; input-port, &#x8FD9;&#x6837;&#xFF0C;&#x4E00;&#x65E6;&#x5176;&#x7F13;&#x51B2;&#x533A;&#x4E3A;&#x7A7A;&#xFF0C;&#x5373;&#x4F7F;&#x5E95;&#x5C42;&#x5B57;&#x8282;&#x6216;&#x5B57;&#x7B26;&#x6D41;&#x4E2D;&#x6709;&#x66F4;&#x591A;&#x6570;&#x636E;&#x53EF;&#x7528;&#xFF0C;&#x7AEF;&#x53E3;&#x4E5F;&#x4F1A;&#x88AB;&#x89C6;&#x4E3A;&#x5904;&#x4E8E; eof. &#x4E00;&#x65E6;&#x8FD9;&#x4E2A;&#x4EBA;&#x4E3A;&#x5236;&#x9020;&#x7684; eof &#x88AB;&#x8BFB;&#x53D6;&#xFF0C;&#x6B64; eof &#x6807;&#x8BB0;&#x5C31;&#x4F1A;&#x88AB;&#x6E05;&#x9664;&#xFF0C;&#x4F7F;&#x5F97;&#x6D41;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x5728; eof &#x4E4B;&#x540E;&#x53EF;&#x7528;&#x3002;&#x901A;&#x7528;&#x7AEF;&#x53E3;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6B64;&#x529F;&#x80FD;&#x6765;&#x6A21;&#x62DF;&#x7531;&#x591A;&#x4E2A;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x7EC4;&#x6210;&#x7684;&#x6D41;&#x3002;</p>
<p>When obj is #f, the eof mark is cleared.
&#x5F53; obj &#x4E3A; #f &#x65F6;&#xFF0C;&#x4F1A;&#x6E05;&#x9664; eof &#x6807;&#x8BB0;&#x3002;</p>
<p>The following example assumes /dev/zero provides an infinite stream of zero bytes.
&#x4EE5;&#x4E0B;&#x793A;&#x4F8B;&#x5047;&#x5B9A;/dev/zero &#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x65E0;&#x9650;&#x7684;&#x96F6;&#x5B57;&#x8282;&#x6D41;&#x3002;</p>
<pre><code>(define p
  (parameterize ([file-buffer-size 3])
    (open-file-input-port &quot;/dev/zero&quot;)))

(set-port-eof! p #t)
(get-u8 p) \Rightarrow #!eof
(get-u8 p) \Rightarrow 0
(set-port-eof! p #t)
(get-u8 p) \Rightarrow 0
(get-u8 p) \Rightarrow 0
(get-u8 p) \Rightarrow #!eof
(get-u8 p) \Rightarrow 0
</code></pre><p>procedure: <code>(port-name port)</code>
&#x8FD4;&#x56DE;&#xFF1A;&#x4E0E; port &#x5173;&#x8054;&#x7684;&#x540D;&#x79F0;
libraries: (chezscheme)</p>
<p>The name may be any object but is usually a string or #f (denoting no name). For file ports, the name is typically a string naming the file.
&#x540D;&#x79F0;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x6216;#f&#xFF08;&#x8868;&#x793A;&#x6CA1;&#x6709;&#x540D;&#x79F0;&#xFF09;&#x3002;&#x5BF9;&#x4E8E;&#x6587;&#x4EF6;&#x7AEF;&#x53E3;&#xFF0C;&#x540D;&#x79F0;&#x901A;&#x5E38;&#x662F;&#x547D;&#x540D;&#x6587;&#x4EF6;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<pre><code>(let ([p (open-input-file &quot;myfile.ss&quot;)])
  (port-name p)) \Rightarrow &quot;myfile.ss&quot;

(let ([p (open-output-string)])
  (port-name p)) \Rightarrow &quot;string&quot;
</code></pre><p>procedure: <code>(set-port-name! port obj)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>This procedure sets port&apos;s name to obj, which should be a string or #f (denoting no name).
&#x6B64;&#x8FC7;&#x7A0B;&#x5C06; port &#x7684;&#x540D;&#x79F0;&#x8BBE;&#x7F6E;&#x4E3A; obj&#xFF0C;&#x5B83;&#x5E94;&#x8BE5;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x6216;#f&#xFF08;&#x8868;&#x793A;&#x6CA1;&#x6709;&#x540D;&#x79F0;&#xFF09;&#x3002;</p>
<p>procedure: <code>(port-length port)</code>
procedure: <code>(file-length port)</code>
&#x8FD4;&#x56DE;&#xFF1A;port &#x5F15;&#x7528;&#x7684;&#x6587;&#x4EF6;&#x6216;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x7684;&#x957F;&#x5EA6;
procedure: <code>(port-has-port-length? port)</code>
&#x8FD4;&#x56DE;: &#x5982;&#x679C; <code>port</code> &#x652F;&#x6301; port-length&#xFF0C;&#x5219;&#x4E3A; <code>#t</code>, &#x5426;&#x5219;&#x4E3A; <code>#f</code>.
libraries: (chezscheme)</p>
<p>&#x7AEF;&#x53E3;&#x53EF;&#x80FD;&#x5141;&#x8BB8;&#x5224;&#x5B9A;&#x5E95;&#x5C42;&#x5B57;&#x7B26;&#x6216;&#x5B57;&#x8282;&#x6D41;&#x7684;&#x957F;&#x5EA6;&#x3002;&#x82E5;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x8FC7;&#x7A0B; port-has-port-length? &#x8FD4;&#x56DE;#t&#xFF0C;port-length &#x8FD4;&#x56DE;&#x5F53;&#x524D;&#x957F;&#x5EA6;&#x3002;&#x5BF9;&#x4E8E;&#x4E8C;&#x8FDB;&#x5236;&#x7AEF;&#x53E3;&#xFF0C;&#x957F;&#x5EA6;&#x59CB;&#x7EC8;&#x662F;&#x7CBE;&#x786E;&#x7684;&#x975E;&#x8D1F;&#x6574;&#x578B;&#x5B57;&#x8282;&#x6570;&#x3002;&#x5BF9;&#x4E8E;&#x6587;&#x672C;&#x7AEF;&#x53E3;&#xFF0C;&#x957F;&#x5EA6;&#x7684;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#x662F;&#x672A;&#x6307;&#x5B9A;&#x7684;; &#x5B83;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x7CBE;&#x786E;&#x7684;&#x975E;&#x8D1F;&#x6574;&#x6570;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x662F;&#xFF0C;&#x5B83;&#x4E5F;&#x53EF;&#x80FD;&#x4E0D;&#x4EE3;&#x8868;&#x5B57;&#x8282;&#x6216;&#x5B57;&#x7B26;&#x6570;&#x3002;&#x5982;&#x679C;&#x7AEF;&#x53E3;&#x652F;&#x6301; set-port-length!&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5728;&#x7A0D;&#x540E;&#x7684;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x4F7F;&#x7528;&#x8BE5;&#x957F;&#x5EA6;&#x6765;&#x91CD;&#x7F6E;&#x957F;&#x5EA6;&#x3002;&#x5982;&#x679C;&#x5728;&#x4E0D;&#x652F;&#x6301; port-length &#x7684;&#x7AEF;&#x53E3;&#x4E0A;&#x8C03;&#x7528; port-length&#xFF0C;&#x5219;&#x4F1A;&#x629B;&#x51FA;&#x4E00;&#x4E2A;&#x6761;&#x4EF6;&#x7C7B;&#x578B;&#x7684; &amp;assertion &#x5F02;&#x5E38;&#x3002;</p>
<p>&#x5BF9;&#x4E8E; 32 &#x4F4D;&#x7248;&#x672C;&#x7684;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x538B;&#x7F29;&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x62A5;&#x544A;&#x8D85;&#x8FC7; 2<sup>32</sup> &#x7684;&#x6587;&#x4EF6;&#x957F;&#x5EA6;&#x3002;</p>
<p>file-length &#x4E0E; port-length &#x76F8;&#x540C;&#x3002;</p>
<p>procedure: <code>(set-port-length! port len)</code>
returns: unspecified
procedure: <code>(port-has-set-port-length!? port)</code>
&#x8FD4;&#x56DE;: &#x5982;&#x679C; <code>port</code> &#x652F;&#x6301; set-port-length!&#xFF0C;&#x5219;&#x4E3A; <code>#t</code>, &#x5426;&#x5219;&#x4E3A; <code>#f</code>.
libraries: (chezscheme)</p>
<p>&#x7AEF;&#x53E3;&#x53EF;&#x80FD;&#x5141;&#x8BB8;&#x8BBE;&#x7F6E;&#x5E95;&#x5C42;&#x5B57;&#x7B26;&#x6216;&#x5B57;&#x8282;&#x6D41;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x5373;&#xFF0C;&#x6269;&#x5C55;&#x6216;&#x7F29;&#x77ED;&#x3002;&#x82E5;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x8FC7;&#x7A0B; port-has-set-port-length!? &#x8FD4;&#x56DE; #t, &#x800C; set-port-length! &#x6539;&#x53D8;&#x957F;&#x5EA6;&#x3002;&#x5BF9;&#x4E8E;&#x4E8C;&#x8FDB;&#x5236;&#x7AEF;&#x53E3;&#xFF0C;&#x957F;&#x5EA6; len &#x5FC5;&#x987B;&#x662F;&#x7CBE;&#x786E;&#x7684;&#x975E;&#x8D1F;&#x6574;&#x578B;&#x5B57;&#x8282;&#x6570;&#x3002;&#x5BF9;&#x4E8E;&#x6587;&#x672C;&#x7AEF;&#x53E3;&#xFF0C;&#x957F;&#x5EA6;&#x7684;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#x662F;&#x672A;&#x6307;&#x5B9A;&#x7684;&#xFF0C;&#x5982;&#x4E0A;&#x9762;&#x7684; port-length &#x6761;&#x76EE;&#x6240;&#x8FF0;&#xFF0C;&#x4F46; len &#x5FC5;&#x987B;&#x662F;&#x9002;&#x7528;&#x4E8E;&#x6587;&#x672C;&#x7AEF;&#x53E3;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x901A;&#x5E38;&#x53EA;&#x6709;&#x5728;&#x5B83;&#x662F;&#x901A;&#x8FC7;&#x5728;&#x540C;&#x4E00;&#x7AEF;&#x53E3;&#x4E0A;&#x8C03;&#x7528; port-length &#x800C;&#x83B7;&#x5F97;&#x65F6;&#xFF0C;&#x624D;&#x80FD;&#x786E;&#x4FDD;&#x5982;&#x6B64;&#x3002;&#x5982;&#x679C; set-port-length! &#x5728;&#x4E0D;&#x652F;&#x6301;&#x5B83;&#x7684;&#x7AEF;&#x53E3;&#x4E0A;&#x8C03;&#x7528;&#xFF0C;&#x5219;&#x4F1A;&#x629B;&#x51FA;&#x4E00;&#x4E2A;&#x6761;&#x4EF6;&#x7C7B;&#x578B;&#x7684; &amp;assertion &#x5F02;&#x5E38;&#x3002;</p>
<p>&#x65E0;&#x6CD5;&#x5C06;&#x4EE5;&#x538B;&#x7F29;&#x6A21;&#x5F0F;&#x6253;&#x5F00;&#x7684;&#x7AEF;&#x53E3;&#x957F;&#x5EA6;&#x8BBE;&#x7F6E;&#x5230;&#x4EFB;&#x610F;&#x4F4D;&#x7F6E;&#xFF0C;&#x5E76;&#x4E14;&#x5C1D;&#x8BD5;&#x5728; 32 &#x4F4D;&#x7248;&#x672C;&#x7684;&#x7CFB;&#x7EDF;&#x4E0A;&#x5C06;&#x538B;&#x7F29;&#x6587;&#x4EF6;&#x7684;&#x957F;&#x5EA6;&#x8BBE;&#x7F6E;&#x4E3A;&#x8D85;&#x8FC7; 2<sup>32</sup> &#x7684;&#x7ED3;&#x679C;&#x662F;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#x3002;</p>
<p>procedure: <code>(port-nonblocking? port)</code>
&#x8FD4;&#x56DE;&#xFF1A;&#x5982;&#x679C;&#x7AEF;&#x53E3;&#x5904;&#x4E8E;&#x975E;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#xFF0C;&#x5219;&#x4E3A; #t&#xFF0C;&#x5426;&#x5219;&#x4E3A; #f
procedure: <code>(port-has-port-nonblocking?? port)</code>
&#x8FD4;&#x56DE;: &#x5982;&#x679C;&#x7AEF;&#x53E3;&#x652F;&#x6301; port-nonblocking?, &#x5219;&#x4E3A; <code>#t</code>, &#x5426;&#x5219;&#x4E3A; <code>#f</code>.
libraries: (chezscheme)</p>
<p>&#x7AEF;&#x53E3;&#x53EF;&#x80FD;&#x5141;&#x8BB8;&#x5224;&#x5B9A;&#x7AEF;&#x53E3;&#x7684;&#x975E;&#x963B;&#x585E;&#x72B6;&#x6001;&#x3002;&#x82E5;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x8FC7;&#x7A0B; port-has-port-nonblocking?? &#x8FD4;&#x56DE;#t, &#x800C; port-nonblocking? &#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5E03;&#x5C14;&#x503C;&#xFF0C;&#x53CD;&#x6620;&#x7AEF;&#x53E3;&#x662F;&#x5426;&#x5904;&#x4E8E;&#x975E;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#x3002;</p>
<p>procedure: <code>(set-port-nonblocking! port obj)</code>
returns: unspecified
procedure: <code>(port-has-set-port-nonblocking!? port)</code>
&#x8FD4;&#x56DE;: &#x5982;&#x679C;&#x7AEF;&#x53E3;&#x652F;&#x6301; set-port-nonblocking!, &#x5219;&#x4E3A; <code>#t</code>, &#x5426;&#x5219;&#x4E3A; <code>#f</code>.
libraries: (chezscheme)</p>
<p>&#x7AEF;&#x53E3;&#x53EF;&#x80FD;&#x5141;&#x8BB8;&#x4EE5;&#x201C;&#x975E;&#x963B;&#x585E;&#x201D;&#x65B9;&#x5F0F;&#x6267;&#x884C;&#x8BFB;&#x53D6;&#x6216;&#x5199;&#x5165;&#x3002;&#x82E5;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x8FC7;&#x7A0B; port-has-set-port-nonblocking!? &#x8FD4;&#x56DE;#t, &#x800C; set-port-nonblocking! &#x5C06;&#x7AEF;&#x53E3;&#x8BBE;&#x7F6E;&#x4E3A;&#x975E;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#xFF08;&#x5982;&#x679C; obj &#x662F;&#x771F;&#x503C;&#xFF09;&#x6216;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#xFF08;&#x5982;&#x679C; obj &#x662F;#f&#xFF09;&#x3002;&#x5982;&#x679C; set-port-nonblocking! &#x5728;&#x4E0D;&#x652F;&#x6301;&#x5B83;&#x7684;&#x7AEF;&#x53E3;&#x4E0A;&#x8C03;&#x7528;&#xFF0C;&#x5219;&#x4F1A;&#x629B;&#x51FA;&#x4E00;&#x4E2A;&#x6761;&#x4EF6;&#x7C7B;&#x578B;&#x7684; &amp;assertion &#x5F02;&#x5E38;&#x3002;</p>
<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x901A;&#x8FC7;&#x6807;&#x51C6;&#x7684; R<sup>6</sup>RS &#x7AEF;&#x53E3;&#x6253;&#x5F00;&#x8FC7;&#x7A0B;&#x521B;&#x5EFA;&#x7684;&#x7AEF;&#x53E3;&#xFF0C;&#x521D;&#x59CB;&#x8BBE;&#x7F6E;&#x4E3A;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#x3002;&#x5BF9;&#x4E8E;&#x672C;&#x6587;&#x6863;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x5927;&#x591A;&#x6570;&#x8FC7;&#x7A0B;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x57FA;&#x4E8E;&#x975E;&#x963B;&#x585E;&#x6E90;&#x7684;&#x901A;&#x7528;&#x7AEF;&#x53E3;&#x53EF;&#x80FD;&#x521D;&#x59CB;&#x4E3A;&#x975E;&#x963B;&#x585E;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F20;&#x5165;&#x7684;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x5904;&#x4E8E;&#x975E;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#xFF0C;&#x5219; open-fd-input-port&#xFF0C;open-fd-output-port &#x6216; open-fd-input/output-port &#x8FD4;&#x56DE;&#x7684;&#x7AEF;&#x53E3;&#x6700;&#x521D;&#x5904;&#x4E8E;&#x975E;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#x3002;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x5982;&#x679C;&#x5E95;&#x5C42; stdin&#xFF0C;stdout &#x6216; stderr &#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x5904;&#x4E8E;&#x975E;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#xFF0C;&#x5219; standard-input-port, standard-output-port, &#x6216; standard-error-port &#x8FD4;&#x56DE;&#x7684;&#x7AEF;&#x53E3;&#x6700;&#x521D;&#x5904;&#x4E8E;&#x975E;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x867D;&#x7136; get-bytevector-some &#x548C; get-string-some &#x901A;&#x5E38;&#x4E0D;&#x80FD;&#x8FD4;&#x56DE;&#x7A7A;&#x5B57;&#x8282;&#x5411;&#x91CF;&#x6216;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x7AEF;&#x53E3;&#x5904;&#x4E8E;&#x975E;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x53EF;&#x7528;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x5219;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x3002;&#x53E6;&#x5916;&#xFF0C;get-bytevector-some! &#x548C; get-string-some! &#x5728;&#x7AEF;&#x53E3;&#x5904;&#x4E8E;&#x975E;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#x4E14;&#x6CA1;&#x6709;&#x53EF;&#x7528;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x8BFB;&#x53D6;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x3002;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x5982;&#x679C;&#x7AEF;&#x53E3;&#x5904;&#x4E8E;&#x975E;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#x4E14;&#x6CA1;&#x6709;&#x53EF;&#x7528;&#x7A7A;&#x95F4;&#xFF0C;&#x5219; put-bytevector-some &#x548C; put-string-some &#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x5199;&#x5165;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x3002;</p>
<p>Windows &#x4E0D;&#x652F;&#x6301;&#x975E;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#x3002;</p>
<p>procedure: <code>(file-position port)</code>
procedure: <code>(file-position port pos)</code>
returns: &#x53C2;&#x89C1;&#x4E0B;&#x6587;
libraries: (chezscheme)</p>
<p>&#x5F53;&#x7701;&#x7565;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x65F6;&#xFF0C;&#x6B64;&#x8FC7;&#x7A0B;&#x7684;&#x884C;&#x4E3A;&#x7C7B;&#x4F3C;&#x4E8E; R<sup>6</sup>RS &#x7684; port-position &#x8FC7;&#x7A0B;&#xFF0C;&#x800C;&#x5F53;&#x6B64;&#x53C2;&#x6570;&#x5B58;&#x5728;&#x65F6;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E; R<sup>6</sup>RS &#x7684; set-port-position! &#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4F7F;&#x7528;&#x538B;&#x7F29;&#x6807;&#x5FD7;&#x6253;&#x5F00;&#x7684;&#x538B;&#x7F29;&#x6587;&#x4EF6;&#xFF0C;file-position &#x8FD4;&#x56DE;&#x672A;&#x538B;&#x7F29;&#x6570;&#x636E;&#x6D41;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x66F4;&#x6539;&#x4F7F;&#x7528;&#x538B;&#x7F29;&#x6807;&#x5FD7;&#x6253;&#x5F00;&#x7684;&#x538B;&#x7F29;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x7684;&#x4F4D;&#x7F6E;&#x901A;&#x5E38;&#x9700;&#x8981;&#x56DE;&#x9000;&#x548C;&#x91CD;&#x8BFB;&#x6587;&#x4EF6;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x80FD;&#x5F88;&#x6162;&#x3002;&#x4F7F;&#x7528;&#x538B;&#x7F29;&#x6807;&#x5FD7;&#x6253;&#x5F00;&#x7684;&#x538B;&#x7F29;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#x7684;&#x4F4D;&#x7F6E;&#x53EA;&#x80FD;&#x5411;&#x524D;&#x79FB;&#x52A8;; &#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x5199;&#x5165;&#x4E00;&#x4E2A;&#xFF08;&#x538B;&#x7F29;&#x7684;&#xFF09;&#x96F6;&#x5E8F;&#x5217;&#x6765;&#x5B8C;&#x6210;&#x7684;&#x3002; &#x5BF9;&#x4E8E; 32 &#x4F4D;&#x7248;&#x672C;&#x7684;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x538B;&#x7F29;&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x62A5;&#x544A;&#x8D85;&#x8FC7; 2<sup>32</sup> &#x7684;&#x6587;&#x4EF6;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>procedure: <code>(clear-input-port)</code>
procedure: <code>(clear-input-port input-port)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>&#x5982;&#x679C;&#x672A;&#x63D0;&#x4F9B; input-port&#xFF0C;&#x5219;&#x9ED8;&#x8BA4;&#x4E3A;&#x5F53;&#x524D;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x3002;&#x6B64;&#x8FC7;&#x7A0B;&#x4F1A;&#x6E05;&#x9664;&#x4E0E; input-port &#x5173;&#x8054;&#x7684;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x4E3A;&#x4E86;&#x51C6;&#x5907;&#x7D27;&#x6025;&#x67E5;&#x8BE2;&#xFF0C;&#x6E05;&#x9664;&#x6765;&#x81EA;&#x952E;&#x76D8;&#x7684;&#x6240;&#x6709;&#x5148;&#x524D;&#x8F93;&#x5165;&#x3002;</p>
<p>procedure: <code>(clear-output-port)</code>
procedure: <code>(clear-output-port output-port)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>&#x5982;&#x679C;&#x672A;&#x63D0;&#x4F9B; output-port&#xFF0C;&#x5219;&#x9ED8;&#x8BA4;&#x4E3A;&#x5F53;&#x524D;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;&#x6B64;&#x8FC7;&#x7A0B;&#x4F1A;&#x6E05;&#x9664;&#x4E0E; output-port &#x5173;&#x8054;&#x7684;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x4E3A;&#x4E86;&#x51C6;&#x5907;&#x7D27;&#x6025;&#x6D88;&#x606F;&#xFF0C;&#x6E05;&#x9664;&#x4EA4;&#x4E92;&#x7AEF;&#x53E3;&#x4E0A;&#x7684;&#x4EFB;&#x4F55;&#x5F85;&#x5904;&#x7406;&#x8F93;&#x51FA;&#x3002;</p>
<p>procedure: <code>(flush-output-port)</code>
procedure: <code>(flush-output-port output-port)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>&#x5982;&#x679C;&#x672A;&#x63D0;&#x4F9B; output-port&#xFF0C;&#x5219;&#x9ED8;&#x8BA4;&#x4E3A;&#x5F53;&#x524D;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;&#x6B64;&#x8FC7;&#x7A0B;&#x4F1A;&#x5F3A;&#x5236;&#x7ACB;&#x5373;&#x6253;&#x5370;&#x4E0E; output-port &#x5173;&#x8054;&#x7684;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x3002;&#x63A7;&#x5236;&#x53F0;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x5728;&#x6362;&#x884C;&#x7B26;&#x4E4B;&#x540E;&#x53CA;&#x4ECE;&#x63A7;&#x5236;&#x53F0;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x83B7;&#x5F97;&#x8F93;&#x5165;&#x4E4B;&#x524D;&#x81EA;&#x52A8;&#x5237;&#x65B0;; &#x6240;&#x6709;&#x7AEF;&#x53E3;&#x5728;&#x5173;&#x95ED;&#x65F6;&#x81EA;&#x52A8;&#x5237;&#x65B0;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;flush-output-port &#x53EF;&#x80FD;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x4EE5;&#x5F3A;&#x5236;&#x5C06;&#x6CA1;&#x6709;&#x6362;&#x884C;&#x7B26;&#x7684;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x5230;&#x63A7;&#x5236;&#x53F0;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x6216;&#x5F3A;&#x5236;&#x8F93;&#x51FA;&#x65E0;&#x5EF6;&#x8FDF;&#x5730;&#x51FA;&#x73B0;&#x5728;&#x6587;&#x4EF6;&#x4E2D;&#x3002;</p>
<p>procedure: <code>(port-file-compressed! port)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>port &#x5FC5;&#x987B;&#x662F;&#x8F93;&#x5165;&#x6216;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;&#x5B83;&#x5FC5;&#x987B;&#x662F;&#x6307;&#x5411;&#x5E38;&#x89C4;&#x6587;&#x4EF6;&#x7684;&#x6587;&#x4EF6;&#x7AEF;&#x53E3;&#xFF0C;&#x5373;&#xFF0C;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x6587;&#x4EF6;&#x800C;&#x4E0D;&#x662F;&#x4F8B;&#x5982;&#x5957;&#x63A5;&#x5B57;&#x7B49;&#x3002;&#x7AEF;&#x53E3;&#x53EF;&#x4EE5;&#x662F;&#x4E8C;&#x8FDB;&#x5236;&#x6216;&#x6587;&#x672C;&#x7AEF;&#x53E3;&#x3002;&#x5982;&#x679C;&#x7AEF;&#x53E3;&#x662F;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF0C;&#x5219;&#x53D1;&#x9001;&#x5230;&#x7AEF;&#x53E3;&#x7684;&#x540E;&#x7EED;&#x8F93;&#x51FA;&#x4F1A;&#x88AB;&#x538B;&#x7F29;&#x3002;&#x5982;&#x679C;&#x7AEF;&#x53E3;&#x662F;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#xFF0C;&#x5F53;&#x4E14;&#x4EC5;&#x5F53;&#x7AEF;&#x53E3;&#x5F53;&#x524D;&#x6307;&#x5411;&#x538B;&#x7F29;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x540E;&#x7EED;&#x8F93;&#x5165;&#x624D;&#x4F1A;&#x88AB;&#x89E3;&#x538B;&#x7F29;&#x3002;&#x5982;&#x679C;&#x7AEF;&#x53E3;&#x5DF2;&#x8BBE;&#x7F6E;&#x4E3A;&#x538B;&#x7F29;&#xFF0C;&#x5219;&#x6B64;&#x8FC7;&#x7A0B;&#x65E0;&#x6548;&#x3002;</p>
<h2 id="95-&#x5B57;&#x7B26;&#x4E32;&#x7AEF;&#x53E3;">9.5. &#x5B57;&#x7B26;&#x4E32;&#x7AEF;&#x53E3;</h2>
<p>&#x5B57;&#x7B26;&#x4E32;&#x7AEF;&#x53E3;&#x5141;&#x8BB8;&#x901A;&#x8FC7;&#x7AEF;&#x53E3;&#x64CD;&#x4F5C;&#x521B;&#x5EFA;&#x548C;&#x64CD;&#x4F5C;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x8FC7;&#x7A0B; open-input-string &#x5C06;&#x5B57;&#x7B26;&#x4E32;&#x8F6C;&#x6362;&#x4E3A;&#x6587;&#x672C;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#xFF0C;&#x5141;&#x8BB8;&#x901A;&#x8FC7; read-char &#x6216; read &#x7B49;&#x8F93;&#x5165;&#x64CD;&#x4F5C;&#x6309;&#x987A;&#x5E8F;&#x8BFB;&#x53D6;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x7684;&#x5B57;&#x7B26;&#x3002;&#x8FC7;&#x7A0B; open-output-string &#x5141;&#x8BB8;&#x4F7F;&#x7528; write-char &#x548C; write &#x7B49;&#x8F93;&#x51FA;&#x64CD;&#x4F5C;&#x6784;&#x5EFA;&#x65B0;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<p>&#x867D;&#x7136;&#x5B57;&#x7B26;&#x4E32;&#x7AEF;&#x53E3;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E3A;&#x901A;&#x7528;&#x7AEF;&#x53E3;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x88AB;&#x5B9E;&#x73B0;&#x652F;&#x6301;&#x4E3A;&#x539F;&#x751F;&#x7AEF;&#x53E3;&#x3002;</p>
<p>procedure: <code>(open-input-string string)</code>
returns: &#x65B0;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x8F93;&#x5165;&#x7AEF;&#x53E3;
libraries: (chezscheme)</p>
<p>&#x5B57;&#x7B26;&#x4E32;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x7C7B;&#x4F3C;&#x4E8E;&#x6587;&#x4EF6;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#xFF0C;&#x4F46;&#x4ECE;&#x7AEF;&#x53E3;&#x63D0;&#x53D6;&#x7684;&#x5B57;&#x7B26;&#x548C;&#x5BF9;&#x8C61;&#x6765;&#x81EA;&#x4E8E;&#x5B57;&#x7B26;&#x4E32;&#x800C;&#x4E0D;&#x662F;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x5F53;&#x7AEF;&#x53E3;&#x5230;&#x8FBE;&#x5B57;&#x7B26;&#x4E32;&#x672B;&#x5C3E;&#x65F6;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x7AEF;&#x53E3;&#x4F4D;&#x4E8E;&#x201C;&#x6587;&#x4EF6;&#x672B;&#x5C3E;&#x201D;&#x3002;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x5173;&#x95ED;&#x5B57;&#x7B26;&#x4E32;&#x7AEF;&#x53E3;&#xFF0C;&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x505A;&#x3002;</p>
<pre><code>(let ([p (open-input-string &quot;hi mom!&quot;)])
  (let ([x (read p)])
    (list x (read p)))) \Rightarrow (hi mom!)
</code></pre><p>procedure: <code>(with-input-from-string string thunk)</code>
returns: thunk &#x7684;&#x8FD4;&#x56DE;&#x503C;
libraries: (chezscheme)</p>
<p>thunk &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x63A5;&#x53D7;&#x96F6;&#x4E2A;&#x53C2;&#x6570;&#x3002;with-input-from-string &#x5C06;&#x5F53;&#x524D;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x53C2;&#x6570;&#x5316;&#x4E3A;&#x5728;&#x5E94;&#x7528; thunk &#x671F;&#x95F4;&#x6253;&#x5F00;&#x8F93;&#x5165;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<pre><code>(with-input-from-string &quot;(cons 3 4)&quot;
  (lambda ()
    (eval (read)))) \Rightarrow (3 . 4)
</code></pre><p>procedure: <code>(open-output-string)</code>
returns: &#x65B0;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;
libraries: (chezscheme)</p>
<p>&#x5B57;&#x7B26;&#x4E32;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x7C7B;&#x4F3C;&#x4E8E;&#x6587;&#x4EF6;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF0C;&#x9664;&#x4E86;&#x5199;&#x5165;&#x7AEF;&#x53E3;&#x7684;&#x5B57;&#x7B26;&#x548C;&#x5BF9;&#x8C61;&#x653E;&#x7F6E;&#x5728;&#x5B57;&#x7B26;&#x4E32;&#xFF08;&#x6839;&#x636E;&#x9700;&#x8981;&#x589E;&#x957F;&#xFF09;&#x800C;&#x4E0D;&#x662F;&#x6587;&#x4EF6;&#x4E2D;&#x3002;&#x901A;&#x8FC7;&#x5199;&#x5165;&#x5B57;&#x7B26;&#x4E32;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x6784;&#x5EFA;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; get-output-string &#x83B7;&#x5F97;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x4E0B;&#x9762;&#x7ED9;&#x51FA;&#x7684; get-output-string &#x793A;&#x4F8B;&#x3002;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x5173;&#x95ED;&#x5B57;&#x7B26;&#x4E32;&#x7AEF;&#x53E3;&#xFF0C;&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x505A;&#x3002;</p>
<p>procedure: <code>(get-output-string string-output-port)</code>
&#x8FD4;&#x56DE;&#xFF1A;&#x4E0E; string-output-port &#x5173;&#x8054;&#x7684;&#x5B57;&#x7B26;&#x4E32;
libraries: (chezscheme)</p>
<p>string-output-port &#x5FC5;&#x987B;&#x662F; open-output-string &#x8FD4;&#x56DE;&#x7684;&#x7AEF;&#x53E3;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x526F;&#x4F5C;&#x7528;&#xFF0C;get-output-string &#x91CD;&#x7F6E; string-output-port&#xFF0C;&#x56E0;&#x6B64;&#x5230; string-output-port &#x7684;&#x540E;&#x7EED;&#x8F93;&#x51FA;&#x88AB;&#x653E;&#x5165;&#x4E00;&#x4E2A;&#x65B0;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<pre><code>(let ([p (open-output-string)])
  (write &apos;hi p)
  (write-char #\space p)
  (write &apos;mom! p)
  (get-output-string p)) \Rightarrow &quot;hi mom!&quot;
</code></pre><p>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B57;&#x7B26;&#x4E32;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x7F16;&#x5199; format&#xFF08;&#x7B2C; 9.13 &#x8282;&#xFF09;&#x7684;&#x5B9E;&#x73B0;&#x6765;&#x751F;&#x6210;&#x5B57;&#x7B26;&#x4E32;&#x8F93;&#x51FA;&#x3002;</p>
<p>procedure: <code>(with-output-to-string thunk)</code>
&#x8FD4;&#x56DE;&#xFF1A;&#x5305;&#x542B;&#x8F93;&#x51FA;&#x7684;&#x5B57;&#x7B26;&#x4E32;
libraries: (chezscheme)</p>
<p>thunk &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x63A5;&#x53D7;&#x96F6;&#x4E2A;&#x53C2;&#x6570;&#x3002;with-output-to-string &#x5728;&#x5E94;&#x7528; thunk &#x671F;&#x95F4;&#x5C06;&#x5F53;&#x524D;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x53C2;&#x6570;&#x5316;&#x4E3A;&#x65B0;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;&#x5982;&#x679C; thunk &#x8FD4;&#x56DE;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;&#x4E0E;&#x65B0;&#x5B57;&#x7B26;&#x4E32;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x5173;&#x8054;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x4E0E; get-output-string &#x4E00;&#x6837;&#x3002;</p>
<pre><code>(with-output-to-string
  (lambda ()
    (display &quot;Once upon a time ...&quot;)
    (newline))) \Rightarrow &quot;Once upon a time ...\n&quot;
</code></pre><h2 id="96-&#x6587;&#x4EF6;&#x7AEF;&#x53E3;">9.6. &#x6587;&#x4EF6;&#x7AEF;&#x53E3;</h2>
<p>thread parameter: <code>file-buffer-size</code>
libraries: (chezscheme)</p>
<p>file-buffer-size &#x662F;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#xFF0C;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x901A;&#x8FC7;&#x6587;&#x4EF6;&#x6253;&#x5F00;&#x64CD;&#x4F5C;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;open-input-file &#x6216; open-file-output-port&#xFF09;&#x521B;&#x5EFA;&#x7684;&#x7AEF;&#x53E3;&#x7684;&#x7F13;&#x51B2;&#x533A;&#x6A21;&#x5F0F;&#x4E0D;&#x662F; none &#x65F6;&#xFF0C;&#x521B;&#x5EFA;&#x7684;&#x6BCF;&#x4E2A;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x5728;&#x4E0D;&#x5E26;&#x53C2;&#x6570;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x8BE5;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x8FD4;&#x56DE;&#x5F53;&#x524D;&#x7F13;&#x51B2;&#x533A;&#x5927;&#x5C0F;&#x3002;&#x5F53;&#x4F7F;&#x7528;&#x6B63;&#x7684; fixnum k &#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x5F53;&#x524D;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x5927;&#x5C0F;&#x8BBE;&#x7F6E;&#x4E3A; k&#x3002;</p>
<p>procedure: <code>(file-port? port)</code>
returns: #t if port is a file port, #f otherwise
&#x8FD4;&#x56DE;: &#x5982;&#x679C; <code>port</code> &#x662F;&#x6587;&#x4EF6;&#x7AEF;&#x53E3;&#xFF0C;&#x5219;&#x4E3A; <code>#t</code>, &#x5426;&#x5219;&#x4E3A; <code>#f</code>.
libraries: (chezscheme)</p>
<p>&#x6587;&#x4EF6;&#x7AEF;&#x53E3;&#x662F;&#x76F4;&#x63A5;&#x57FA;&#x4E8E; O/S &#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x7684;&#x4EFB;&#x4F55;&#x7AEF;&#x53E3;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x7531; open-file-input-port&#xFF0C;open-output-port&#xFF0C;open-fd-input-port &#x7B49;&#x521B;&#x5EFA;&#x7684;&#x7AEF;&#x53E3;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5B57;&#x8282;&#x5411;&#x91CF;&#xFF0C;&#x6216;&#x81EA;&#x5B9A;&#x4E49;&#x7AEF;&#x53E3;&#x3002;</p>
<p>procedure: <code>(port-file-descriptor port)</code>
&#x8FD4;&#x56DE;&#xFF1A;&#x4E0E; port &#x5173;&#x8054;&#x7684;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;
libraries: (chezscheme)</p>
<p>port &#x5FC5;&#x987B;&#x662F;&#x6587;&#x4EF6;&#x7AEF;&#x53E3;&#xFF0C;&#x5373;&#xFF0C;file-port? &#x8FD4;&#x56DE; #t &#x7684;&#x7AEF;&#x53E3;&#x3002;</p>
<h2 id="97-&#x81EA;&#x5B9A;&#x4E49;&#x7AEF;&#x53E3;">9.7. &#x81EA;&#x5B9A;&#x4E49;&#x7AEF;&#x53E3;</h2>
<p>thread parameter: <code>custom-port-buffer-size</code>
libraries: (chezscheme)</p>
<p>custom-port-buffer-size &#x662F;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#xFF0C;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x4E0E;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x7AEF;&#x53E3;&#x5173;&#x8054;&#x7684;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x4E0D;&#x5E26;&#x53C2;&#x6570;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x8BE5;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x8FD4;&#x56DE;&#x5F53;&#x524D;&#x7F13;&#x51B2;&#x533A;&#x5927;&#x5C0F;&#x3002; &#x5F53;&#x4F7F;&#x7528;&#x6B63;&#x7684; fixnum k &#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x5F53;&#x524D;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x5927;&#x5C0F;&#x8BBE;&#x7F6E;&#x4E3A; k&#x3002;</p>
<h2 id="98-&#x8F93;&#x5165;&#x64CD;&#x4F5C;">9.8. &#x8F93;&#x5165;&#x64CD;&#x4F5C;</h2>
<p>global parameter: <code>console-input-port</code>
libraries: (chezscheme)</p>
<p>console-input-port &#x662F;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#xFF0C;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x670D;&#x52A1;&#x5668;&#x548C;&#x4EA4;&#x4E92;&#x5F0F;&#x8C03;&#x8BD5;&#x5668;&#x4F7F;&#x7528;&#x7684;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x3002;&#x5F53;&#x4E0D;&#x5E26;&#x53C2;&#x6570;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x5B83;&#x8FD4;&#x56DE;&#x63A7;&#x5236;&#x53F0;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x3002; &#x5F53;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF08;&#x5FC5;&#x987B;&#x662F;&#x6587;&#x672C;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#xFF09;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x66F4;&#x6539;&#x63A7;&#x5236;&#x53F0;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x7684;&#x503C;&#x3002;&#x6B64;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x7684;&#x521D;&#x59CB;&#x503C;&#x662F;&#x7ED1;&#x5B9A;&#x5230; Scheme &#x8FDB;&#x7A0B;&#x7684;&#x6807;&#x51C6;&#x8F93;&#x5165;&#xFF08;stdin&#xFF09;&#x6D41;&#x7684;&#x7AEF;&#x53E3;&#x3002;</p>
<p>thread parameter: <code>current-input-port</code>
libraries: (chezscheme)</p>
<p>current-input-port &#x662F;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#xFF0C;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x5927;&#x591A;&#x6570;&#x8F93;&#x5165;&#x8FC7;&#x7A0B;&#x7684;&#x9ED8;&#x8BA4;&#x7AEF;&#x53E3;&#x53C2;&#x6570;&#xFF0C;&#x5305;&#x62EC; read-char&#xFF0C;peek-char &#x548C; read&#x3002;&#x5F53;&#x4E0D;&#x5E26;&#x53C2;&#x6570;&#x8C03;&#x7528;&#x65F6;&#xFF0C;current-input-port &#x8FD4;&#x56DE;&#x5F53;&#x524D;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x3002;&#x5F53;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF08;&#x5FC5;&#x987B;&#x662F;&#x6587;&#x672C;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#xFF09;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x66F4;&#x6539;&#x5F53;&#x524D;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x7684;&#x503C;&#x3002;Current-input-port &#x7684; R<sup>6</sup>RS &#x7248;&#x672C;&#x53EA;&#x63A5;&#x53D7;&#x96F6;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5373;&#x5B83;&#x4E0D;&#x80FD;&#x7528;&#x4E8E;&#x66F4;&#x6539;&#x5F53;&#x524D;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x3002; &#x6B64;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x7684;&#x521D;&#x59CB;&#x503C;&#x4E0E; console-input-port &#x7684;&#x521D;&#x59CB;&#x503C;&#x76F8;&#x540C;&#x3002;</p>
<p>procedure: <code>(open-input-file path)</code>
procedure: <code>(open-input-file path options)</code>
returns: &#x65B0;&#x7684;&#x8F93;&#x5165;&#x7AEF;&#x53E3;
libraries: (chezscheme)</p>
<p>path &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;open-input-file &#x4E3A; path &#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x672C;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x3002;&#x5982;&#x679C;&#x6587;&#x4EF6;&#x4E0D;&#x5B58;&#x5728;&#x6216;&#x65E0;&#x6CD5;&#x6253;&#x5F00;&#x4EE5;&#x63A5;&#x6536;&#x8F93;&#x5165;&#xFF0C;&#x5219;&#x4F1A;&#x629B;&#x51FA;&#x4E00;&#x4E2A;&#x6761;&#x4EF6;&#x7C7B;&#x578B;&#x7684; &amp;i/o-filename &#x5F02;&#x5E38;&#x3002;</p>
<p>options&#xFF08;&#x5982;&#x679C;&#x5B58;&#x5728;&#xFF09;&#x662F;&#x7B26;&#x53F7;&#x9009;&#x9879;&#x540D;&#x79F0;&#x6216;&#x9009;&#x9879;&#x5217;&#x8868;&#x3002;&#x53EF;&#x80FD;&#x7684;&#x7B26;&#x53F7;&#x9009;&#x9879;&#x540D;&#x79F0;&#x662F; compressed, uncompressed, buffered, &#x548C; unbuffered. &#x9009;&#x9879;&#x5217;&#x8868;&#x662F;&#x5305;&#x542B;&#x96F6;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x7B26;&#x53F7;&#x9009;&#x9879;&#x540D;&#x79F0;&#x7684;&#x5217;&#x8868;&#x3002;</p>
<p>&#x4E92;&#x65A5;&#x7684; compressed &#x548C; uncompressed &#x9009;&#x9879;&#x51B3;&#x5B9A;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x88AB;&#x538B;&#x7F29;&#x65F6;&#xFF0C;&#x662F;&#x5426;&#x5E94;&#x8BE5;&#x89E3;&#x538B;&#x7F29;&#x3002;&#xFF08;&#x8BF7;&#x53C2;&#x89C1; open-output-file.&#xFF09;&#x9ED8;&#x8BA4;&#x503C;&#x662F; uncompressed, &#x56E0;&#x6B64; uncompressed &#x9009;&#x9879;&#x4EC5;&#x4F5C;&#x4E3A;&#x6587;&#x6863;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x4E92;&#x65A5;&#x7684; buffered &#x548C; unbuffered &#x9009;&#x9879;&#x51B3;&#x5B9A;&#x8F93;&#x5165;&#x662F;&#x5426;&#x88AB;&#x7F13;&#x51B2;&#x3002;&#x5F53;&#x7F13;&#x51B2;&#x8F93;&#x5165;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x4EE5;&#x5927;&#x5757;&#x8BFB;&#x53D6;&#xFF0C;&#x5E76;&#x5728;&#x5185;&#x90E8;&#x8FDB;&#x884C;&#x7F13;&#x51B2;&#x4EE5;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF0C;&#x4ECE;&#x800C;&#x51CF;&#x5C11;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BF7;&#x6C42;&#x7684;&#x6570;&#x91CF;&#x3002;&#x5F53;&#x6307;&#x5B9A; unbuffered &#x9009;&#x9879;&#x65F6;&#xFF0C;&#x8F93;&#x5165;&#x662F;&#x65E0;&#x7F13;&#x51B2;&#x7684;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x5982;&#x6B64;&#xFF0C;&#x56E0;&#x4E3A;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x7F13;&#x51B2;&#x5B57;&#x7B26;&#x6765;&#x652F;&#x6301; peek-char &#x548C; unread-char. &#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8F93;&#x5165;&#x662F;&#x7F13;&#x51B2;&#x7684;&#xFF0C;&#x56E0;&#x6B64; buffered &#x9009;&#x9879;&#x4EC5;&#x4F5C;&#x4E3A;&#x6587;&#x6863;&#x4F7F;&#x7528;&#x3002;</p>
<p>For example, the call
&#x4F8B;&#x5982;&#xFF0C;&#x8C03;&#x7528;</p>
<pre><code>(open-input-file &quot;frob&quot; &apos;(compressed))
</code></pre><p>opens the file frob with decompression enabled.
&#x6253;&#x5F00;&#x6587;&#x4EF6; frob &#x65F6;&#x542F;&#x7528;&#x89E3;&#x538B;&#x7F29;&#x3002;</p>
<p>Open-input-file &#x7684; R<sup>6</sup>RS &#x7248;&#x672C;&#x4E0D;&#x652F;&#x6301;&#x53EF;&#x9009;&#x7684; options &#x53C2;&#x6570;&#x3002;</p>
<p>procedure: <code>(call-with-input-file path procedure)</code>
procedure: <code>(call-with-input-file path procedure options)</code>
returns: procedure &#x7684;&#x8FD4;&#x56DE;&#x503C;
libraries: (chezscheme)</p>
<p>path &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;procedure &#x5E94;&#x8BE5;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x3002;</p>
<p>call-with-input-file &#x4E3A; path &#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#xFF0C;&#x5C31;&#x50CF;&#x4F7F;&#x7528; open-input-file &#x4E00;&#x6837;&#xFF0C;&#x5E76;&#x5C06;&#x6B64;&#x7AEF;&#x53E3;&#x4F20;&#x9012;&#x7ED9; procedure&#x3002;&#x5982;&#x679C; procedure &#x6B63;&#x5E38;&#x8FD4;&#x56DE;&#xFF0C;call-with-input-file &#x5C06;&#x5173;&#x95ED;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x5E76;&#x8FD4;&#x56DE; procedure &#x8FD4;&#x56DE;&#x7684;&#x503C;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5728; procedure &#x5916;&#x90E8;&#x521B;&#x5EFA;&#x7684; continuation &#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x5219; call-with-input-file &#x4E0D;&#x4F1A;&#x81EA;&#x52A8;&#x5173;&#x95ED;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#xFF0C;&#x56E0;&#x4E3A;&#x7A0D;&#x540E;&#x53EF;&#x80FD;&#x4F1A;&#x8C03;&#x7528;&#x5728; procedure &#x5185;&#x521B;&#x5EFA;&#x7684;&#x53E6;&#x4E00;&#x4E2A; continuation&#xFF0C;&#x5C06;&#x63A7;&#x5236;&#x6743;&#x8FD4;&#x56DE;&#x7ED9; procedure&#x3002;&#x5982;&#x679C; procedure &#x6CA1;&#x6709;&#x8FD4;&#x56DE;&#xFF0C;&#x5219;&#x53EA;&#x6709;&#x5728;&#x53EF;&#x4EE5;&#x786E;&#x8BA4;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x4E0D;&#x518D;&#x53EF;&#x8BBF;&#x95EE;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B9E;&#x73B0;&#x624D;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x5173;&#x95ED;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x3002;&#x5982;&#x300A;Scheme &#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x300B;&#x7B2C; 4 &#x7248;&#x7B2C; 5.6 &#x8282;&#x6240;&#x793A;&#xFF0C;&#x5982;&#x679C;&#x5728; procedure &#x5916;&#x90E8;&#x521B;&#x5EFA;&#x7684; continuation &#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x5219; dynamic-wind &#x53EF;&#x7528;&#x4E8E;&#x786E;&#x4FDD;&#x7AEF;&#x53E3;&#x88AB;&#x5173;&#x95ED;&#x3002;</p>
<p>See open-input-file above for a description of the optional options argument.
&#x6709;&#x5173;&#x53EF;&#x9009; options &#x53C2;&#x6570;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x4E0A;&#x6587;&#x7684; open-input-file &#x6761;&#x76EE;&#x3002;</p>
<p>The Revised6 Report version of call-with-input-file does not support the optional input argument.
Call-with-input-file &#x7684; R<sup>6</sup>RS &#x7248;&#x672C;&#x4E0D;&#x652F;&#x6301;&#x53EF;&#x9009;&#x7684; input &#x53C2;&#x6570;&#x3002;</p>
<p>procedure: <code>(with-input-from-file path thunk)</code>
procedure: <code>(with-input-from-file path thunk options)</code>
returns: thunk &#x7684;&#x8FD4;&#x56DE;&#x503C;
libraries: (chezscheme)</p>
<p>path &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;thunk &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x63A5;&#x53D7;&#x96F6;&#x4E2A;&#x53C2;&#x6570;&#x3002;</p>
<p>with-input-from-file &#x5728;&#x5E94;&#x7528; thunk &#x671F;&#x95F4;&#xFF0C;&#x6682;&#x65F6;&#x5C06;&#x5F53;&#x524D;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x66F4;&#x6539;&#x4E3A;&#x6253;&#x5F00; path &#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5C31;&#x50CF;&#x4F7F;&#x7528; open-input-file &#x4E00;&#x6837;&#x3002;&#x5982;&#x679C; thunk &#x8FD4;&#x56DE;&#xFF0C;&#x5219;&#x5173;&#x95ED;&#x7AEF;&#x53E3;&#x5E76;&#x5C06;&#x5F53;&#x524D;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x6062;&#x590D;&#x4E3A;&#x5176;&#x65E7;&#x503C;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5728; thunk &#x8FD4;&#x56DE;&#x4E4B;&#x524D;&#x8C03;&#x7528;&#x5728; thunk &#x4E4B;&#x5916;&#x521B;&#x5EFA;&#x7684; continuation, &#x5219; with-input-from-file &#x7684;&#x884C;&#x4E3A;&#x662F;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#x3002;&#x5B9E;&#x73B0;&#x53EF;&#x80FD;&#x4F1A;&#x5173;&#x95ED;&#x7AEF;&#x53E3;&#x5E76;&#x5C06;&#x5F53;&#x524D;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x6062;&#x590D;&#x4E3A;&#x5176;&#x65E7;&#x503C;&#x2014;&#x4F46;&#x5B83;&#x4E5F;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x8FD9;&#x4E48;&#x505A;&#x3002;</p>
<p>&#x6709;&#x5173;&#x53EF;&#x9009; options &#x53C2;&#x6570;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x4E0A;&#x6587;&#x7684; open-input-file &#x6761;&#x76EE;&#x3002;</p>
<p>with-input-from-file &#x7684; R<sup>6</sup>RS &#x7248;&#x672C;&#x4E0D;&#x652F;&#x6301;&#x53EF;&#x9009;&#x7684; options &#x53C2;&#x6570;&#x3002;</p>
<p>procedure: <code>(open-fd-input-port fd)</code>
procedure: <code>(open-fd-input-port fd b-mode)</code>
procedure: <code>(open-fd-input-port fd b-mode ?transcoder)</code>
&#x8FD4;&#x56DE;&#xFF1A;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26; fd &#x7684;&#x65B0;&#x8F93;&#x5165;&#x7AEF;&#x53E3;
libraries: (chezscheme)</p>
<p>fd &#x5FC5;&#x987B;&#x662F;&#x975E;&#x8D1F;&#x7684;&#x7CBE;&#x786E;&#x6574;&#x6570;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x662F;&#x6709;&#x6548;&#x7684;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x3002;&#x5982;&#x679C;&#x5B58;&#x5728; ?transcoder, &#x800C;&#x4E14;&#x4E0D;&#x4E3A; #f&#xFF0C;&#x5219;&#x5B83;&#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#xFF0C;&#x5E76;&#x4E14;&#x6B64;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6587;&#x672C;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#xFF0C;&#x5176;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#x4E3A; ?transcoder. &#x5426;&#x5219;&#xFF0C;&#x6B64;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x4E8C;&#x8FDB;&#x5236;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x3002;&#x6709;&#x5173;&#x5176;&#x4ED6;&#x53C2;&#x6570;&#x7684;&#x7EA6;&#x675F;&#x548C;&#x5F71;&#x54CD;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x8BF7;&#x53C2;&#x89C1;&#x300A;Scheme &#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x300B;&#x7B2C; 4 &#x7248;&#x7B2C; 7.2 &#x8282;&#x4E2D;&#x7684;&#x5F15;&#x8A00;&#x3002;</p>
<p>The file descriptor is closed when the port is closed.
&#x5173;&#x95ED;&#x7AEF;&#x53E3;&#x65F6;&#x4F1A;&#x5173;&#x95ED;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x3002;</p>
<p>procedure: <code>(standard-input-port)</code>
procedure: <code>(standard-input-port b-mode)</code>
procedure: <code>(standard-input-port b-mode ?transcoder)</code>
&#x8FD4;&#x56DE;&#xFF1A;&#x8FDE;&#x63A5;&#x5230;&#x8FDB;&#x7A0B;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x7684;&#x65B0;&#x8F93;&#x5165;&#x7AEF;&#x53E3;
libraries: (chezscheme)</p>
<p>&#x5982;&#x679C;&#x5B58;&#x5728; ?transcoder, &#x4E14;&#x4E0D;&#x4E3A;#f&#xFF0C;&#x5219;&#x5B83;&#x5FC5;&#x987B;&#x662F;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#xFF0C;&#x5E76;&#x4E14;&#x8BE5;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6587;&#x672C;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#xFF0C;&#x5176;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#x662F; ?transcoder. &#x5426;&#x5219;&#xFF0C;&#x6B64;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x4E8C;&#x8FDB;&#x5236;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x3002;&#x7F13;&#x51B2;&#x6A21;&#x5F0F; b-mode &#x9ED8;&#x8BA4;&#x4E3A; block.</p>
<p>&#x6B64;&#x8FC7;&#x7A0B;&#x7684; R<sup>6</sup>RS &#x7248;&#x672C;&#x4E0D;&#x63A5;&#x53D7;&#x53EF;&#x9009;&#x7684; b-mode &#x548C; ?transcoder &#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x5C06;&#x5176;&#x9650;&#x5236;&#x4E3A;&#x4F9D;&#x8D56;&#x4E8E;&#x5B9E;&#x73B0;&#x7684;&#x7F13;&#x51B2;&#x6A21;&#x5F0F;&#xFF08;Chez Scheme &#x4E2D;&#x4E3A; block&#xFF09;&#x548C;&#x4E8C;&#x8FDB;&#x5236;&#x8F93;&#x51FA;&#x3002;</p>
<p>procedure: <code>(get-string-some textual-input-port)</code>
&#x8FD4;&#x56DE;&#xFF1A;&#x975E;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#x6216; eof &#x5BF9;&#x8C61;
libraries: (chezscheme)</p>
<p>&#x5982;&#x679C; textual-input-port &#x4F4D;&#x4E8E;&#x6587;&#x4EF6;&#x672B;&#x5C3E;&#xFF0C;&#x5219;&#x8FD4;&#x56DE; eof &#x5BF9;&#x8C61;&#x3002;&#x5426;&#x5219;&#xFF0C;get-string-some &#x8BFB;&#x53D6;&#xFF08;&#x5C31;&#x50CF;&#x4F7F;&#x7528; get-u8 &#x4E00;&#x6837;&#xFF09;&#x81F3;&#x5C11;&#x4E00;&#x4E2A;&#xFF0C;&#x6216;&#x66F4;&#x591A;&#x5B57;&#x7B26;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x5305;&#x542B;&#x8FD9;&#x4E9B;&#x5B57;&#x7B26;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x7AEF;&#x53E3;&#x7684;&#x4F4D;&#x7F6E;&#x524D;&#x8FDB;&#x5230;&#x8BFB;&#x53D6;&#x7684;&#x5B57;&#x7B26;&#x4E4B;&#x540E;&#x3002;&#x6B64;&#x64CD;&#x4F5C;&#x8BFB;&#x53D6;&#x7684;&#x6700;&#x5927;&#x5B57;&#x7B26;&#x6570;&#x4E0E;&#x5B9E;&#x73B0;&#x6709;&#x5173;&#x3002;</p>
<p>&#x5982;&#x679C;&#x7AEF;&#x53E3;&#x5904;&#x4E8E;&#x975E;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#xFF08;&#x8BF7;&#x53C2;&#x9605; set-port-nonblocking!&#xFF09;&#x4E14;&#x6CA1;&#x6709;&#x5DF2;&#x5C31;&#x7EEA;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x5219;&#x4F1A;&#x53D1;&#x751F;&#x786E;&#x4FDD;&#x201C;&#x81F3;&#x5C11;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x201D;&#x7684;&#x5F02;&#x5E38;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<p>procedure: <code>(get-string-some! textual-input-port string start n)</code>
&#x8FD4;&#x56DE;&#xFF1A;&#x8BFB;&#x53D6;&#x7684;&#x5B57;&#x7B26;&#x6570;&#xFF0C;&#x4E3A;&#x7CBE;&#x786E;&#x7684;&#x975E;&#x8D1F;&#x6574;&#x6570;&#xFF0C;&#x6216; eof &#x5BF9;&#x8C61;
libraries: (chezscheme)</p>
<p>start &#x548C; n &#x5FC5;&#x987B;&#x662F;&#x7CBE;&#x786E;&#x7684;&#x975E;&#x8D1F;&#x6574;&#x6570;&#xFF0C;start &#x548C; n &#x7684;&#x548C;&#x4E0D;&#x5F97;&#x8D85;&#x8FC7; string &#x7684;&#x957F;&#x5EA6;&#x3002;</p>
<p>&#x5982;&#x679C; n &#x4E3A; 0&#xFF0C;&#x5219;&#x6B64;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x96F6;&#xFF0C;&#x800C;&#x4E0D;&#x5C1D;&#x8BD5;&#x4ECE; textual-input-port &#x8BFB;&#x53D6;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x4FEE;&#x6539; string.</p>
<p>&#x5426;&#x5219;&#xFF0C;&#x5982;&#x679C; textual-input-port &#x4F4D;&#x4E8E;&#x6587;&#x4EF6;&#x672B;&#x5C3E;&#xFF0C;&#x5219;&#x6B64;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE; eof &#x5BF9;&#x8C61;&#xFF0C;&#x4F46;&#x5728;&#x7AEF;&#x53E3;&#x5904;&#x4E8E;&#x975E;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#xFF08;&#x8BF7;&#x53C2;&#x9605; set-port-nonblocking!&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x5229;&#x7528;&#x963B;&#x585E;&#x65E0;&#x6CD5;&#x786E;&#x5B9A;&#x7AEF;&#x53E3;&#x4F4D;&#x4E8E;&#x6587;&#x4EF6;&#x7ED3;&#x5C3E;&#x65F6;&#xFF0C;&#x5B83;&#x8FD4;&#x56DE; 0. &#x5728;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x90FD;&#x4E0D;&#x4F1A;&#x4FEE;&#x6539; string.</p>
<p>&#x5426;&#x5219;&#xFF0C;&#x6B64;&#x8FC7;&#x7A0B;&#x4ECE;&#x7AEF;&#x53E3;&#x8BFB;&#x53D6;&#xFF08;&#x548C;&#x4F7F;&#x7528; get-char &#x4E00;&#x6837;&#xFF09;&#x6700;&#x591A; n &#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x5C06;&#x5B57;&#x7B26;&#x5B58;&#x50A8;&#x5728; string &#x59CB;&#x4E8E; start &#x7684;&#x8FDE;&#x7EED;&#x4F4D;&#x7F6E;&#x4E0A;&#xFF0C;&#x628A;&#x7AEF;&#x53E3;&#x4F4D;&#x7F6E;&#x524D;&#x8FDB;&#x5230;&#x8BFB;&#x53D6;&#x7684;&#x5B57;&#x7B26;&#x4E4B;&#x540E;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x8BFB;&#x53D6;&#x7684;&#x5B57;&#x7B26;&#x6570;&#x3002;</p>
<p>&#x5982;&#x679C;&#x7AEF;&#x53E3;&#x5904;&#x4E8E;&#x975E;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#xFF0C;&#x5219;&#x6B64;&#x8FC7;&#x7A0B;&#x4E0D;&#x4F1A;&#x8BFB;&#x53D6;&#x6BD4;&#x5B83;&#x4E0D;&#x4F7F;&#x7528;&#x963B;&#x585E;&#x65F6;&#x80FD;&#x591F;&#x8BFB;&#x53D6;&#x7684;&#x66F4;&#x591A;&#x5B57;&#x7B26;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x80FD;&#x8BFB;&#x53D6;&#x96F6;&#x4E2A;&#x5B57;&#x7B26;; &#x5426;&#x5219;&#xFF0C;&#x5B83;&#x4F1A;&#x8BFB;&#x53D6;&#x81F3;&#x5C11;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x8D85;&#x8FC7;&#x5F53;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x53D8;&#x4E3A;&#x53EF;&#x7528;&#x65F6;&#x53EF;&#x7528;&#x7684;&#x5B57;&#x7B26;&#x3002;</p>
<p>procedure: <code>(get-bytevector-some! binary-input-port bytevector start n)</code>
&#x8FD4;&#x56DE;&#xFF1A;&#x8BFB;&#x53D6;&#x7684;&#x5B57;&#x8282;&#x6570;&#xFF0C;&#x4E3A;&#x7CBE;&#x786E;&#x7684;&#x975E;&#x8D1F;&#x6574;&#x6570;&#x6216; eof &#x5BF9;&#x8C61;
libraries: (chezscheme)</p>
<p>start &#x548C; n &#x5FC5;&#x987B;&#x662F;&#x7CBE;&#x786E;&#x7684;&#x975E;&#x8D1F;&#x6574;&#x6570;&#xFF0C;start &#x548C; n &#x7684;&#x548C;&#x4E0D;&#x5F97;&#x8D85;&#x8FC7; bytevector &#x7684;&#x957F;&#x5EA6;&#x3002;</p>
<p>&#x5982;&#x679C; n &#x4E3A; 0&#xFF0C;&#x5219;&#x6B64;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x96F6;&#xFF0C;&#x800C;&#x4E0D;&#x5C1D;&#x8BD5;&#x4ECE; binary-input-port &#x8BFB;&#x53D6;&#x5E76;&#x4E14;&#x4E0D;&#x4FEE;&#x6539; bytevector.</p>
<p>&#x5426;&#x5219;&#xFF0C;&#x5982;&#x679C; binary-input-port &#x4F4D;&#x4E8E;&#x6587;&#x4EF6;&#x672B;&#x5C3E;&#xFF0C;&#x5219;&#x6B64;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE; eof &#x5BF9;&#x8C61;&#xFF0C;&#x4F46;&#x5728;&#x7AEF;&#x53E3;&#x5904;&#x4E8E;&#x975E;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#xFF08;&#x8BF7;&#x53C2;&#x9605; set-port-nonblocking!&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x5229;&#x7528;&#x963B;&#x585E;&#x65E0;&#x6CD5;&#x786E;&#x5B9A;&#x7AEF;&#x53E3;&#x4F4D;&#x4E8E;&#x6587;&#x4EF6;&#x7ED3;&#x5C3E;&#x65F6;&#xFF0C;&#x5B83;&#x8FD4;&#x56DE; 0. &#x5728;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x90FD;&#x4E0D;&#x4F1A;&#x4FEE;&#x6539; bytevector.</p>
<p>&#x5426;&#x5219;&#xFF0C;&#x6B64;&#x8FC7;&#x7A0B;&#x4ECE;&#x7AEF;&#x53E3;&#x8BFB;&#x53D6;&#xFF08;&#x5982;&#x540C;&#x4F7F;&#x7528; get-u8&#xFF09;&#x6700;&#x591A; n &#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x5C06;&#x5B57;&#x8282;&#x5B58;&#x50A8;&#x5728; bytevector &#x59CB;&#x4E8E; start &#x7684;&#x8FDE;&#x7EED;&#x4F4D;&#x7F6E;&#x4E0A;&#xFF0C;&#x628A;&#x7AEF;&#x53E3;&#x7684;&#x4F4D;&#x7F6E;&#x524D;&#x8FDB;&#x5230;&#x8BFB;&#x53D6;&#x7684;&#x5B57;&#x8282;&#x4E4B;&#x540E;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x8BFB;&#x53D6;&#x7684;&#x5B57;&#x8282;&#x6570;&#x3002;</p>
<p>&#x5982;&#x679C;&#x7AEF;&#x53E3;&#x5904;&#x4E8E;&#x975E;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#xFF0C;&#x5219;&#x6B64;&#x8FC7;&#x7A0B;&#x4E0D;&#x4F1A;&#x8BFB;&#x53D6;&#x6BD4;&#x5B83;&#x4E0D;&#x4F7F;&#x7528;&#x963B;&#x585E;&#x65F6;&#x80FD;&#x591F;&#x8BFB;&#x53D6;&#x7684;&#x66F4;&#x591A;&#x5B57;&#x8282;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x80FD;&#x8BFB;&#x53D6;&#x96F6;&#x4E2A;&#x5B57;&#x8282;; &#x5426;&#x5219;&#xFF0C;&#x5B83;&#x4F1A;&#x8BFB;&#x53D6;&#x81F3;&#x5C11;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x8D85;&#x8FC7;&#x5F53;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x53D8;&#x4E3A;&#x53EF;&#x7528;&#x65F6;&#x53EF;&#x7528;&#x7684;&#x5B57;&#x8282;&#x3002;</p>
<p>procedure: <code>(unread-char char)</code>
procedure: <code>(unread-char char textual-input-port)</code>
procedure: <code>(unget-char textual-input-port char)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>&#x5BF9;&#x4E8E; unread-char&#xFF0C;&#x5982;&#x679C;&#x672A;&#x63D0;&#x4F9B; textual-input-port&#xFF0C;&#x5219;&#x9ED8;&#x8BA4;&#x4E3A;&#x5F53;&#x524D;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x3002;&#x8FD9;&#x4E9B;&#x8FC7;&#x7A0B;&#x201C;&#x672A;&#x8BFB;&#x201D;&#x4ECE; textual-input-port &#x8BFB;&#x53D6;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x3002;char &#x53EF;&#x80FD;&#x4F1A;&#x4E5F;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x88AB;&#x5FFD;&#x7565;&#xFF0C;&#x5177;&#x4F53;&#x53D6;&#x51B3;&#x4E8E;&#x5B9E;&#x73B0;&#x3002; &#x5728;&#x4EFB;&#x4F55;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;char &#x5E94;&#x8BE5;&#x662F;&#x4ECE;&#x7AEF;&#x53E3;&#x8BFB;&#x53D6;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5BF9; read-char &#x6216; get-char &#x8FDB;&#x884C;&#x4E2D;&#x95F4;&#x8C03;&#x7528;&#xFF0C;&#x5219;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E0D;&#x5E94;&#x5728;&#x540C;&#x4E00;&#x7AEF;&#x53E3;&#x4E0A;&#x88AB;&#x672A;&#x8BFB;&#x4E24;&#x6B21;&#x3002;</p>
<p>unread-char &#x548C; unget-char &#x662F;&#x4E3A;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x524D;&#x77BB;&#x5B57;&#x7B26;&#x7684;&#x5E94;&#x7528;&#x63D0;&#x4F9B;&#x7684;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x4EE3;&#x66FF;&#xFF0C;&#x751A;&#x81F3;&#x4E0E; peek-char &#x6216; lookahead-char &#x7ED3;&#x5408;&#x4F7F;&#x7528;&#x3002;&#x8FC7;&#x7A0B; read-word &#x9700;&#x8981;&#x4E00;&#x4E2A;&#x524D;&#x77BB;&#x5B57;&#x7B26;&#xFF0C;&#x5B83;&#x57FA;&#x4E8E; unread-char &#x5B9A;&#x4E49;&#x5982;&#x4E0B;&#x3002;read-word &#x5C06;&#x6587;&#x672C;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x4E2D;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x5355;&#x8BCD;&#x4F5C;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#x8FD4;&#x56DE;&#xFF0C;&#x5176;&#x4E2D;&#x5355;&#x8BCD;&#x88AB;&#x5B9A;&#x4E49;&#x4E3A;&#x4E00;&#x4E2A;&#x5B57;&#x6BCD;&#x5B57;&#x7B26;&#x5E8F;&#x5217;&#x3002;&#x7531;&#x4E8E;&#x76F4;&#x5230;&#x5B83;&#x8BFB;&#x53D6;&#x5230;&#x4E00;&#x4E2A;&#x591A;&#x4F59;&#x5B57;&#x7B26;&#x540E;&#xFF0C;&#x624D;&#x80FD;&#x77E5;&#x9053;&#x8BFB;&#x5B8C;&#x4E86;&#x6574;&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;&#x56E0;&#x6B64; read-word &#x4F7F;&#x7528; unread-char &#x5C06;&#x90A3;&#x4E2A;&#x5B57;&#x7B26;&#x8FD4;&#x8FD8;&#x7ED9;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x3002;</p>
<pre><code>(define read-word
  (lambda (p)
    (list-&gt;string
      (let f ([c (read-char p)])
        (cond
          [(eof-object? c) &apos;()]
          [(char-alphabetic? c)
           (cons c (f (read-char p)))]
          [else
           (unread-char c p)
           &apos;()])))))
</code></pre><p>&#x5728;&#x4E0B;&#x9762;&#x7684;&#x66FF;&#x4EE3;&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528; peek-char &#x800C;&#x4E0D;&#x662F; unread-char.</p>
<pre><code>(define read-word
  (lambda (p)
    (list-&gt;string
      (let f ([c (peek-char p)])
        (cond
          [(eof-object? c) &apos;()]
          [(char-alphabetic? c)
           (read-char p)
           (cons c (f (peek-char p)))]
          [else &apos;()])))))
</code></pre><p>&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;unread-char &#x7684;&#x4F18;&#x52BF;&#x662F;&#x6BCF;&#x4E2A;&#x5355;&#x8BCD;&#x53EA;&#x9700;&#x8981;&#x8C03;&#x7528;&#x4E00;&#x6B21; unread-char&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x5355;&#x8BCD;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5B57;&#x7B26;&#x4EE5;&#x53CA;&#x5355;&#x8BCD;&#x4E4B;&#x540E;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x8C03;&#x7528; peek-char&#x3002;&#x5728;&#x8BB8;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;unread-char &#x548C; unget-char &#x4E0D;&#x4EAB;&#x6709;&#x6B64;&#x4F18;&#x52BF;&#xFF0C;&#x5219;&#x5E94;&#x8BE5;&#x8F6C;&#x800C;&#x4F7F;&#x7528; peek-char &#x6216; lookahead-char&#x3002;</p>
<p>procedure: <code>(unget-u8 binary-input-port octet)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>&#x6B64;&#x8FC7;&#x7A0B;&#x201C;&#x56DE;&#x9000;&#x201D;&#x4ECE; binary-input-port &#x8BFB;&#x53D6;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x3002;octet &#x53EF;&#x80FD;&#x4F1A;&#x4E5F;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x88AB;&#x5FFD;&#x7565;&#xFF0C;&#x5177;&#x4F53;&#x53D6;&#x51B3;&#x4E8E;&#x5B9E;&#x73B0;&#x3002;&#x5728;&#x4EFB;&#x4F55;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;octet &#x5E94;&#x8BE5;&#x662F;&#x4ECE;&#x7AEF;&#x53E3;&#x8BFB;&#x53D6;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5BF9; get-u8 &#x7684;&#x4E2D;&#x95F4;&#x8C03;&#x7528;&#xFF0C;&#x5219;&#x4E0D;&#x5E94;&#x5728;&#x540C;&#x4E00;&#x7AEF;&#x53E3;&#x4E0A;&#x56DE;&#x9000;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x4E24;&#x6B21;&#x3002;</p>
<p>procedure: <code>(input-port-ready? input-port)</code>
&#x8FD4;&#x56DE;: &#x5982;&#x679C; <code>input-port</code> &#x4E0A;&#x6709;&#x53EF;&#x7528;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x4E3A; <code>#t</code>, &#x5426;&#x5219;&#x4E3A; <code>#f</code>.
libraries: (chezscheme)</p>
<p>input-port-ready? &#x5141;&#x8BB8;&#x7A0B;&#x5E8F;&#x5728;&#x4E0D;&#x6302;&#x8D77;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x68C0;&#x67E5;&#x8F93;&#x5165;&#x662F;&#x5426;&#x5728;&#x6587;&#x672C;&#x6216;&#x4E8C;&#x8FDB;&#x5236;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x4E0A;&#x53EF;&#x7528;&#x3002;&#x5982;&#x679C;&#x8F93;&#x5165;&#x53EF;&#x7528;&#x6216;&#x7AEF;&#x53E3;&#x4F4D;&#x4E8E;&#x6587;&#x4EF6;&#x672B;&#x5C3E;&#xFF0C;&#x5219; input-port-ready? &#x8FD4;&#x56DE;#t. &#x5982;&#x679C;&#x5B83;&#x65E0;&#x6CD5;&#x786E;&#x5B9A;&#x7AEF;&#x53E3;&#x7684;&#x8F93;&#x5165;&#x662F;&#x5426;&#x5C31;&#x7EEA;&#xFF0C;&#x5219;&#x4F1A;&#x629B;&#x51FA;&#x4E00;&#x4E2A;&#x6761;&#x4EF6;&#x7C7B;&#x578B;&#x7684; i/o-read-error &#x5F02;&#x5E38;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x5B83;&#x8FD4;&#x56DE;#f.</p>
<p>procedure: <code>(char-ready?)</code>
procedure: <code>(char-ready? textual-input-port)</code>
&#x8FD4;&#x56DE;: &#x5982;&#x679C; <code>textual-input-port</code> &#x4E0A;&#x6709;&#x53EF;&#x7528;&#x5B57;&#x7B26;&#xFF0C;&#x5219;&#x4E3A; <code>#t</code>, &#x5426;&#x5219;&#x4E3A; <code>#f</code>.
libraries: (chezscheme)</p>
<p>&#x5982;&#x679C;&#x672A;&#x63D0;&#x4F9B; textual-input-port&#xFF0C;&#x5219;&#x9ED8;&#x8BA4;&#x4E3A;&#x5F53;&#x524D;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x3002;char-ready? &#x7C7B;&#x4F3C;&#x4E8E; input-port-ready?, &#x53EA;&#x662F;&#x5B83;&#x4EC5;&#x9650;&#x4E8E;&#x6587;&#x672C;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x3002;</p>
<p>procedure: <code>(block-read textual-input-port string)</code>
procedure: <code>(block-read textual-input-port string count)</code>
returns: &#x53C2;&#x89C1;&#x4E0B;&#x6587;
libraries: (chezscheme)</p>
<p>count &#x5FC5;&#x987B;&#x662F;&#x5C0F;&#x4E8E;&#x6216;&#x7B49;&#x4E8E; string &#x957F;&#x5EA6;&#x7684;&#x975E;&#x8D1F; fixnum. &#x5982;&#x679C;&#x672A;&#x63D0;&#x4F9B;&#xFF0C;&#x5219;&#x9ED8;&#x8BA4;&#x4E3A; string &#x7684;&#x957F;&#x5EA6;&#x3002;</p>
<p>&#x5982;&#x679C; textual-input-port &#x4F4D;&#x4E8E;&#x6587;&#x4EF6;&#x672B;&#x5C3E;&#xFF0C;&#x5219;&#x8FD4;&#x56DE; eof &#x5BF9;&#x8C61;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x4F1A;&#x4EE5; textual-input-port &#x4E2D;&#x53EF;&#x8BFB;&#x7684;&#x81F3;&#x591A; count &#x4E2A;&#x5B57;&#x7B26;&#x586B;&#x5145; string, &#x5E76;&#x8FD4;&#x56DE;&#x7F6E;&#x4E8E;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x7684;&#x5B57;&#x7B26;&#x6570;&#x3002;</p>
<p>&#x5982;&#x679C;&#x7F13;&#x51B2;&#x4E86; textual-input-port &#x5E76;&#x4E14;&#x7F13;&#x51B2;&#x533A;&#x662F;&#x975E;&#x7A7A;&#x7684;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;&#x7F13;&#x51B2;&#x7684;&#x8F93;&#x5165;&#x6216;&#x5176;&#x4E00;&#x90E8;&#x5206;; &#x5426;&#x5219; block-read &#x5B8C;&#x5168;&#x7ED5;&#x8FC7;&#x7F13;&#x51B2;&#x533A;&#x3002;</p>
<p>procedure: <code>(read-token)</code>
procedure: <code>(read-token textual-input-port)</code>
returns: &#x53C2;&#x89C1;&#x4E0B;&#x6587;
libraries: (chezscheme)</p>
<p>&#x89E3;&#x6790; Scheme datum &#x5728;&#x6982;&#x5FF5;&#x4E0A;&#x5206;&#x4E24;&#x6B65;&#x6267;&#x884C;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5F62;&#x6210; datum &#x7684;&#x5B57;&#x7B26;&#x5E8F;&#x5217;&#x88AB;&#x5206;&#x7EC4;&#x4E3A; token, &#x4F8B;&#x5982;&#x7B26;&#x53F7;&#xFF0C;&#x6570;&#x5B57;&#xFF0C;&#x5DE6;&#x62EC;&#x53F7;&#x548C;&#x53CC;&#x5F15;&#x53F7;&#x3002;&#x5728;&#x8FD9;&#x7B2C;&#x4E00;&#x6B65;&#x4E2D;&#xFF0C;&#x7A7A;&#x683C;&#x548C;&#x6CE8;&#x91CA;&#x4F1A;&#x88AB;&#x4E22;&#x5F03;&#x3002;&#x63A5;&#x7740;&#xFF0C;&#x8FD9;&#x4E9B; token &#x88AB;&#x5206;&#x7EC4;&#x4E3A;&#x6570;&#x636E;&#x3002;</p>
<p>&#x8BFB;&#x53D6;&#x6267;&#x884C;&#x8FD9;&#x4E24;&#x4E2A;&#x6B65;&#x9AA4;&#x5E76;&#x521B;&#x5EFA;&#x5B83;&#x89E3;&#x6790;&#x7684;&#x6BCF;&#x4E2A; datum &#x7684;&#x5185;&#x90E8;&#x8868;&#x793A;&#x3002;read-token &#x53EF;&#x7528;&#x4E8E;&#x4EC5;&#x6267;&#x884C;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x4E00;&#x6B21;&#x4E00;&#x4E2A; token. read-token &#x65E8;&#x5728;&#x4F9B;&#x7F16;&#x8F91;&#x5668;&#x548C;&#x7A0B;&#x5E8F;&#x683C;&#x5F0F;&#x5316;&#x5DE5;&#x5177;&#x4F7F;&#x7528;&#xFF0C;&#x5B83;&#x4EEC;&#x5FC5;&#x987B;&#x80FD;&#x591F;&#x89E3;&#x6790;&#x7A0B;&#x5E8F;&#x6216; datum &#x800C;&#x65E0;&#x9700;&#x5B9E;&#x9645;&#x8BFB;&#x53D6;&#x5B83;&#x3002;</p>
<p>&#x5982;&#x679C;&#x672A;&#x63D0;&#x4F9B; textual-input-port&#xFF0C;&#x5219;&#x9ED8;&#x8BA4;&#x4E3A;&#x5F53;&#x524D;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x3002;&#x5B83;&#x4ECE;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x8BFB;&#x53D6;&#x4E00;&#x4E2A; token &#x5E76;&#x8FD4;&#x56DE;&#x56DB;&#x4E2A;&#x503C;&#xFF1A;</p>
<p>type:
    &#x63CF;&#x8FF0;&#x8BFB;&#x53D6;&#x7684; token &#x7C7B;&#x578B;&#x7684;&#x7B26;&#x53F7;&#xFF0C;</p>
<p>value:
    token &#x7684;&#x503C;&#xFF0C;</p>
<p>start:
    token &#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x76F8;&#x5BF9;&#x4E8E;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x7684;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x548C;
end:
    token &#x4E4B;&#x540E;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x76F8;&#x5BF9;&#x4E8E;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x7684;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x5F53; token &#x7C7B;&#x578B;&#x5B8C;&#x5168;&#x6307;&#x5B9A; token &#x65F6;&#xFF0C;read-token &#x8FD4;&#x56DE;#f &#x4F5C;&#x4E3A;&#x503C;&#x3002;&#x4E0B;&#x9762;&#x5217;&#x51FA;&#x4E86; token &#x7C7B;&#x578B;&#xFF0C;&#x62EC;&#x53F7;&#x4E2D;&#x6709;&#x76F8;&#x5E94;&#x7684;&#x503C;&#x3002;</p>
<p>atomic
    (atom) &#x4E00;&#x4E2A;&#x539F;&#x5B50;&#x503C;&#xFF0C;&#x5373;&#xFF0C;&#x7B26;&#x53F7;&#xFF0C;&#x5E03;&#x5C14;&#x503C;&#xFF0C;&#x6570;&#x5B57;&#xFF0C;&#x5B57;&#x7B26;&#xFF0C;#!eof &#x6216;#!bwp</p>
<p>box
    (#f) box &#x524D;&#x7F00;&#xFF0C;&#x5373;&#xFF0C; #&amp; 
dot
    (#f) &#x70B9;&#x5BF9;&#x5206;&#x9694;&#x7B26;&#xFF0C;&#x5373;&#xFF0C; . 
eof
    (#!eof) &#x6587;&#x4EF6;&#x672B;&#x5C3E;
fasl
    (#f) fasl &#x524D;&#x7F00;&#xFF0C;&#x5373;&#xFF0C; #@ 
insert
    (n) &#x56FE;&#x5F15;&#x7528;&#xFF0C;&#x5373;&#xFF0C; #n# 
lbrack
    (#f) &#x5DE6;&#x65B9;&#x62EC;&#x53F7;
lparen
    (#f) &#x5DE6;&#x5706;&#x62EC;&#x53F7;
mark
    (n) &#x56FE;&#x6807;&#x8BB0;&#xFF0C;&#x5373;&#xFF0C; #n= 
quote
    (quote, quasiquote, syntax, unquote, unquote-splicing, or datum-comment) &#x7F29;&#x5199;&#x6807;&#x8BB0;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C; &apos; &#x6216; ,@ &#x6216; datum &#x6CE8;&#x91CA;&#x524D;&#x7F00;
rbrack
    (#f) &#x53F3;&#x65B9;&#x62EC;&#x53F7;
record-brack
    (#f) record &#x5DE6;&#x65B9;&#x62EC;&#x53F7;&#xFF0C;&#x5373;&#xFF0C; #[ 
rparen
    (#f) &#x53F3;&#x5706;&#x62EC;&#x53F7;
vfxnparen
    (n) fxvector &#x524D;&#x7F00;&#xFF0C;&#x5373;&#xFF0C; #nvfx( 
vfxparen
    (#f) fxvector &#x524D;&#x7F00;&#xFF0C;&#x5373;&#xFF0C; #vfx( 
vnparen
    (n) &#x5411;&#x91CF;&#x524D;&#x7F00;&#xFF0C;&#x5373;&#xFF0C; #n( 
vparen
    (#f) &#x5411;&#x91CF;&#x524D;&#x7F00;&#xFF0C;&#x5373;&#xFF0C; #( 
vu8nparen
    (n) &#x5B57;&#x8282;&#x5411;&#x91CF;&#x524D;&#x7F00;&#xFF0C;&#x5373;&#xFF0C; #nvu8( 
vu8paren
    (#f) &#x5B57;&#x8282;&#x5411;&#x91CF;&#x524D;&#x7F00;&#xFF0C;&#x5373;&#xFF0C; #vu8( </p>
<p>&#x5728;&#x5C06;&#x6765;&#x7684;&#x7CFB;&#x7EDF;&#x7248;&#x672C;&#x4E2D;&#xFF0C;token &#x7C7B;&#x578B;&#x96C6;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;; &#x6709;&#x5173;&#x6B64;&#x7C7B;&#x66F4;&#x6539;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x67E5;&#x770B;&#x53D1;&#x884C;&#x8BF4;&#x660E;&#x3002;</p>
<p>&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x6307;&#x5411; token &#x4E4B;&#x540E;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4F4D;&#x7F6E;&#xFF0C;&#x5373;&#x4ECE;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;&#x5F00;&#x59CB;&#x7684;&#x7ED3;&#x675F;&#x5B57;&#x7B26;&#x3002;</p>
<pre><code>(define s (open-input-string &quot;(a b c)&quot;))
(read-token s) \Rightarrow lparen
                   #f
                   0
                   1
(define s (open-input-string &quot;abc 123&quot;))
(read-token s) \Rightarrow atomic
                   abc
                   0
                   3
(define s (open-input-string &quot;&quot;))
(read-token s) \Rightarrow eof
                   #!eof
                   0
                   0
(define s (open-input-string &quot;#7=#7#&quot;))
(read-token s) \Rightarrow mark
                   7
                   0
                   3
(read-token s) \Rightarrow insert
                   7
                   3
                   6
</code></pre><p>read-token &#x8FD4;&#x56DE;&#x7684;&#x4FE1;&#x606F;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x8DB3;&#x4EE5;&#x91CD;&#x6784;&#x6784;&#x6210; token &#x7684;&#x7CBE;&#x786E;&#x5B57;&#x7B26;&#x5E8F;&#x5217;&#x3002;&#x4F8B;&#x5982;&#xFF0C;1.0 &#x548C; 1e0 &#x90FD;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x4E3A; atomic &#x7684;&#x503C; 1.0. &#x53EA;&#x6709;&#x901A;&#x8FC7;&#x91CD;&#x65B0;&#x5B9A;&#x4F4D;&#x7AEF;&#x53E3;&#x5E76;&#x4F7F;&#x7528;&#x901A;&#x8FC7; start &#x548C; end &#x7ED9;&#x51FA;&#x7684;&#x76F8;&#x5BF9;&#x4F4D;&#x7F6E;&#x8BFB;&#x53D6;&#x9002;&#x5F53;&#x957F;&#x5EA6;&#x7684;&#x5B57;&#x7B26;&#x5757;&#xFF0C;&#x624D;&#x80FD;&#x83B7;&#x5F97;&#x7CBE;&#x786E;&#x7684;&#x5B57;&#x7B26;&#x5E8F;&#x5217;&#x3002;</p>
<h2 id="99-&#x8F93;&#x51FA;&#x64CD;&#x4F5C;">9.9. &#x8F93;&#x51FA;&#x64CD;&#x4F5C;</h2>
<p>global parameter: <code>console-output-port</code>
libraries: (chezscheme)</p>
<p>console-output-port &#x662F;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#xFF0C;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x670D;&#x52A1;&#x5668;&#x548C;&#x4EA4;&#x4E92;&#x5F0F;&#x8C03;&#x8BD5;&#x5668;&#x4F7F;&#x7528;&#x7684;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;&#x5F53;&#x4E0D;&#x5E26;&#x53C2;&#x6570;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x5B83;&#x8FD4;&#x56DE;&#x63A7;&#x5236;&#x53F0;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;&#x5F53;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF08;&#x5FC5;&#x987B;&#x662F;&#x6587;&#x672C;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF09;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x66F4;&#x6539;&#x63A7;&#x5236;&#x53F0;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x7684;&#x503C;&#x3002;&#x6B64;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x7684;&#x521D;&#x59CB;&#x503C;&#x662F;&#x7ED1;&#x5B9A;&#x5230; Scheme &#x8FDB;&#x7A0B;&#x7684;&#x6807;&#x51C6;&#x8F93;&#x51FA;&#xFF08;stdout&#xFF09;&#x6D41;&#x7684;&#x7AEF;&#x53E3;&#x3002;</p>
<p>thread parameter: <code>current-output-port</code>
libraries: (chezscheme)</p>
<p>current-output-port &#x662F;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#xFF0C;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x5927;&#x591A;&#x6570;&#x8F93;&#x51FA;&#x8FC7;&#x7A0B;&#x7684;&#x9ED8;&#x8BA4;&#x7AEF;&#x53E3;&#x53C2;&#x6570;&#xFF0C;&#x5305;&#x62EC; write-char&#xFF0C;newline&#xFF0C;write&#xFF0C;display &#x548C; pretty-print. &#x5F53;&#x4E0D;&#x5E26;&#x53C2;&#x6570;&#x8C03;&#x7528;&#x65F6;&#xFF0C;current-output-port &#x8FD4;&#x56DE;&#x5F53;&#x524D;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;&#x5F53;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF08;&#x5FC5;&#x987B;&#x662F;&#x6587;&#x672C;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF09;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x66F4;&#x6539;&#x5F53;&#x524D;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x7684;&#x503C;&#x3002;Current-output-port &#x7684; R<sup>6</sup>RS &#x7248;&#x672C;&#x53EA;&#x63A5;&#x53D7;&#x96F6;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5373;&#x5B83;&#x4E0D;&#x80FD;&#x7528;&#x4E8E;&#x66F4;&#x6539;&#x5F53;&#x524D;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;&#x6B64;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x7684;&#x521D;&#x59CB;&#x503C;&#x4E0E; console-output-port &#x7684;&#x521D;&#x59CB;&#x503C;&#x76F8;&#x540C;&#x3002;</p>
<p>thread parameter: <code>console-error-port</code>
libraries: (chezscheme)</p>
<p>console-error-port &#x662F;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x8BBE;&#x7F6E;&#x6216;&#x83B7;&#x53D6;&#x63A7;&#x5236;&#x53F0;&#x9519;&#x8BEF;&#x7AEF;&#x53E3;&#xFF0C;&#x8BE5;&#x7AEF;&#x53E3;&#x786E;&#x5B9A;&#x9ED8;&#x8BA4;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x5C06;&#x6761;&#x4EF6;&#x548C;&#x5176;&#x4ED6;&#x6D88;&#x606F;&#x6253;&#x5370;&#x5230;&#x7684;&#x7AEF;&#x53E3;&#x3002;&#x5728;&#x4E0D;&#x5E26;&#x53C2;&#x6570;&#x8C03;&#x7528;&#x65F6;&#xFF0C;console-error-port &#x5C06;&#x8FD4;&#x56DE;&#x63A7;&#x5236;&#x53F0;&#x9519;&#x8BEF;&#x7AEF;&#x53E3;&#x3002;&#x5F53;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF08;&#x5FC5;&#x987B;&#x662F;&#x6587;&#x672C;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF09;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x66F4;&#x6539;&#x63A7;&#x5236;&#x53F0;&#x9519;&#x8BEF;&#x7AEF;&#x53E3;&#x7684;&#x503C;&#x3002;</p>
<p>&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x786E;&#x5B9A;&#x6807;&#x51C6;&#x8F93;&#x51FA;&#xFF08;stdout&#xFF09;&#x548C;&#x6807;&#x51C6;&#x9519;&#x8BEF;&#xFF08;stderr&#xFF09;&#x6D41;&#x5F15;&#x7528;&#x4E86;&#x76F8;&#x540C;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5957;&#x63A5;&#x5B57;&#xFF0C;&#x7BA1;&#x9053;&#xFF0C;&#x865A;&#x62DF;&#x7EC8;&#x7AEF;&#xFF0C;&#x8BBE;&#x5907;&#x7B49;&#xFF0C;&#x5219;&#x6B64;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x521D;&#x59CB;&#x5316;&#x4E3A;&#x4E0E; console-output-port &#x76F8;&#x540C;&#x7684;&#x503C;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x6B64;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x521D;&#x59CB;&#x5316;&#x4E3A;&#x4E0E; Scheme &#x8FDB;&#x7A0B;&#x7684;&#x6807;&#x51C6;&#x9519;&#x8BEF;&#xFF08;stderr&#xFF09;&#x6D41;&#x76F8;&#x5173;&#x8054;&#x7684;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7AEF;&#x53E3;&#x3002;</p>
<p>thread parameter: <code>current-error-port</code>
libraries: (chezscheme)</p>
<p>current-error-port &#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x7528;&#x4E8E;&#x8BBE;&#x7F6E;&#x6216;&#x83B7;&#x53D6;&#x5F53;&#x524D;&#x9519;&#x8BEF;&#x7AEF;&#x53E3;&#x7684;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x3002;&#x5F53;&#x4E0D;&#x5E26;&#x53C2;&#x6570;&#x8C03;&#x7528;&#x65F6;&#xFF0C;current-error-port &#x8FD4;&#x56DE;&#x5F53;&#x524D;&#x9519;&#x8BEF;&#x7AEF;&#x53E3;&#x3002;&#x5F53;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF08;&#x5FC5;&#x987B;&#x662F;&#x6587;&#x672C;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF09;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x66F4;&#x6539;&#x5F53;&#x524D;&#x9519;&#x8BEF;&#x7AEF;&#x53E3;&#x7684;&#x503C;&#x3002;Current-error-port &#x7684; R<sup>6</sup>RS &#x7248;&#x672C;&#x53EA;&#x63A5;&#x53D7;&#x96F6;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5373;&#x5B83;&#x4E0D;&#x80FD;&#x7528;&#x4E8E;&#x66F4;&#x6539;&#x5F53;&#x524D;&#x9519;&#x8BEF;&#x7AEF;&#x53E3;&#x3002;&#x6B64;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x7684;&#x521D;&#x59CB;&#x503C;&#x4E0E; console-error-port &#x7684;&#x521D;&#x59CB;&#x503C;&#x76F8;&#x540C;&#x3002;</p>
<p>procedure: <code>(open-output-file path)</code>
procedure: <code>(open-output-file path options)</code>
returns: &#x65B0;&#x7684;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;
libraries: (chezscheme)</p>
<p>path &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;open-output-file &#x4E3A; path &#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x6253;&#x5F00;&#x6587;&#x672C;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;</p>
<p>options&#xFF08;&#x5982;&#x679C;&#x5B58;&#x5728;&#x7684;&#x8BDD;&#xFF09;&#x662F;&#x4E00;&#x4E2A;&#x7B26;&#x53F7;&#x9009;&#x9879;&#x540D;&#x6216;&#x9009;&#x9879;&#x5217;&#x8868;&#x3002;&#x53EF;&#x80FD;&#x7684;&#x7B26;&#x53F7;&#x9009;&#x9879;&#x540D;&#x662F; error&#xFF0C;truncate&#xFF0C;replace&#xFF0C;append&#xFF0C;compressed&#xFF0C;uncompressed&#xFF0C;buffered&#xFF0C;unbuffered&#xFF0C;exclusive &#x548C; nonexclusive&#x3002;&#x9009;&#x9879;&#x5217;&#x8868;&#x662F;&#x5305;&#x542B;&#x96F6;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x7B26;&#x53F7;&#x9009;&#x9879;&#x540D;&#x4EE5;&#x53CA;&#x53EF;&#x80FD;&#x7684;&#x53CC;&#x5143;&#x7D20;&#x9009;&#x9879; <code>mode</code> <em>mode</em> &#x7684;&#x5217;&#x8868;&#x3002;</p>
<p>&#x4E92;&#x65A5;&#x7684; error&#xFF0C;truncate&#xFF0C;replace &#x548C; append &#x9009;&#x9879;&#x7528;&#x4E8E;&#x6307;&#x793A;&#x5F53;&#x8981;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#x5DF2;&#x5B58;&#x5728;&#x65F6;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x3002;</p>
<p>error:
    &#x629B;&#x51FA;&#x4E00;&#x4E2A;&#x6761;&#x4EF6;&#x7C7B;&#x578B;&#x7684;&amp;i/o-filename &#x5F02;&#x5E38;&#x3002;
replace:
    &#x5728;&#x6253;&#x5F00;&#x65B0;&#x6587;&#x4EF6;&#x4E4B;&#x524D;&#x5220;&#x9664;&#x73B0;&#x6709;&#x6587;&#x4EF6;&#x3002;
truncate:
    &#x6253;&#x5F00;&#x73B0;&#x6709;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x957F;&#x5EA6;&#x622A;&#x77ED;&#x4E3A; 0.
append:
    &#x5728;&#x6BCF;&#x6B21;&#x5199;&#x5165;&#x4E4B;&#x524D;&#x6253;&#x5F00;&#x73B0;&#x6709;&#x6587;&#x4EF6;&#x5E76;&#x5C06;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x7F6E;&#x4E8E;&#x6587;&#x4EF6;&#x672B;&#x5C3E;&#xFF0C;&#x4ECE;&#x800C;&#x59CB;&#x7EC8;&#x5C06;&#x53D1;&#x9001;&#x5230;&#x7AEF;&#x53E3;&#x7684;&#x8F93;&#x51FA;&#x9644;&#x52A0;&#x5230;&#x6587;&#x4EF6;&#x672B;&#x5C3E;&#x3002;</p>
<p>&#x9ED8;&#x8BA4;&#x884C;&#x4E3A;&#x662F;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x3002;</p>
<p>&#x4E92;&#x65A5;&#x7684; compressed &#x548C; uncompressed &#x9009;&#x9879;&#x786E;&#x5B9A;&#x662F;&#x5426;&#x8981;&#x538B;&#x7F29;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#x3002;&#x4F7F;&#x7528;&#x7531; Jean-loup Gailly &#x548C; Mark Adler &#x5F00;&#x53D1;&#x7684; zlib &#x538B;&#x7F29;&#x5E93;&#x6765;&#x6267;&#x884C;&#x538B;&#x7F29;&#x3002; &#x56E0;&#x6B64;&#x5B83;&#x4E0E; gzip &#x7A0B;&#x5E8F;&#x517C;&#x5BB9;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740; gzip &#x53EF;&#x7528;&#x4E8E;&#x89E3;&#x538B;&#x7F29;&#x7531; Chez Scheme &#x751F;&#x6210;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6587;&#x4EF6;&#x662F;&#x672A;&#x538B;&#x7F29;&#x7684;&#xFF0C;&#x56E0;&#x6B64; uncompressed &#x9009;&#x9879;&#x4EC5;&#x4F5C;&#x4E3A;&#x6587;&#x6863;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x4E92;&#x65A5;&#x7684; buffered &#x548C; unbuffered &#x9009;&#x9879;&#x786E;&#x5B9A;&#x8F93;&#x51FA;&#x662F;&#x5426;&#x88AB;&#x7F13;&#x51B2;&#x3002;&#x65E0;&#x7F13;&#x51B2;&#x8F93;&#x51FA;&#x7ACB;&#x5373;&#x53D1;&#x9001;&#x5230;&#x6587;&#x4EF6;&#xFF0C;&#x800C;&#x7F13;&#x51B2;&#x8F93;&#x51FA;&#x4E0D;&#x4F1A;&#x5199;&#x5165;&#xFF0C;&#x76F4;&#x5230;&#x7AEF;&#x53E3;&#x7684;&#x8F93;&#x51FA;&#x7F13;&#x51B2;&#x533A;&#x88AB;&#x586B;&#x6EE1;&#x6216;&#x7AEF;&#x53E3;&#x88AB;&#x5237;&#x65B0;&#xFF08;&#x901A;&#x8FC7; flush-output-port&#xFF09;&#x6216;&#x5173;&#x95ED;&#xFF08;&#x901A;&#x8FC7; flush-output-port &#x6216;&#x5728;&#x7AEF;&#x53E3;&#x4E0D;&#x518D;&#x53EF;&#x8BBF;&#x95EE;&#x65F6;&#x901A;&#x8FC7;&#x5B58;&#x50A8;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF09;&#x3002;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8F93;&#x51FA;&#x4F1A;&#x88AB;&#x7F13;&#x51B2;&#x4EE5;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF0C;&#x56E0;&#x6B64; buffered &#x9009;&#x9879;&#x4EC5;&#x4F5C;&#x4E3A;&#x6587;&#x6863;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x4E92;&#x65A5;&#x7684; exclusive &#x548C; nonexclusive &#x9009;&#x9879;&#x51B3;&#x5B9A;&#x4E86;&#x5BF9;&#x6587;&#x4EF6;&#x7684;&#x8BBF;&#x95EE;&#x662F;&#x5426;&#x662F;&#x201C;&#x72EC;&#x5360;&#x7684;&#x201D;&#x3002;&#x6307;&#x5B9A;&#x72EC;&#x5360;&#x9009;&#x9879;&#x540E;&#xFF0C;&#x6587;&#x4EF6;&#x5C06;&#x88AB;&#x9501;&#x5B9A;&#xFF0C;&#x76F4;&#x5230;&#x7AEF;&#x53E3;&#x5173;&#x95ED;&#xFF0C;&#x4EE5;&#x963B;&#x6B62;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x8BBF;&#x95EE;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x9501;&#x662F;&#x5EFA;&#x8BAE;&#x6027;&#x7684;&#xFF0C;&#x5373;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x5176;&#x5B83;&#x8FDB;&#x7A0B;&#x4E5F;&#x8BD5;&#x56FE;&#x72EC;&#x5360;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x5B83;&#x624D;&#x4F1A;&#x7981;&#x6B62;&#x5B83;&#x4EEC;&#x8BBF;&#x95EE;&#x3002;&#x975E;&#x72EC;&#x5360;&#x8BBF;&#x95EE;&#x662F;&#x9ED8;&#x8BA4;&#x9009;&#x9879;&#xFF0C;&#x56E0;&#x6B64; nonexclusive &#x9009;&#x9879;&#x4EC5;&#x4F5C;&#x4E3A;&#x6587;&#x6863;&#x6709;&#x7528;&#x3002;</p>
<p>mode &#x9009;&#x9879;&#x51B3;&#x5B9A;&#x6B64;&#x64CD;&#x4F5C;&#x521B;&#x5EFA;&#x6587;&#x4EF6;&#x65F6;&#x5728; Unix &#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x6743;&#x9650;&#x4F4D;&#xFF0C;&#x5177;&#x4F53;&#x53D6;&#x51B3;&#x4E8E;&#x8FDB;&#x7A0B; umask&#x3002;&#x9009;&#x9879;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x540E;&#x7EED;&#x5143;&#x7D20;&#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x7CBE;&#x786E;&#x7684;&#x6574;&#x6570;&#xFF0C;&#x4EE5; Unix open &#x51FD;&#x6570;&#x7684;&#x65B9;&#x5F0F;&#x6307;&#x5B9A;&#x6743;&#x9650;&#x3002;Windows &#x4E0B;&#x4F1A;&#x5FFD;&#x7565; mode &#x9009;&#x9879;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x8C03;&#x7528;</p>
<pre><code>(open-output-file &quot;frob&quot; &apos;(compressed truncate mode #o644))
</code></pre><p>&#x6253;&#x5F00;&#x6587;&#x4EF6; frob &#x5E76;&#x542F;&#x7528;&#x538B;&#x7F29;&#x3002;&#x5982;&#x679C; frob &#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x5219;&#x4F1A;&#x88AB;&#x622A;&#x77ED;&#x3002;&#x5728;&#x57FA;&#x4E8E; Unix &#x7684;&#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x5982;&#x679C; frob &#x5C1A;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x5219;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x6587;&#x4EF6;&#x4E0A;&#x7684;&#x6743;&#x9650;&#x4F4D;&#x5C06;&#x88AB;&#x8BBE;&#x7F6E;&#x4E3A;#o644 &#x548C;&#x8FDB;&#x7A0B;&#x7684; umask &#x7684;&#x903B;&#x8F91;&#x4E0E;&#x3002;</p>
<p>Open-output-file &#x7684; R<sup>6</sup>RS &#x7248;&#x672C;&#x4E0D;&#x652F;&#x6301;&#x53EF;&#x9009;&#x7684; options &#x53C2;&#x6570;&#x3002;</p>
<p>procedure: <code>(call-with-output-file path procedure)</code>
procedure: <code>(call-with-output-file path procedure options)</code>
returns: procedure &#x7684;&#x8FD4;&#x56DE;&#x503C;
libraries: (chezscheme)</p>
<p>path &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x7A0B;&#x5E8F;&#x5E94;&#x8BE5;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x3002;</p>
<p>call-with-output-file &#x4E3A; path &#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF0C;&#x5C31;&#x50CF;&#x4F7F;&#x7528; open-output-file &#x4E00;&#x6837;&#xFF0C;&#x5E76;&#x5C06;&#x6B64;&#x7AEF;&#x53E3;&#x4F20;&#x9012;&#x7ED9; procedure. &#x5982;&#x679C; procedure &#x8FD4;&#x56DE;&#xFF0C;call-with-output-file &#x5C06;&#x5173;&#x95ED;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x5E76;&#x8FD4;&#x56DE; procedure &#x8FD4;&#x56DE;&#x7684;&#x503C;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5728; procedure &#x5916;&#x90E8;&#x521B;&#x5EFA;&#x7684; continuation &#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x5219; call-with-output-file &#x4E0D;&#x4F1A;&#x81EA;&#x52A8;&#x5173;&#x95ED;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF0C;&#x56E0;&#x4E3A;&#x7A0D;&#x540E;&#x53EF;&#x80FD;&#x4F1A;&#x8C03;&#x7528;&#x5728; procedure &#x5185;&#x521B;&#x5EFA;&#x7684;&#x53E6;&#x4E00;&#x4E2A; continuation&#xFF0C;&#x5C06;&#x63A7;&#x5236;&#x6743;&#x8FD4;&#x56DE;&#x7ED9; procedure&#x3002;&#x5982;&#x679C; procedure &#x6CA1;&#x6709;&#x8FD4;&#x56DE;&#xFF0C;&#x5219;&#x53EA;&#x6709;&#x5728;&#x53EF;&#x4EE5;&#x786E;&#x8BA4;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x4E0D;&#x518D;&#x53EF;&#x8BBF;&#x95EE;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B9E;&#x73B0;&#x624D;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x5173;&#x95ED;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;&#x5982;&#x300A;Scheme &#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x300B;&#x7B2C; 4 &#x7248;&#x7B2C; 5.6 &#x8282;&#x6240;&#x793A;&#xFF0C;&#x5982;&#x679C;&#x5728; procedure &#x5916;&#x90E8;&#x521B;&#x5EFA;&#x7684; continuation &#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x5219; dynamic-wind &#x53EF;&#x7528;&#x4E8E;&#x786E;&#x4FDD;&#x7AEF;&#x53E3;&#x88AB;&#x5173;&#x95ED;&#x3002;</p>
<p>&#x6709;&#x5173;&#x53EF;&#x9009; options &#x53C2;&#x6570;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x4E0A;&#x9762;&#x7684; open-output-file.</p>
<p>Call-with-output-file &#x7684; R<sup>6</sup>RS &#x7248;&#x672C;&#x4E0D;&#x652F;&#x6301;&#x53EF;&#x9009;&#x7684; options &#x53C2;&#x6570;&#x3002;</p>
<p>procedure: <code>(with-output-to-file path thunk)</code>
procedure: <code>(with-output-to-file path thunk options)</code>
returns: thunk &#x7684;&#x8FD4;&#x56DE;&#x503C;
libraries: (chezscheme)</p>
<p>path &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;thunk &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x63A5;&#x53D7;&#x96F6;&#x4E2A;&#x53C2;&#x6570;&#x3002;</p>
<p>with-output-from-file &#x5728;&#x5E94;&#x7528; thunk &#x671F;&#x95F4;&#xFF0C;&#x6682;&#x65F6;&#x5C06;&#x5F53;&#x524D;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x91CD;&#x7ED1;&#x5B9A;&#x4E3A;&#x6253;&#x5F00; path &#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5C31;&#x50CF;&#x4F7F;&#x7528; open-output-file &#x4E00;&#x6837;&#x3002;&#x5982;&#x679C; thunk &#x8FD4;&#x56DE;&#xFF0C;&#x5219;&#x5173;&#x95ED;&#x7AEF;&#x53E3;&#x5E76;&#x5C06;&#x5F53;&#x524D;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x6062;&#x590D;&#x4E3A;&#x5176;&#x65E7;&#x503C;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5728; thunk &#x8FD4;&#x56DE;&#x4E4B;&#x524D;&#x8C03;&#x7528;&#x5728; thunk &#x4E4B;&#x5916;&#x521B;&#x5EFA;&#x7684; continuation, &#x5219; with-output-from-file &#x7684;&#x884C;&#x4E3A;&#x662F;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#x3002;&#x5B9E;&#x73B0;&#x53EF;&#x80FD;&#x4F1A;&#x5173;&#x95ED;&#x7AEF;&#x53E3;&#x5E76;&#x5C06;&#x5F53;&#x524D;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x6062;&#x590D;&#x4E3A;&#x5176;&#x65E7;&#x503C;&#x2014;&#x4F46;&#x5B83;&#x4E5F;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x8FD9;&#x4E48;&#x505A;&#x3002;</p>
<p>&#x6709;&#x5173;&#x53EF;&#x9009; options &#x53C2;&#x6570;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x4E0A;&#x9762;&#x7684; open-output-file.</p>
<p>with-output-to-file &#x7684; R<sup>6</sup>RS &#x7248;&#x672C;&#x4E0D;&#x652F;&#x6301;&#x53EF;&#x9009;&#x7684; options &#x53C2;&#x6570;&#x3002;</p>
<p>procedure: <code>(open-fd-output-port fd)</code>
procedure: <code>(open-fd-output-port fd b-mode)</code>
procedure: <code>(open-fd-output-port fd b-mode ?transcoder)</code>
&#x8FD4;&#x56DE;&#xFF1A;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26; fd &#x7684;&#x65B0;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;
libraries: (chezscheme)</p>
<p>fd &#x5FC5;&#x987B;&#x662F;&#x975E;&#x8D1F;&#x7684;&#x7CBE;&#x786E;&#x6574;&#x6570;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x662F;&#x6709;&#x6548;&#x7684;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x3002;&#x5982;&#x679C;&#x5B58;&#x5728; ?transcoder, &#x800C;&#x4E14;&#x4E0D;&#x4E3A; #f&#xFF0C;&#x5219;&#x5B83;&#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#xFF0C;&#x5E76;&#x4E14;&#x6B64;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6587;&#x672C;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF0C;&#x5176;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#x4E3A; ?transcoder. &#x5426;&#x5219;&#xFF0C;&#x6B64;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x4E8C;&#x8FDB;&#x5236;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;&#x6709;&#x5173;&#x5176;&#x4ED6;&#x53C2;&#x6570;&#x7684;&#x7EA6;&#x675F;&#x548C;&#x5F71;&#x54CD;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x8BF7;&#x53C2;&#x89C1;&#x300A;Scheme &#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x300B;&#x7B2C; 4 &#x7248;&#x7B2C; 7.2 &#x8282;&#x4E2D;&#x7684;&#x5F15;&#x8A00;&#x3002;</p>
<p>&#x5173;&#x95ED;&#x7AEF;&#x53E3;&#x65F6;&#x4F1A;&#x5173;&#x95ED;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x3002;</p>
<p>procedure: <code>(standard-output-port)</code>
procedure: <code>(standard-output-port b-mode)</code>
procedure: <code>(standard-output-port b-mode ?transcoder)</code>
&#x8FD4;&#x56DE;&#xFF1A;&#x8FDE;&#x63A5;&#x5230;&#x8FDB;&#x7A0B;&#x7684;&#x6807;&#x51C6;&#x8F93;&#x51FA;&#x7684;&#x65B0;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;
libraries: (chezscheme)</p>
<p>&#x5982;&#x679C;&#x5B58;&#x5728; ?transcoder, &#x4E14;&#x4E0D;&#x4E3A;#f&#xFF0C;&#x5219;&#x5B83;&#x5FC5;&#x987B;&#x662F;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#xFF0C;&#x5E76;&#x4E14;&#x8BE5;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6587;&#x672C;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF0C;&#x5176;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#x662F; ?transcoder. &#x5426;&#x5219;&#xFF0C;&#x6B64;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x4E8C;&#x8FDB;&#x5236;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;&#x7F13;&#x51B2;&#x6A21;&#x5F0F; b-mode &#x9ED8;&#x8BA4;&#x4E3A; line, &#x5728; Chez Scheme &#x4E2D;&#xFF0C;&#x5B83;&#x4E0E; block &#x4EC5;&#x5728;&#x9488;&#x5BF9;&#x6587;&#x672C;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x65F6;&#x6709;&#x533A;&#x522B;&#x3002;</p>
<p>&#x6B64;&#x8FC7;&#x7A0B;&#x7684; R<sup>6</sup>RS &#x7248;&#x672C;&#x4E0D;&#x63A5;&#x53D7;&#x53EF;&#x9009;&#x7684; b-mode &#x548C; ?transcoder &#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x5C06;&#x5176;&#x9650;&#x5236;&#x4E3A;&#x4F9D;&#x8D56;&#x4E8E;&#x5B9E;&#x73B0;&#x7684;&#x7F13;&#x51B2;&#x6A21;&#x5F0F;&#xFF08;Chez Scheme &#x4E2D;&#x4E3A; line&#xFF09;&#x548C;&#x4E8C;&#x8FDB;&#x5236;&#x8F93;&#x51FA;&#x3002;</p>
<p>procedure: <code>(standard-error-port)</code>
procedure: <code>(standard-error-port b-mode)</code>
procedure: <code>(standard-error-port b-mode ?transcoder)</code>
&#x8FD4;&#x56DE;&#xFF1A;&#x8FDE;&#x63A5;&#x5230;&#x8FDB;&#x7A0B;&#x7684;&#x6807;&#x51C6;&#x9519;&#x8BEF;&#x7684;&#x65B0;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;
libraries: (chezscheme)</p>
<p>&#x5982;&#x679C;&#x5B58;&#x5728; ?transcoder, &#x4E14;&#x4E0D;&#x4E3A;#f&#xFF0C;&#x5219;&#x5B83;&#x5FC5;&#x987B;&#x662F;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#xFF0C;&#x5E76;&#x4E14;&#x8BE5;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6587;&#x672C;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF0C;&#x5176;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#x662F; ?transcoder. &#x5426;&#x5219;&#xFF0C;&#x6B64;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x4E8C;&#x8FDB;&#x5236;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;&#x7F13;&#x51B2;&#x6A21;&#x5F0F; b-mode &#x9ED8;&#x8BA4;&#x4E3A; none. &#x6709;&#x5173;&#x5176;&#x4ED6;&#x53C2;&#x6570;&#x7684;&#x7EA6;&#x675F;&#x548C;&#x5F71;&#x54CD;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x8BF7;&#x53C2;&#x89C1;&#x300A;Scheme &#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x300B;&#x7B2C; 4 &#x7248;&#x7B2C; 7.2 &#x8282;&#x4E2D;&#x7684;&#x5F15;&#x8A00;&#x3002;</p>
<p>&#x6B64;&#x8FC7;&#x7A0B;&#x7684; R<sup>6</sup>RS &#x7248;&#x672C;&#x4E0D;&#x63A5;&#x53D7;&#x53EF;&#x9009;&#x7684; b-mode &#x548C; ?transcoder &#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x5C06;&#x5176;&#x9650;&#x5236;&#x4E3A;&#x4F9D;&#x8D56;&#x4E8E;&#x5B9E;&#x73B0;&#x7684;&#x7F13;&#x51B2;&#x6A21;&#x5F0F;&#xFF08;Chez Scheme &#x4E2D;&#x4E3A; none&#xFF09;&#x548C;&#x4E8C;&#x8FDB;&#x5236;&#x8F93;&#x51FA;&#x3002;</p>
<p>procedure: <code>(put-bytevector-some binary-output-port bytevector)</code>
procedure: <code>(put-bytevector-some binary-output-port bytevector start)</code>
procedure: <code>(put-bytevector-some binary-output-port bytevector start n)</code>
returns: &#x5199;&#x5165;&#x7684;&#x5B57;&#x8282;&#x6570;
libraries: (chezscheme)</p>
<p>start &#x548C; n &#x5FC5;&#x987B;&#x662F;&#x975E;&#x8D1F;&#x7684;&#x7CBE;&#x786E;&#x6574;&#x6570;&#xFF0C;start &#x548C; n &#x7684;&#x548C;&#x4E0D;&#x5F97;&#x8D85;&#x8FC7; bytevector &#x7684;&#x957F;&#x5EA6;&#x3002;&#x5982;&#x679C;&#x672A;&#x63D0;&#x4F9B;&#xFF0C;&#x5219; start &#x9ED8;&#x8BA4;&#x4E3A;&#x96F6;&#xFF0C;&#x800C; n &#x9ED8;&#x8BA4;&#x4E3A; bytevector &#x7684;&#x957F;&#x5EA6;&#x548C; start &#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x503C;&#x3002;</p>
<p>&#x6B64;&#x8FC7;&#x7A0B;&#x901A;&#x5E38;&#x5C06; bytevector &#x59CB;&#x4E8E; start &#x7684; n &#x4E2A;&#x5B57;&#x8282;&#x5199;&#x5165;&#x7AEF;&#x53E3;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x4F4D;&#x7F6E;&#x524D;&#x8FDB;&#x5230;&#x5199;&#x5165;&#x7684;&#x5B57;&#x8282;&#x672B;&#x5C3E;&#x4E4B;&#x540E;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x5982;&#x679C;&#x7AEF;&#x53E3;&#x5904;&#x4E8E;&#x975E;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#xFF08;&#x8BF7;&#x53C2;&#x9605; set-port-nonblocking!&#xFF09;&#xFF0C;&#x800C;&#x82E5;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x963B;&#x585E;&#x624D;&#x80FD;&#x5199;&#x5165;&#x66F4;&#x591A;&#x5B57;&#x8282;&#xFF0C;&#x5219;&#x5199;&#x5165;&#x7684;&#x5B57;&#x8282;&#x6570;&#x53EF;&#x80FD;&#x5C0F;&#x4E8E; n.</p>
<p>procedure: <code>(put-string-some textual-output-port string)</code>
procedure: <code>(put-string-some textual-output-port string start)</code>
procedure: <code>(put-string-some textual-output-port string start n)</code>
returns: &#x5199;&#x5165;&#x7684;&#x5B57;&#x7B26;&#x6570;
libraries: (chezscheme)</p>
<p>start &#x548C; n &#x5FC5;&#x987B;&#x662F;&#x975E;&#x8D1F;&#x7684;&#x7CBE;&#x786E;&#x6574;&#x6570;&#xFF0C;start &#x548C; n &#x7684;&#x548C;&#x4E0D;&#x5F97;&#x8D85;&#x8FC7; string &#x7684;&#x957F;&#x5EA6;&#x3002;&#x5982;&#x679C;&#x672A;&#x63D0;&#x4F9B;&#xFF0C;&#x5219; start &#x9ED8;&#x8BA4;&#x4E3A;&#x96F6;&#xFF0C;&#x800C; n &#x9ED8;&#x8BA4;&#x4E3A; string &#x7684;&#x957F;&#x5EA6;&#x548C; start &#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x503C;&#x3002;</p>
<p>&#x6B64;&#x8FC7;&#x7A0B;&#x901A;&#x5E38;&#x5C06; string &#x59CB;&#x4E8E; start &#x7684; n &#x4E2A;&#x5B57;&#x7B26;&#x5199;&#x5165;&#x7AEF;&#x53E3;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x4F4D;&#x7F6E;&#x524D;&#x8FDB;&#x5230;&#x5199;&#x5165;&#x7684;&#x5B57;&#x7B26;&#x672B;&#x5C3E;&#x4E4B;&#x540E;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x5982;&#x679C;&#x7AEF;&#x53E3;&#x5904;&#x4E8E;&#x975E;&#x963B;&#x585E;&#x6A21;&#x5F0F;&#xFF08;&#x8BF7;&#x53C2;&#x9605; set-port-nonblocking!&#xFF09;&#xFF0C;&#x800C;&#x82E5;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x963B;&#x585E;&#x624D;&#x80FD;&#x5199;&#x5165;&#x66F4;&#x591A;&#x5B57;&#x7B26;&#xFF0C;&#x5219;&#x5199;&#x5165;&#x7684;&#x5B57;&#x7B26;&#x6570;&#x53EF;&#x80FD;&#x5C0F;&#x4E8E; n.</p>
<p>procedure: <code>(display-string string)</code>
procedure: <code>(display-string string textual-output-port)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>&#x5982;&#x679C;&#x672A;&#x6307;&#x5B9A; textual-output-port&#xFF0C;display-string &#x5C06;&#x628A; string &#x4E2D;&#x5305;&#x542B;&#x7684;&#x5B57;&#x7B26;&#x5199;&#x5165; textual-output-port &#x6216;&#x5F53;&#x524D;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;&#x5C01;&#x95ED;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x5F15;&#x53F7;&#x4E0D;&#x4F1A;&#x88AB;&#x6253;&#x5370;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x8F6C;&#x4E49;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x7684;&#x7279;&#x6B8A;&#x5B57;&#x7B26;&#x3002;&#x5BF9;&#x4E8E;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x663E;&#x793A;&#xFF0C;display-string &#x662F;&#x5BF9; display &#x7684;&#x4E00;&#x4E2A;&#x66F4;&#x6709;&#x6548;&#x7684;&#x66FF;&#x4EE3;&#x3002;</p>
<p>procedure: <code>(block-write textual-output-port string)</code>
procedure: <code>(block-write textual-output-port string count)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>count &#x5FC5;&#x987B;&#x662F;&#x5C0F;&#x4E8E;&#x6216;&#x7B49;&#x4E8E; string &#x957F;&#x5EA6;&#x7684;&#x975E;&#x8D1F; fixnum. &#x5982;&#x679C;&#x672A;&#x63D0;&#x4F9B;&#xFF0C;&#x5219;&#x9ED8;&#x8BA4;&#x4E3A; string &#x7684;&#x957F;&#x5EA6;&#x3002;</p>
<p>block-write &#x5C06; string &#x7684;&#x524D; count &#x4E2A;&#x5B57;&#x7B26;&#x5199;&#x5165; textual-output-port. &#x5982;&#x679C;&#x7AEF;&#x53E3;&#x662F;&#x7F13;&#x51B2;&#x7684;&#x5E76;&#x4E14;&#x7F13;&#x51B2;&#x533A;&#x975E;&#x7A7A;&#xFF0C;&#x5219;&#x4F1A;&#x5728;&#x5199;&#x5165; string &#x7684;&#x5185;&#x5BB9;&#x4E4B;&#x524D;&#x5237;&#x65B0;&#x7F13;&#x51B2;&#x533A;&#x3002;&#x5728;&#x6240;&#x6709;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;string &#x7684;&#x5185;&#x5BB9;&#x90FD;&#x4F1A;&#x7ACB;&#x5373;&#x5199;&#x5165;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x901A;&#x8FC7;&#x7F13;&#x51B2;&#x533A;&#x3002;</p>
<p>procedure: <code>(truncate-port output-port)</code>
procedure: <code>(truncate-port output-port pos)</code>
procedure: <code>(truncate-file output-port)</code>
procedure: <code>(truncate-file output-port pos)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>truncate-port &#x548C; truncate-file &#x662F;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x3002;</p>
<p>pos &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x7CBE;&#x786E;&#x7684;&#x975E;&#x8D1F;&#x6574;&#x6570;&#x3002;&#x5B83;&#x9ED8;&#x8BA4;&#x4E3A; 0.</p>
<p>&#x8FD9;&#x4E9B;&#x8FC7;&#x7A0B;&#x5C06;&#x4E0E; output-port &#x76F8;&#x5173;&#x8054;&#x7684;&#x6587;&#x4EF6;&#x6216;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x622A;&#x77ED;&#x5230; pos &#x4F4D;&#x7F6E;&#xFF0C;&#x5E76;&#x5C06;&#x7AEF;&#x53E3;&#x91CD;&#x65B0;&#x5B9A;&#x4F4D;&#x5230;&#x8BE5;&#x4F4D;&#x7F6E;&#xFF0C;&#x5373;&#x5B83;&#x7ED3;&#x5408;&#x4E86; set-port-length! &#x548C; set-port-position! &#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x6709;&#x5728; port-has-set-port-length!? &#x548C; port-has-set-port-position!? &#x5BF9;&#x4E8E;&#x7AEF;&#x53E3;&#x90FD;&#x4E3A;&#x771F;&#x65F6;&#xFF0C;&#x624D;&#x80FD;&#x5728;&#x7AEF;&#x53E3;&#x4E0A;&#x8C03;&#x7528;&#x5B83;&#x3002;</p>
<p>procedure: <code>(fresh-line)</code>
procedure: <code>(fresh-line textual-output-port)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>&#x5982;&#x679C;&#x672A;&#x63D0;&#x4F9B; textual-output-port&#xFF0C;&#x5219;&#x9ED8;&#x8BA4;&#x4E3A;&#x5F53;&#x524D;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;</p>
<p>&#x6B64;&#x8FC7;&#x7A0B;&#x7684;&#x884C;&#x4E3A;&#x7C7B;&#x4F3C;&#x4E8E; newline, &#x5373;&#xFF0C;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x6362;&#x884C;&#x7B26;&#x5230; textual-output-port&#xFF0C;&#x9664;&#x975E;&#x5B83;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x8BE5;&#x7AEF;&#x53E3;&#x5DF2;&#x7ECF;&#x4F4D;&#x4E8E;&#x4E00;&#x884C;&#x7684;&#x5F00;&#x5934;&#x3002;&#x5B83;&#x901A;&#x8FC7;&#x5237;&#x65B0;&#x7AEF;&#x53E3;&#x5E76;&#x67E5;&#x8BE2;&#x4E0E;&#x7AEF;&#x53E3;&#x5173;&#x8054;&#x7684;&#x201C;&#x884C;&#x9996;&#x201D;&#xFF08;BOL&#xFF09;&#x6807;&#x5FD7;&#x6765;&#x5B9E;&#x73B0;&#x6B64;&#x76EE;&#x7684;&#x3002;&#xFF08;&#x53C2;&#x89C1;&#x7B2C; 220 &#x9875;&#xFF09;</p>
<h2 id="910-&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x64CD;&#x4F5C;">9.10. &#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x64CD;&#x4F5C;</h2>
<p>procedure: <code>(open-input-output-file path)</code>
procedure: <code>(open-input-output-file path options)</code>
returns: &#x65B0;&#x7684;&#x8F93;&#x5165;-&#x8F93;&#x51FA;&#x7AEF;&#x53E3;
libraries: (chezscheme)</p>
<p>path &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;open-input-output-file &#x4E3A; path &#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x672C;&#x8F93;&#x5165;-&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;</p>
<p>&#x8BE5;&#x7AEF;&#x53E3;&#x53EF;&#x7528;&#x4E8E;&#x8BFB;&#x53D6;&#x6216;&#x5199;&#x5165;&#x6307;&#x5B9A;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x5982;&#x679C;&#x6587;&#x4EF6;&#x5C1A;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x5219;&#x521B;&#x5EFA;&#x8BE5;&#x6587;&#x4EF6;&#x3002;</p>
<p>options&#xFF08;&#x5982;&#x679C;&#x5B58;&#x5728;&#x7684;&#x8BDD;&#xFF09;&#x662F;&#x4E00;&#x4E2A;&#x7B26;&#x53F7;&#x9009;&#x9879;&#x540D;&#x6216;&#x9009;&#x9879;&#x5217;&#x8868;&#x3002;&#x53EF;&#x80FD;&#x7684;&#x7B26;&#x53F7;&#x9009;&#x9879;&#x540D;&#x662F; buffered, unbuffered, exclusive, &#x548C; nonexclusive. &#x9009;&#x9879;&#x5217;&#x8868;&#x662F;&#x5305;&#x542B;&#x96F6;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x7B26;&#x53F7;&#x9009;&#x9879;&#x540D;&#x4EE5;&#x53CA;&#x53EF;&#x80FD;&#x7684;&#x53CC;&#x5143;&#x7D20;&#x9009;&#x9879; <code>mode</code> <em>mode</em> &#x7684;&#x5217;&#x8868;&#x3002;&#x6709;&#x5173;&#x8FD9;&#x4E9B;&#x9009;&#x9879;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x8BF7;&#x53C2;&#x9605; open-output-file &#x7684;&#x63CF;&#x8FF0;&#x3002;</p>
<p>&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#x901A;&#x5E38;&#x4F7F;&#x7528; close-port &#x5173;&#x95ED;&#xFF0C;&#x4F46;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; close-input-port &#x6216; close-output-port &#x5173;&#x95ED;&#x3002;</p>
<p>procedure: <code>(open-fd-input/output-port fd)</code>
procedure: <code>(open-fd-input/output-port fd b-mode)</code>
procedure: <code>(open-fd-input/output-port fd b-mode ?transcoder)</code>
returns: a new input/output port for the file descriptor fd
libraries: (chezscheme)</p>
<p>fd &#x5FC5;&#x987B;&#x662F;&#x975E;&#x8D1F;&#x7684;&#x7CBE;&#x786E;&#x6574;&#x6570;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x662F;&#x6709;&#x6548;&#x7684;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x3002;&#x5982;&#x679C;&#x5B58;&#x5728; ?transcoder, &#x800C;&#x4E14;&#x4E0D;&#x4E3A; #f&#xFF0C;&#x5219;&#x5B83;&#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#xFF0C;&#x5E76;&#x4E14;&#x6B64;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6587;&#x672C;&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF0C;&#x5176;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#x4E3A; ?transcoder. &#x5426;&#x5219;&#xFF0C;&#x6B64;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x4E8C;&#x8FDB;&#x5236;&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;&#x6709;&#x5173;&#x5176;&#x4ED6;&#x53C2;&#x6570;&#x7684;&#x7EA6;&#x675F;&#x548C;&#x5F71;&#x54CD;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x8BF7;&#x53C2;&#x89C1;&#x300A;Scheme &#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x300B;&#x7B2C; 4 &#x7248;&#x7B2C; 7.2 &#x8282;&#x4E2D;&#x7684;&#x5F15;&#x8A00;&#x3002;</p>
<p>&#x5173;&#x95ED;&#x7AEF;&#x53E3;&#x65F6;&#x4F1A;&#x5173;&#x95ED;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x3002;</p>
<h2 id="911-&#x975E;-unicode-&#x5B57;&#x8282;&#x5411;&#x91CF;&#x5B57;&#x7B26;&#x4E32;&#x8F6C;&#x6362;">9.11. &#x975E; Unicode &#x5B57;&#x8282;&#x5411;&#x91CF;/&#x5B57;&#x7B26;&#x4E32;&#x8F6C;&#x6362;</h2>
<p>&#x672C;&#x8282;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x8FC7;&#x7A0B;&#x5C06;&#x5305;&#x542B;&#x975E; Unicode &#x5B57;&#x7B26;&#x96C6;&#x4E2D;&#x7684;&#x5355;&#x5B57;&#x8282;&#x548C;&#x591A;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#x7684;&#x5B57;&#x8282;&#x5411;&#x91CF;&#x4E0E; Scheme &#x5B57;&#x7B26;&#x4E32;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#x3002;&#x5B83;&#x4EEC;&#x4EC5;&#x5728; Windows &#x4E0B;&#x53EF;&#x7528;&#x3002;&#x5728;&#x5176;&#x4ED6;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0B;&#xFF0C;&#x4EE5;&#x53CA;&#x5F53; Windows &#x4E0B;&#x6709;&#x53EF;&#x7528;&#x7684; iconv DLL &#x65F6;&#xFF0C;bytevector-&gt;string &#x548C; string-&gt;bytevector &#x53EF;&#x4EE5;&#x4E0E;&#x57FA;&#x4E8E;&#x901A;&#x8FC7; iconv-codec &#x6784;&#x9020;&#x7684;&#x7F16;&#x89E3;&#x7801;&#x5668;&#x7684;&#x7F16;&#x7801;&#x8F6C;&#x6362;&#x5668;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#xFF0C;&#x4EE5;&#x5B9E;&#x73B0;&#x76F8;&#x540C;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x63A7;&#x5236;&#x5BF9;&#x65E0;&#x6548;&#x5B57;&#x7B26;&#x548C;&#x884C;&#x5C3E;&#x7684;&#x5904;&#x7406;&#x3002;</p>
<p>procedure: <code>(multibyte-&gt;string code-page bytevector)</code>
returns: &#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5305;&#x542B;&#x7F16;&#x7801;&#x5728; bytevector &#x4E2D;&#x7684;&#x5B57;&#x7B26;
procedure: <code>(string-&gt;multibyte code-page string)</code>
returns: &#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x5411;&#x91CF;&#xFF0C;&#x5305;&#x542B; string &#x4E2D;&#x5B57;&#x7B26;&#x7684;&#x7F16;&#x7801;
libraries: (chezscheme)</p>
<p>&#x8FD9;&#x4E9B;&#x8FC7;&#x7A0B;&#x4EC5;&#x5728; Windows &#x4E0B;&#x53EF;&#x7528;&#x3002;&#x8FC7;&#x7A0B; multibyte-&gt;string &#x662F; Windows API MultiByteToWideChar &#x51FD;&#x6570;&#x7684;&#x5C01;&#x88C5;&#xFF0C;&#x800C; string-&gt;multibyte &#x662F; Windows API WideCharToMultiByte &#x51FD;&#x6570;&#x7684;&#x5C01;&#x88C5;&#x3002;</p>
<p>code-page &#x58F0;&#x660E;&#x4E86;&#x8F93;&#x5165;&#x6216;&#x8F93;&#x51FA;&#x5B57;&#x8282;&#x5411;&#x91CF;&#x4E2D;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#x7684;&#x7F16;&#x7801;&#x3002;&#x5B83;&#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x7CBE;&#x786E;&#x7684;&#x975E;&#x8D1F;&#x6574;&#x6570;&#xFF0C;&#x7528;&#x4E8E;&#x6807;&#x8BC6;&#x4EE3;&#x7801;&#x9875;&#x6216;&#x7B26;&#x53F7; cp-acp&#xFF0C;cp-maccp&#xFF0C;cp-oemcp&#xFF0C;cp-symbol&#xFF0C;cp-thread-acp&#xFF0C;cp-utf7 &#x6216; cp-utf8 &#x4E4B;&#x4E00;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0E;&#x7C7B;&#x4F3C;&#x540D;&#x79F0;&#x5E38;&#x91CF;&#x7684; API &#x51FD;&#x6570;&#x542B;&#x4E49;&#x76F8;&#x540C;&#x3002;</p>
<h2 id="912-&#x7F8E;&#x89C2;&#x6253;&#x5370;">9.12. &#x7F8E;&#x89C2;&#x6253;&#x5370;</h2>
<p>&#x7F8E;&#x89C2;&#x6253;&#x5370;&#x5668;&#x662F; write &#x8FC7;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x5F15;&#x5165;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#xFF0C;&#x5373;&#x6362;&#x884C;&#x548C;&#x7F29;&#x8FDB;&#xFF0C;&#x751F;&#x6210;&#x53EF;&#x8BFB;&#x6027;&#x66F4;&#x597D;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x7F8E;&#x89C2;&#x6253;&#x5370;&#x5668;&#x662F;&#x8BFB;-&#x5199;-&#x6253;&#x5370;&#x5FAA;&#x73AF;&#xFF08;&#x670D;&#x52A1;&#x5458;&#xFF09;&#x4F7F;&#x7528;&#x7684;&#x9ED8;&#x8BA4;&#x6253;&#x5370;&#x5668;&#xFF0C;&#x7528;&#x4E8E;&#x6253;&#x5370;&#x6BCF;&#x4E2A;&#x6C42;&#x503C;&#x5F62;&#x5F0F;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x8FC7;&#x7A0B; pretty-print &#x663E;&#x5F0F;&#x8C03;&#x7528;&#x7F8E;&#x89C2;&#x6253;&#x5370;&#x5668;&#x3002;</p>
<p>&#x7F8E;&#x89C2;&#x6253;&#x5370;&#x5668;&#x7684;&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x672C;&#x8282;&#x540E;&#x9762;&#x4ECB;&#x7ECD;&#x7684; pretty-format &#x8FC7;&#x7A0B;&#x8FDB;&#x884C;&#x63A7;&#x5236;&#xFF0C;&#x8BE5;&#x8FC7;&#x7A0B;&#x5141;&#x8BB8;&#x7A0B;&#x5E8F;&#x5458;&#x6307;&#x5B9A;&#x7279;&#x5B9A;&#x5F62;&#x5F0F;&#x7684;&#x6253;&#x5370;&#x65B9;&#x5F0F;&#xFF0C;&#x672C;&#x8282;&#x540E;&#x9762;&#x8FD8;&#x4ECB;&#x7ECD;&#x4E86;&#x591A;&#x79CD; pretty-printer &#x7684;&#x63A7;&#x5236;&#x65B9;&#x5F0F;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x901A;&#x8FC7; 9.14 &#x8282;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x901A;&#x7528;&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x63A7;&#x5236;&#x3002;</p>
<p>procedure: <code>(pretty-print obj)</code>
procedure: <code>(pretty-print obj textual-output-port)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>&#x5982;&#x679C;&#x672A;&#x63D0;&#x4F9B; textual-output-port&#xFF0C;&#x5219;&#x9ED8;&#x8BA4;&#x4E3A;&#x5F53;&#x524D;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;</p>
<p>pretty-print &#x7C7B;&#x4F3C;&#x4E8E; write&#xFF0C;&#x9664;&#x4E86;&#x5B83;&#x4F7F;&#x7528;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x7A7A;&#x683C;&#x548C;&#x6362;&#x884C;&#x7B26;&#x4EE5;&#x4FBF;&#x4EE5;&#x4E00;&#x79CD;&#x60A6;&#x76EE;&#x7684;&#x6837;&#x5F0F;&#x6253;&#x5370; obj&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x7F29;&#x8FDB;&#x663E;&#x793A;&#x5D4C;&#x5957;&#x7EA7;&#x522B;&#x3002;</p>
<pre><code>(pretty-print &apos;(define factorial (lambda (n) (let fact ((i n) (a 1))
  (if (= i 0) a (fact (- i 1) (* a i)))))))
</code></pre><p>&#x53EF;&#x4EE5;&#x751F;&#x6210;</p>
<pre><code>(define factorial
  (lambda (n)
    (let fact ([i n] [a 1])
      (if (= i 0) a (fact (- i 1) (* a i))))))
</code></pre><p>procedure: <code>(pretty-file ifn ofn)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>ifn &#x548C; ofn &#x5FC5;&#x987B;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x3002;pretty-file &#x4ECE; ifn &#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x4E2D;&#x4F9D;&#x6B21;&#x8BFB;&#x53D6;&#x5404;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x5C06;&#x8BE5;&#x5BF9;&#x8C61;&#x7F8E;&#x89C2;&#x6253;&#x5370;&#x5230;&#x7531; ofn &#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x4E2D;&#x3002;&#x8F93;&#x5165;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x6CE8;&#x91CA;&#x5C06;&#x88AB;&#x8BFB;&#x53D6;&#x5668;&#x4E22;&#x5F03;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x5728;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#x4E2D;&#x3002;&#x5982;&#x679C; ofn &#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x5DF2;&#x5B58;&#x5728;&#xFF0C;&#x5219;&#x66FF;&#x6362;&#x5B83;&#x3002;</p>
<p>procedure: <code>(pretty-format sym)</code>
returns: &#x53C2;&#x89C1;&#x4E0B;&#x6587;
procedure: <code>(pretty-format sym fmt)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7F8E;&#x89C2;&#x6253;&#x5370;&#x5668;&#x4F7F;&#x7528;&#x901A;&#x7528;&#x7B97;&#x6CD5;&#x6253;&#x5370;&#x5404;&#x4E2A;&#x5F62;&#x5F0F;&#x3002;&#x6B64;&#x8FC7;&#x7A0B;&#x7528;&#x4E8E;&#x8986;&#x76D6;&#x6B64;&#x9ED8;&#x8BA4;&#x503C;&#x5E76;&#x6307;&#x5BFC; pretty-printer &#x5BF9;&#x7279;&#x5B9A;&#x5F62;&#x5F0F;&#x7684;&#x5904;&#x7406;&#x3002;&#x7B26;&#x53F7; sym &#x547D;&#x540D;&#x4E00;&#x4E2A;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x6216;&#x8FC7;&#x7A0B;&#x3002;&#x53EA;&#x4F20;&#x5165;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x65F6;&#xFF0C;pretty-format &#x8FD4;&#x56DE;&#x4E0E; sym &#x5173;&#x8054;&#x7684;&#x5F53;&#x524D;&#x683C;&#x5F0F;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x683C;&#x5F0F;&#x4E0E; sym &#x5173;&#x8054;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;#f.</p>
<p>&#x4F20;&#x5165;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x65F6;&#xFF0C;&#x4F1A;&#x628A;&#x683C;&#x5F0F; fmt &#x4E0E; sym &#x76F8;&#x5173;&#x8054;&#xFF0C;&#x4EE5;&#x7528;&#x4E8E;&#x5C06;&#x6765;&#x5BF9;&#x7F8E;&#x89C2;&#x6253;&#x5370;&#x5668;&#x7684;&#x8C03;&#x7528;&#x3002;fmt &#x5FC5;&#x987B;&#x91C7;&#x7528;&#x4E0B;&#x9762;&#x63CF;&#x8FF0;&#x7684;&#x683C;&#x5F0F;&#x5316;&#x8BED;&#x8A00;&#x3002;</p>
<blockquote>
<p><fmt>    &#x2192; (quote symbol)</fmt></p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">var</td>
</tr>


<tr>
<td class="org-left">symbol</td>
</tr>


<tr>
<td class="org-left">(read-macro string symbol)</td>
</tr>


<tr>
<td class="org-left">(meta)</td>
</tr>


<tr>
<td class="org-left">(bracket . fmt-tail)</td>
</tr>


<tr>
<td class="org-left">(alt fmt fmt\*)</td>
</tr>


<tr>
<td class="org-left">fmt-tail</td>
</tr>
</tbody>
</table>

<p>fmt-tail    &#x2192; ()</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">(tab fmt &#x2026;)</td>
</tr>


<tr>
<td class="org-left">(fmt tab &#x2026;)</td>
</tr>


<tr>
<td class="org-left">(tab fmt . fmt-tail)</td>
</tr>


<tr>
<td class="org-left">(fmt &#x2026;)</td>
</tr>


<tr>
<td class="org-left">(fmt . fmt-tail)</td>
</tr>


<tr>
<td class="org-left">(fill tab fmt &#x2026;)</td>
</tr>
</tbody>
</table>

<p>tab    &#x2192; int</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">#f</td>
</tr>
</tbody>
</table>

</blockquote>
<p>&#x5F53;&#x5B58;&#x5728;&#x591A;&#x4E2A;&#x5907;&#x9009;&#x65B9;&#x6848;&#x65F6;&#xFF0C;&#x4E00;&#x4E9B;&#x683C;&#x5F0F;&#x5F62;&#x5F0F;&#x7528;&#x4E8E;&#x5339;&#x914D;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x683C;&#x5F0F;&#x5F62;&#x5F0F;&#x7528;&#x4E8E;&#x5339;&#x914D;&#x548C;&#x63A7;&#x5236;&#x7F29;&#x8FDB;&#x6216;&#x6253;&#x5370;&#x3002;&#x4E0B;&#x9762;&#x7ED9;&#x51FA;&#x6BCF;&#x4E2A; fmt &#x7684;&#x63CF;&#x8FF0;&#x3002;</p>
<p>(quote symbol):
    &#x53EA;&#x5339;&#x914D;&#x7B26;&#x53F7; symbol.</p>
<p>var:
    &#x5339;&#x914D;&#x4EFB;&#x610F;&#x7B26;&#x53F7;&#x3002;</p>
<p>symbol:
    &#x5339;&#x914D;&#x4EFB;&#x610F;&#x8F93;&#x5165;&#x3002;</p>
<p>(read-macro string symbol):
    &#x7528;&#x4E8E;&#x8BFB;&#x53D6;&#x5B8F;&#xFF0C;&#x5982; quote &#x548C; syntax. &#x5B83;&#x5339;&#x914D;&#x6B64;&#x5F62;&#x5F0F;&#xFF08;&#x7B26;&#x53F7;&#x5B50;&#x5F62;&#x5F0F;&#xFF09;&#x7684;&#x4EFB;&#x4F55;&#x8F93;&#x5165;&#x3002;&#x5BF9;&#x4E8E;&#x5339;&#x914D;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x7F8E;&#x89C2;&#x6253;&#x5370;&#x5668;&#x4F1A;&#x6253;&#x5370;&#x7D27;&#x8DDF;&#x7740;&#x5B50;&#x5F62;&#x5F0F;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<p>(meta):
    &#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x4E8E; meta &#x5173;&#x952E;&#x5B57;&#x7684;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#xFF08;&#x7B2C; 11.8 &#x8282;&#xFF09;&#xFF0C;&#x5B83;&#x7528;&#x4F5C;&#x53E6;&#x4E00;&#x4E2A;&#x5F62;&#x5F0F;&#x7684;&#x5173;&#x952E;&#x5B57;&#x524D;&#x7F00;&#x3002;</p>
<p>(alt fmt fmt*):
    &#x8FD9;&#x4F1A;&#x5C06;&#x8F93;&#x5165;&#x4E0E;&#x6307;&#x5B9A;&#x683C;&#x5F0F;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x6700;&#x63A5;&#x8FD1;&#x7684;&#x683C;&#x5F0F;&#x3002;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x683C;&#x5F0F;&#x4F1A;&#x5B8C;&#x5168;&#x5339;&#x914D;&#xFF0C;&#x4F46;&#x5728;&#x5176;&#x4ED6;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x8F93;&#x5165;&#x6709;&#x9519;&#x8BEF;&#x6216;&#x51FA;&#x73B0;&#x5728;&#x8BED;&#x6CD5;&#x62BD;&#x8C61;&#x6A21;&#x677F;&#x4E2D;&#x7684;&#x62BD;&#x8C61;&#x5F62;&#x5F0F;&#x4E2D;&#x65F6;&#xFF0C;&#x6CA1;&#x6709;&#x683C;&#x5F0F;&#x80FD;&#x5B8C;&#x5168;&#x5339;&#x914D;&#x3002;</p>
<p>(bracket . fmt-tail):
    &#x5339;&#x914D;&#x4EFB;&#x4F55;&#x5217;&#x8868;&#x7ED3;&#x6784;&#x7684;&#x8F93;&#x5165;&#x5E76;&#x6253;&#x5370;&#x62EC;&#x5728;&#x65B9;&#x62EC;&#x53F7;&#x4E2D;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x5373;, [ and ], &#x800C;&#x4E0D;&#x662F;&#x5706;&#x62EC;&#x53F7;&#x3002;</p>
<p>fmt-tail:
    &#x5339;&#x914D;&#x4EFB;&#x610F;&#x5217;&#x8868;&#x7ED3;&#x6784;&#x7684;&#x8F93;&#x5165;&#x3002;</p>
<p>&#x5217;&#x8868;&#x7ED3;&#x6784;&#x5F62;&#x5F0F;&#x7684;&#x7F29;&#x8FDB;&#x662F;&#x901A;&#x8FC7;&#x4E0A;&#x9762;&#x6700;&#x540E;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E2D;&#x4F7F;&#x7528;&#x7684; fmt-tail &#x8BF4;&#x660E;&#x7B26;&#x786E;&#x5B9A;&#x7684;&#x3002;&#x4E0B;&#x9762;&#x7ED9;&#x51FA;&#x6BCF;&#x4E2A; fmt-tail &#x7684;&#x63CF;&#x8FF0;&#x3002;</p>
<p>():
    &#x5339;&#x914D;&#x7A7A;&#x5217;&#x8868;&#x5C3E;&#x90E8;&#x3002;</p>
<p>(tab fmt &#x2026;):
    This matches the tail of any proper list; if the tail is nonempty and the list does not fit entirely on the current line, a line break is inserted before the first subform of the tail and tab (&#x53C2;&#x89C1;&#x4E0B;&#x6587;) determines the amount by which this and all subsequent subforms are indented.</p>
<p>(fmt tab &#x2026;):
    &#x5339;&#x914D;&#x4EFB;&#x610F;&#x5B8C;&#x5168;&#x5217;&#x8868;&#x7684;&#x5C3E;&#x90E8;; &#x5982;&#x679C;&#x5C3E;&#x90E8;&#x4E0D;&#x4E3A;&#x7A7A;&#x5E76;&#x4E14;&#x5217;&#x8868;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x653E;&#x5165;&#x5F53;&#x524D;&#x884C;&#xFF0C;&#x5219;&#x5728;&#x5C3E;&#x90E8;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5B50;&#x5F62;&#x5F0F;&#x4E4B;&#x540E;&#x63D2;&#x5165;&#x4E00;&#x4E2A;&#x6362;&#x884C;&#x7B26;&#xFF0C;&#x800C;&#x6240;&#x6709;&#x540E;&#x7EED;&#x5B50;&#x5F62;&#x5F0F;&#x7684;&#x7F29;&#x8FDB;&#x91CF;&#x7531; tab&#xFF08;&#x53C2;&#x89C1;&#x4E0B;&#x6587;&#xFF09;&#x51B3;&#x5B9A;&#x3002;</p>
<p>(tab fmt . fmt-tail):
    &#x5982;&#x679C;&#x5C3E;&#x90E8;&#x7684;&#x5C3E;&#x90E8;&#x5339;&#x914D; fmt-tail, &#x5219;&#x6B64;&#x5F62;&#x5F0F;&#x5339;&#x914D;&#x4E00;&#x4E2A;&#x975E;&#x7A7A;&#x5C3E;&#x90E8;&#x3002;&#x5982;&#x679C;&#x5217;&#x8868;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x653E;&#x5165;&#x5F53;&#x524D;&#x884C;&#xFF0C;&#x5219;&#x5728;&#x5C3E;&#x90E8;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5B50;&#x5F62;&#x5F0F;&#x4E4B;&#x524D;&#x63D2;&#x5165;&#x4E00;&#x4E2A;&#x6362;&#x884C;&#x7B26;&#xFF0C;&#x800C;&#x5B50;&#x5F62;&#x5F0F;&#x7684;&#x7F29;&#x8FDB;&#x91CF;&#x7531; tab&#xFF08;&#x53C2;&#x89C1;&#x4E0B;&#x6587;&#xFF09;&#x51B3;&#x5B9A;&#x3002;</p>
<p>(fmt &#x2026;):
    &#x5339;&#x914D;&#x4EFB;&#x610F;&#x5B8C;&#x5168;&#x5217;&#x8868;&#x7684;&#x5C3E;&#x90E8;&#xFF0C;&#x5E76;&#x6307;&#x5B9A;&#xFF0C;&#x5728;&#x5F53;&#x524D;&#x6216;&#x540E;&#x7EED;&#x7684;&#x5B50;&#x5F62;&#x5F0F;&#x4E4B;&#x524D;&#x6216;&#x4E4B;&#x540E;&#x4E0D;&#x63D2;&#x5165;&#x4EFB;&#x4F55;&#x6362;&#x884C;&#x7B26;&#x3002;</p>
<p>(fmt . fmt-tail):
    &#x5982;&#x679C;&#x5C3E;&#x90E8;&#x7684;&#x5C3E;&#x90E8;&#x5339;&#x914D; fmt-tail, &#x5219;&#x6B64;&#x5F62;&#x5F0F;&#x5339;&#x914D;&#x4E00;&#x4E2A;&#x975E;&#x7A7A;&#x5C3E;&#x90E8;&#xFF0C;&#x5E76;&#x6307;&#x5B9A;&#xFF0C;&#x5728;&#x5F53;&#x524D;&#x5B50;&#x5F62;&#x5F0F;&#x4E4B;&#x524D;&#x6216;&#x4E4B;&#x540E;&#x4E0D;&#x63D2;&#x5165;&#x4EFB;&#x4F55;&#x6362;&#x884C;&#x7B26;&#x3002;</p>
<p>(fill tab fmt &#x2026;):
    &#x5339;&#x914D;&#x4EFB;&#x610F;&#x5B8C;&#x5168;&#x5217;&#x8868;&#x7684;&#x5C3E;&#x90E8;&#xFF0C;&#x5E76;&#x8C03;&#x7528;&#x586B;&#x5145;&#x6A21;&#x5F0F;&#xFF0C;&#x5728;&#x6B64;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x6BCF;&#x884C;&#x4F1A;&#x586B;&#x5165;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>tab &#x51B3;&#x5B9A;&#x5217;&#x8868;&#x5B50;&#x5F62;&#x5F0F;&#x7684;&#x7F29;&#x8FDB;&#x91CF;&#x3002;&#x5982;&#x679C; tab &#x662F;&#x975E;&#x8D1F;&#x7684;&#x7CBE;&#x786E;&#x6574;&#x6570; int&#xFF0C;&#x5219;&#x5B50;&#x5F62;&#x5F0F;&#x4ECE;&#x7236;&#x5F62;&#x5F0F;&#x7684;&#x5DE6;&#x5706;&#x62EC;&#x53F7;&#x6216;&#x5DE6;&#x65B9;&#x62EC;&#x53F7;&#x4E4B;&#x540E;&#x7684;&#x5B57;&#x7B26;&#x4F4D;&#x7F6E;&#x7F29;&#x8FDB; int &#x4E2A;&#x7A7A;&#x683C;&#x3002;&#x5982;&#x679C; tab &#x662F;#f&#xFF0C;&#x5219;&#x4F7F;&#x7528;&#x6807;&#x51C6;&#x7F29;&#x8FDB;&#x3002;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x53C2;&#x6570;&#x5BF9;&#x8C61; pretty-standard-indent &#x786E;&#x5B9A;&#x6216;&#x66F4;&#x6539;&#x6807;&#x51C6;&#x7F29;&#x8FDB;&#xFF0C;&#x672C;&#x8282;&#x7A0D;&#x540E;&#x5C06;&#x5BF9;&#x6B64;&#x8FDB;&#x884C;&#x4ECB;&#x7ECD;&#x3002;</p>
<p>&#x5982;&#x679C;&#x7ED9;&#x51FA;&#x7684;&#x683C;&#x5F0F;&#x4E0D;&#x5B8C;&#x5168;&#x5339;&#x914D;&#xFF0C;&#x90A3;&#x4E48;&#x7F8E;&#x89C2;&#x6253;&#x5370;&#x5668;&#x4F1A;&#x5C1D;&#x8BD5;&#x5C3D;&#x53EF;&#x80FD;&#x4F7F;&#x7528;&#x7ED9;&#x5B9A;&#x7684;&#x683C;&#x5F0F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x683C;&#x5F0F;&#x4E0E;&#x5177;&#x6709;&#x7279;&#x5B9A;&#x6570;&#x91CF;&#x5B50;&#x5F62;&#x5F0F;&#x7684;&#x5217;&#x8868;&#x7ED3;&#x6784;&#x5F62;&#x5F0F;&#x5339;&#x914D;&#xFF0C;&#x4F46;&#x662F;&#x7ED9;&#x51FA;&#x7684;&#x5B50;&#x5F62;&#x5F0F;&#x504F;&#x591A;&#x6216;&#x504F;&#x5C11;&#xFF0C;&#x5219;&#x7F8E;&#x89C2;&#x6253;&#x5370;&#x5668;&#x5C06;&#x6839;&#x636E;&#x9700;&#x8981;&#x4E22;&#x5F03;&#x6216;&#x590D;&#x5236;&#x5B50;&#x5F62;&#x5F0F;&#x683C;&#x5F0F;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#xFF0C;&#x663E;&#x793A; let &#x7684;&#x683C;&#x5F0F;&#x53EF;&#x80FD;&#x5DF2;&#x6307;&#x5B9A;&#x3002;</p>
<pre><code>(pretty-format &apos;let
  &apos;(alt (let ([bracket var x] 0 ...) #f e #f e ...)
        (let var ([bracket var x] 0 ...) #f e #f e ...)))
</code></pre><p>&#x7531;&#x4E8E; let &#x6709;&#x4E24;&#x79CD;&#x5F62;&#x5F0F;&#xFF0C;&#x547D;&#x540D;&#x7684;&#x548C;&#x672A;&#x547D;&#x540D;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x6307;&#x5B9A;&#x4E86;&#x4E24;&#x79CD;&#x5907;&#x9009;&#x5F62;&#x5F0F;&#x3002;&#x5728;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C; <code>bracket</code> <em>fmt</em> &#x7528;&#x4E8E;&#x5C06;&#x7ED1;&#x5B9A;&#x5C01;&#x88C5;&#x5728;&#x65B9;&#x62EC;&#x53F7;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x884C;&#x4E2D;&#x653E;&#x4E0D;&#x4E0B;&#x6240;&#x6709;&#x7ED1;&#x5B9A;&#xFF0C;&#x5219;&#x5176;&#x4E2D;&#x7B2C;&#x4E00;&#x4E2A;&#x7ED1;&#x5B9A;&#x4E4B;&#x540E;&#x7684;&#x6240;&#x6709;&#x7ED1;&#x5B9A;&#x663E;&#x793A;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x7ED1;&#x5B9A;&#x7684;&#x6B63;&#x4E0B;&#x65B9;&#xFF08;&#x4E14;&#x7D27;&#x8DDF;&#x5728;&#x5916;&#x56F4;&#x7684;&#x5706;&#x62EC;&#x53F7;&#x4E4B;&#x540E;&#xFF09;&#x3002;&#x6BCF;&#x4E2A; body &#x5F62;&#x5F0F;&#x4EE5;&#x6807;&#x51C6;&#x7F29;&#x8FDB;&#x7F29;&#x8FDB;&#x3002;</p>
<p>thread parameter: <code>pretty-line-length</code>
thread parameter: <code>pretty-one-line-limit</code>
libraries: (chezscheme)</p>
<p>&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x7684;&#x503C;&#x90FD;&#x5FC5;&#x987B;&#x662F;&#x6B63;&#x7684; fixnum.</p>
<p>&#x53C2;&#x6570;&#x5BF9;&#x8C61; pretty-line-length &#x548C; pretty-one-line-limit &#x63A7;&#x5236; pretty-print &#x4EA7;&#x751F;&#x7684;&#x8F93;&#x51FA;&#x3002;pretty-line-length &#x51B3;&#x5B9A;&#x7F8E;&#x89C2;&#x6253;&#x5370;&#x5668;&#x4F1A;&#x5728;&#x4E00;&#x884C;&#x4E2D;&#x7684;&#x54EA;&#x4E2A;&#x5B57;&#x7B26;&#x4F4D;&#x7F6E;&#xFF08;&#x4ECE;&#x7B2C;&#x4E00;&#x4E2A;&#x5F00;&#x59CB;&#xFF09;&#x4E4B;&#x540E;&#x5C1D;&#x8BD5;&#x622A;&#x65AD;&#x8F93;&#x51FA;&#x3002;&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x8F6F;&#x9650;&#x5236;&#xFF1B;&#x5982;&#x679C;&#x6709;&#x5FC5;&#x8981;&#xFF0C;pretty-printer &#x4F1A;&#x8D85;&#x51FA; pretty-line-length &#x7684;&#x9650;&#x5236;&#x3002;</p>
<p>pretty-one-line-limit &#x7C7B;&#x4F3C;&#x4E8E; pretty-line-length, &#x53EA;&#x662F;&#x5B83;&#x662F;&#x76F8;&#x5BF9;&#x4E8E;&#x8F93;&#x51FA;&#x4E2D;&#x6BCF;&#x884C;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x975E;&#x7A7A;&#x767D;&#x4F4D;&#x7F6E;&#x8BA1;&#x7B97;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x8F6F;&#x9650;&#x5236;&#x3002;</p>
<p>thread parameter: <code>pretty-initial-indent</code>
libraries: (chezscheme)</p>
<p>&#x6B64;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x7684;&#x503C;&#x5FC5;&#x987B;&#x662F;&#x975E;&#x8D1F; fixnum.</p>
<p>&#x53C2;&#x6570;&#x5BF9;&#x8C61; pretty-initial-indent &#x7528;&#x4E8E;&#x6307;&#x793A; pretty-print &#x5728;&#x8F93;&#x51FA;&#x884C;&#x4E0A;&#x8C03;&#x7528;&#x5B83;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x5982;&#x679C; pretty-initial-indent &#x4E3A;&#x96F6;&#xFF08;&#x9ED8;&#x8BA4;&#x503C;&#xFF09;&#xFF0C;&#x5219; pretty-print &#x5047;&#x5B9A;&#x5B83;&#x4EA7;&#x751F;&#x7684;&#x7B2C;&#x4E00;&#x884C;&#x8F93;&#x51FA;&#x5C06;&#x4ECE;&#x884C;&#x7684;&#x5F00;&#x5934;&#x5F00;&#x59CB;&#x3002;&#x5982;&#x679C;&#x8BBE;&#x7F6E;&#x4E3A;&#x975E;&#x96F6;&#x503C; n&#xFF0C;&#x5219; pretty-print &#x5047;&#x5B9A;&#x7B2C;&#x4E00;&#x884C;&#x5C06;&#x51FA;&#x73B0;&#x5728;&#x5B57;&#x7B26;&#x4F4D;&#x7F6E; n&#xFF0C;&#x5E76;&#x5C06;&#x8C03;&#x6574;&#x5176;&#x540E;&#x7EED;&#x884C;&#x7684;&#x6253;&#x5370;&#x3002;</p>
<p>thread parameter: <code>pretty-standard-indent</code>
libraries: (chezscheme)</p>
<p>&#x6B64;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x7684;&#x503C;&#x5FC5;&#x987B;&#x662F;&#x975E;&#x8D1F; fixnum.</p>
<p>&#x5B83;&#x51B3;&#x5B9A; pretty-print &#x5BF9;&#x5927;&#x591A;&#x6570;&#x5F62;&#x5F0F;&#xFF08;&#x6BD4;&#x5982; let &#x8868;&#x8FBE;&#x5F0F;&#xFF09;&#x7684;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4ECE;&#x5F62;&#x5F0F;&#x7684;&#x5173;&#x952E;&#x5B57;&#x6216;&#x7B2C;&#x4E00;&#x4E2A;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#x5F00;&#x59CB;&#x7684;&#x7F29;&#x8FDB;&#x91CF;&#x3002;</p>
<p>thread parameter: <code>pretty-maximum-lines</code>
libraries: (chezscheme)</p>
<p>&#x53C2;&#x6570;&#x5BF9;&#x8C61; pretty-maximum-lines &#x63A7;&#x5236; pretty-print &#x88AB;&#x8C03;&#x7528;&#x65F6;&#x5176;&#x6253;&#x5370;&#x7684;&#x884C;&#x6570;&#x3002;&#x5982;&#x679C;&#x8BBE;&#x7F6E;&#x4E3A;#f&#xFF08;&#x9ED8;&#x8BA4;&#x503C;&#xFF09;&#xFF0C;&#x5219;&#x4E0D;&#x65BD;&#x52A0;&#x9650;&#x5236;; &#x5982;&#x679C;&#x8BBE;&#x7F6E;&#x4E3A;&#x975E;&#x8D1F;&#x7684; fixnum n, &#x5219;&#x6700;&#x591A;&#x6253;&#x5370; n &#x884C;&#x3002;</p>
<h2 id="913-&#x683C;&#x5F0F;&#x5316;&#x8F93;&#x51FA;">9.13. &#x683C;&#x5F0F;&#x5316;&#x8F93;&#x51FA;</h2>
<p>procedure: <code>(format format-string obj ...)</code>
procedure: <code>(format #f format-string obj ...)</code>
procedure: <code>(format #t format-string obj ...)</code>
procedure: <code>(format textual-output-port format-string obj ...)</code>
returns: &#x53C2;&#x89C1;&#x4E0B;&#x6587;
libraries: (chezscheme)</p>
<p>When the first argument to format is a string or #f (first and second forms above), format constructs an output string from format-string and the objects obj &#x2026;. Characters are copied from format-string to the output string from left to right, until format-string is exhausted. The format string may contain one or more format directives, which are multi-character sequences prefixed by a tilde ( ~ ). Each directive is replaced by some other text, often involving one or more of the obj &#x2026; arguments, as determined by the semantics of the directive.
&#x5F53; format &#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x6216;#f&#xFF08;&#x4E0A;&#x9762;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x548C;&#x7B2C;&#x4E8C;&#x4E2A;&#x5F62;&#x5F0F;&#xFF09;&#x65F6;&#xFF0C;format &#x4EE5; format-string &#x548C;&#x5BF9;&#x8C61; obj&#x2026; &#x6784;&#x9020;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x5B57;&#x7B26;&#x4ECE; format-string &#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x590D;&#x5236;&#x5230;&#x8F93;&#x51FA;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x76F4;&#x5230;&#x8BFB;&#x5B8C; format-string. &#x683C;&#x5F0F;&#x5B57;&#x7B26;&#x4E32;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x683C;&#x5F0F;&#x6307;&#x4EE4;&#xFF0C;&#x8FD9;&#x4E9B;&#x6307;&#x4EE4;&#x662F;&#x4EE5;&#x6CE2;&#x6D6A;&#x53F7;&#xFF08;~&#xFF09;&#x4E3A;&#x524D;&#x7F00;&#x7684;&#x591A;&#x5B57;&#x7B26;&#x5E8F;&#x5217;&#x3002;&#x6BCF;&#x4E2A;&#x6307;&#x4EE4;&#x90FD;&#x88AB;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x6587;&#x672C;&#x66FF;&#x6362;&#xFF0C;&#x901A;&#x5E38;&#x6D89;&#x53CA;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A; obj &#x2026;&#x53C2;&#x6570;&#xFF0C;&#x5177;&#x4F53;&#x7531;&#x6307;&#x4EE4;&#x7684;&#x8BED;&#x4E49;&#x51B3;&#x5B9A;&#x3002;</p>
<p>When the first argument is #t, output is sent to the current output port instead, as with printf. When the first argument is a port, output is sent to that port, as with fprintf. printf and fprintf are described later in this section.
&#x5F53;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;#t &#x65F6;&#xFF0C;&#x8F93;&#x51FA;&#x5C06;&#x88AB;&#x53D1;&#x9001;&#x5230;&#x5F53;&#x524D;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF0C;&#x548C;&#x4F7F;&#x7528; printf &#x4E00;&#x6837;&#x3002;&#x5F53;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x7AEF;&#x53E3;&#x65F6;&#xFF0C;&#x8F93;&#x51FA;&#x5C06;&#x53D1;&#x9001;&#x5230;&#x8BE5;&#x7AEF;&#x53E3;&#xFF0C;&#x548C;&#x4F7F;&#x7528; fprintf &#x4E00;&#x6837;&#x3002;printf &#x548C; fprintf &#x5C06;&#x5728;&#x672C;&#x8282;&#x540E;&#x9762;&#x4ECB;&#x7ECD;&#x3002;</p>
<p>Chez Scheme&apos;s implementation of format supports all of the Common Lisp [30] format directives except for those specific to the Common Lisp pretty printer. Please consult a Common Lisp reference or the Common Lisp Hyperspec, for complete documentation. A few of the most useful directives are described below.
format &#x7684; Chez Scheme &#x5B9E;&#x73B0;&#x652F;&#x6301;&#x6240;&#x6709; Common Lisp [30]&#x683C;&#x5F0F;&#x6307;&#x4EE4;&#xFF0C;&#x9664;&#x4E86;&#x90A3;&#x4E9B;&#x4E13;&#x7528;&#x4E8E; Common Lisp &#x7F8E;&#x89C2;&#x6253;&#x5370;&#x5668;&#x7684;&#x6307;&#x4EE4;&#x3002;&#x5B8C;&#x6574;&#x6587;&#x6863;&#x8BF7;&#x53C2;&#x9605; Common Lisp &#x53C2;&#x8003;&#x6216; Common Lisp Hyperspec. &#x4E0B;&#x9762;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x4E9B;&#x6700;&#x6709;&#x7528;&#x7684;&#x6307;&#x4EE4;&#x3002;</p>
<p>Absent any format directives, format simply displays its string argument.
&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x683C;&#x5F0F;&#x6307;&#x4EE4;&#xFF0C;format &#x4FBF;&#x76F4;&#x63A5;&#x663E;&#x793A;&#x5176;&#x5B57;&#x7B26;&#x4E32;&#x53C2;&#x6570;&#x3002;</p>
<pre><code>(format &quot;hi there&quot;) \Rightarrow &quot;hi there&quot;
</code></pre><p>The ~s directive is replaced by the printed representation of the next obj, which may be any object, in machine-readable format, as with write.
~s &#x6307;&#x4EE4;&#x7531;&#x4E0B;&#x4E00;&#x4E2A; obj &#x7684;&#x673A;&#x5668;&#x53EF;&#x8BFB;&#x683C;&#x5F0F;&#x7684;&#x6253;&#x5370;&#x5F62;&#x5F0F;&#x66FF;&#x6362;&#xFF0C;&#x548C;&#x4F7F;&#x7528; write &#x4E00;&#x6837;&#xFF0C;obj &#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#x3002;</p>
<pre><code>(format &quot;hi ~s&quot; &apos;mom) \Rightarrow &quot;hi mom&quot;
(format &quot;hi ~s&quot; &quot;mom&quot;) \Rightarrow &quot;hi \&quot;mom\&quot;&quot;
(format &quot;hi ~s~s&quot; &apos;mom #\!) \Rightarrow &quot;hi mom#\\!&quot;
</code></pre><p>The general form of a <code>s directive is actually ~mincol,colinc,minpad,padchars, and the s can be preceded by an at sign ( @ ) modifier. These additional parameters are used to control padding in the output, with at least minpad copies of padchar plus an integer multiple of colinc copies of padchar to make the total width, including the written object, mincol characters wide. The padding is placed on the left if the @ modifier is present, otherwise on the right. mincol and minpad default to 0, colinc defaults to 1, and padchar defaults to space. If specified, padchar is prefixed by a single quote mark.
~~s</code> &#x6307;&#x4EE4;&#x7684;&#x4E00;&#x822C;&#x5F62;&#x5F0F;&#x5B9E;&#x9645;&#x4E0A;&#x662F; <em>~mincol</em>, <em>colinc</em>, <em>minpad</em>, <em>padchars</em>, s &#x4E4B;&#x524D;&#x53EF;&#x4EE5;&#x6709;&#x4E00;&#x4E2A; at &#x7B26;&#x53F7;&#xFF08;@&#xFF09;&#x4FEE;&#x9970;&#x7B26;&#x3002;&#x8FD9;&#x4E9B;&#x9644;&#x52A0;&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x63A7;&#x5236;&#x8F93;&#x51FA;&#x4E2D;&#x7684;&#x586B;&#x5145;&#xFF0C;&#x4EE5;&#x81F3;&#x5C11; minpad &#x4E2A; padchar &#x7684;&#x62F7;&#x8D1D;&#x52A0;&#x4E0A; colinc &#x4E2A; padchar &#x7684;&#x62F7;&#x8D1D;&#x7684;&#x6574;&#x6570;&#x500D;&#x6765;&#x6784;&#x6210;&#x603B;&#x5BBD;&#x5EA6;&#xFF0C;&#x5305;&#x62EC;&#x5199;&#x5165;&#x5BF9;&#x8C61;&#xFF0C;&#x5BBD;&#x4E3A; mincol &#x4E2A;&#x5B57;&#x7B26;&#x3002;&#x5982;&#x679C;&#x5B58;&#x5728;@&#x4FEE;&#x9970;&#x7B26;&#xFF0C;&#x5219;&#x586B;&#x5145;&#x4F4D;&#x4E8E;&#x5DE6;&#x4FA7;&#xFF0C;&#x5426;&#x5219;&#x4F4D;&#x4E8E;&#x53F3;&#x4FA7;&#x3002;mincol &#x548C; minpad &#x9ED8;&#x8BA4;&#x4E3A; 0&#xFF0C;colinc &#x9ED8;&#x8BA4;&#x4E3A; 1&#xFF0C;padchar &#x9ED8;&#x8BA4;&#x4E3A;&#x7A7A;&#x683C;&#x3002;&#x6307;&#x5B9A; padchar &#x65F6;&#xFF0C;&#x5B83;&#x4EE5;&#x5355;&#x5F15;&#x53F7;&#x4F5C;&#x4E3A;&#x524D;&#x7F00;&#x3002;</p>
<pre><code>(format &quot;~10s&quot; &apos;hello) \Rightarrow &quot;hello     &quot;
(format &quot;~10@s&quot; &apos;hello) \Rightarrow &quot;     hello&quot;
(format &quot;~10,,,&apos;*@s&quot; &apos;hello) \Rightarrow &quot;*****hello&quot;
</code></pre><p>The ~a directive is similar, but prints the object as with display.
~a &#x6307;&#x4EE4;&#x7C7B;&#x4F3C;&#xFF0C;&#x4F46;&#x4EE5; display &#x7684;&#x65B9;&#x5F0F;&#x6253;&#x5370;&#x5BF9;&#x8C61;&#x3002;</p>
<pre><code>(format &quot;hi ~s~s&quot; &quot;mom&quot; #\!) \Rightarrow &quot;hi \&quot;mom\&quot;#\\!&quot;
(format &quot;hi ~a~a&quot; &quot;mom&quot; #\!) \Rightarrow &quot;hi mom!&quot;
</code></pre><p>A tilde may be inserted into the output with <del>, and a newline may be inserted with ~% (or embedded in the string with \n).
&#x53EF;&#x4EE5;&#x4F7F;&#x7528;</del>&#x5C06;&#x6CE2;&#x6D6A;&#x53F7;&#x63D2;&#x5165;&#x5230;&#x8F93;&#x51FA;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;~%&#x63D2;&#x5165;&#x6362;&#x884C;&#x7B26;&#xFF08;&#x6216;&#x8005;&#x4F7F;&#x7528;\n &#x5D4C;&#x5165;&#x5230;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#xFF09;&#x3002;</p>
<pre><code>(format &quot;~~line one,~%line two.~~&quot;) \Rightarrow &quot;~line one,\nline two.~&quot;
(format &quot;~~line one,\nline two.~~&quot;) \Rightarrow &quot;~line one,\nline two.~&quot;
</code></pre><p>Real numbers may be printed in floating-point notation with ~f.
&#x5B9E;&#x6570;&#x53EF;&#x4EE5;&#x7528;~f &#x4EE5;&#x6D6E;&#x70B9;&#x8868;&#x793A;&#x6CD5;&#x6253;&#x5370;&#x3002;</p>
<pre><code>(format &quot;~f&quot; 3.14159) \Rightarrow 3.14159
</code></pre><p>Exact numbers may printed as well as inexact numbers in this manner; they are simply converted to inexact first as if with exact-&gt;inexact.
&#x548C;&#x4E0D;&#x7CBE;&#x786E;&#x6570;&#x4E00;&#x6837;&#xFF0C;&#x7CBE;&#x786E;&#x6570;&#x4E5F;&#x53EF;&#x4EE5;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6253;&#x5370;&#xFF1B;&#x5B83;&#x4EEC;&#x4F1A;&#x5148;&#x8F6C;&#x6362;&#x4E3A;&#x4E0D;&#x7CBE;&#x786E;&#x6570;&#xFF0C;&#x5C31;&#x5982;&#x540C;&#x4F7F;&#x7528; exact-&gt;inexact.</p>
<pre><code>(format &quot;~f&quot; 1/3) \Rightarrow &quot;0.3333333333333333&quot;
</code></pre><p>The general form is actually ~w,d,k,overflowchar,padcharf. If specified, w determines the overall width of the output, and d the number of digits to the right of the decimal point. padchar, which defaults to space, is the pad character used if padding is needed. Padding is always inserted on the left. The number is scaled by 10k when printed; k defaults to zero. The entire w-character field is filled with copies of overflowchar if overflowchar is specified and the number cannot be printed in w characters. k defaults to 1 If an @ modifier is present, a plus sign is printed before the number for nonnegative inputs; otherwise, a sign is printed only if the number is negative.
&#x4E00;&#x822C;&#x5F62;&#x5F0F;&#x5B9E;&#x9645;&#x4E0A;&#x662F; ~w,d,k,overflowchar,padcharf. &#x5982;&#x679C;&#x6307;&#x5B9A;&#xFF0C;w &#x786E;&#x5B9A;&#x8F93;&#x51FA;&#x7684;&#x603B;&#x5BBD;&#x5EA6;&#xFF0C;d &#x786E;&#x5B9A;&#x5C0F;&#x6570;&#x70B9;&#x53F3;&#x8FB9;&#x7684;&#x4F4D;&#x6570;&#x3002;padchar, &#x9ED8;&#x8BA4;&#x4E3A; space&#xFF0C;&#x662F;&#x9700;&#x8981;&#x586B;&#x5145;&#x65F6;&#x4F7F;&#x7528;&#x7684;&#x586B;&#x5145;&#x5B57;&#x7B26;&#x3002;&#x586B;&#x5145;&#x59CB;&#x7EC8;&#x63D2;&#x5165;&#x5230;&#x5DE6;&#x4FA7;&#x3002;&#x6253;&#x5370;&#x65F6;&#xFF0C;&#x6570;&#x5B57;&#x6309; 10<sup>k</sup> &#x7F29;&#x653E;; k &#x9ED8;&#x8BA4;&#x4E3A;&#x96F6;&#x3002;&#x5982;&#x679C;&#x6307;&#x5B9A;&#x4E86; overflowchar, &#x4E14;&#x8BE5;&#x6570;&#x5B57;&#x65E0;&#x6CD5;&#x4EE5; w &#x4E2A;&#x5B57;&#x7B26;&#x6253;&#x5370;&#xFF0C;&#x5219;&#x6574;&#x4E2A; w &#x5B57;&#x7B26;&#x5B57;&#x6BB5;&#x5C06;&#x4EE5; overflowchar &#x7684;&#x62F7;&#x8D1D;&#x586B;&#x5145;&#x3002;&#x5982;&#x679C;&#x5B58;&#x5728;@&#x4FEE;&#x9970;&#x7B26;&#xFF0C;&#x5219; k &#x9ED8;&#x8BA4;&#x4E3A; 1, &#x5728;&#x8F93;&#x5165;&#x7684;&#x975E;&#x8D1F;&#x6570;&#x5B57;&#x4E4B;&#x524D;&#x6253;&#x5370;&#x52A0;&#x53F7;; &#x5426;&#x5219;&#xFF0C;&#x4EC5;&#x5728;&#x6570;&#x5B57;&#x4E3A;&#x8D1F;&#x65F6;&#x624D;&#x6253;&#x5370;&#x7B26;&#x53F7;&#x3002;</p>
<pre><code>(format &quot;~,3f&quot; 3.14159) \Rightarrow &quot;3.142&quot;
(format &quot;~10f&quot; 3.14159) \Rightarrow &quot;   3.14159&quot;
(format &quot;~10,,,&apos;#f&quot; 1e20) \Rightarrow &quot;##########&quot;
</code></pre><p>Real numbers may also be printed with ~e for scientific notation or with ~g, which uses either floating-point or scientific notation based on the size of the input.
&#x5B9E;&#x6570;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;~e &#x4EE5;&#x79D1;&#x5B66;&#x8BA1;&#x6570;&#x6CD5;&#x6253;&#x5370;&#xFF0C;&#x6216;&#x4F7F;&#x7528;~g, &#x6839;&#x636E;&#x8F93;&#x5165;&#x7684;&#x5927;&#x5C0F;&#x91C7;&#x7528;&#x6D6E;&#x70B9;&#x8868;&#x793A;&#x6CD5;&#x6216;&#x79D1;&#x5B66;&#x8BA1;&#x6570;&#x6CD5;&#x3002;</p>
<pre><code>(format &quot;~e&quot; 1e23) \Rightarrow &quot;1.0e+23&quot;
(format &quot;~g&quot; 1e23) \Rightarrow &quot;1.0e+23&quot;
</code></pre><p>A real number may also be printed with ~$, which uses monetary notation defaulting to two digits to the right of the decimal point.
&#x5B9E;&#x6570;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x301C;$&#x6253;&#x5370;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x8D27;&#x5E01;&#x7B26;&#x53F7;&#xFF0C;&#x9ED8;&#x8BA4;&#x4E3A;&#x5C0F;&#x6570;&#x70B9;&#x53F3;&#x8FB9;&#x7684;&#x4E24;&#x4F4D;&#x6570;&#x3002;</p>
<pre><code>(format &quot;$~$&quot; (* 39.95 1.06)) \Rightarrow &quot;$42.35&quot;
(format &quot;~$USD&quot; 1/3) \Rightarrow &quot;0.33USD&quot;
</code></pre><p>Words can be pluralized automatically using p.
&#x53EF;&#x4EE5;&#x4F7F;&#x7528; p &#x81EA;&#x52A8;&#x628A;&#x5355;&#x8BCD;&#x53D8;&#x4E3A;&#x590D;&#x6570;&#x5F62;&#x5F0F;&#x3002;</p>
<pre><code>(format &quot;~s bear~:p in ~s den~:p&quot; 10 1) \Rightarrow &quot;10 bears in 1 den&quot;
</code></pre><p>Numbers may be printed out in words or roman numerals using variations on ~r.
&#x53EF;&#x4EE5;&#x4F7F;&#x7528;~r &#x7684;&#x53D8;&#x4F53;&#x4EE5;&#x5355;&#x8BCD;&#x6216;&#x7F57;&#x9A6C;&#x6570;&#x5B57;&#x6253;&#x5370;&#x6570;&#x5B57;&#x3002;</p>
<pre><code>(format &quot;~r&quot; 2599) \Rightarrow  &quot;two thousand five hundred ninety-nine&quot;
(format &quot;~:r&quot; 99) \Rightarrow  &quot;ninety-ninth&quot;
(format &quot;~@r&quot; 2599) \Rightarrow &quot;MMDXCIX&quot;
</code></pre><p>Case conversions can be performed by bracketing a portion of the format string with the <code>@( and ~) directives.
&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528; ~~@(</code> &#x548C; <code>~)</code> &#x6307;&#x4EE4;&#x62EC;&#x8D77;&#x683C;&#x5F0F;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x6765;&#x6267;&#x884C;&#x5927;&#x5C0F;&#x5199;&#x8F6C;&#x6362;&#x3002;</p>
<pre><code>(format &quot;~@(~r~)&quot; 2599) \Rightarrow  &quot;Two thousand five hundred ninety-nine&quot;
(format &quot;~@:(~a~)&quot; &quot;Ouch!&quot;) \Rightarrow  &quot;OUCH!&quot;
</code></pre><p>Some of the directives shown above have more options and parameters, and there are other directives as well, including directives for conditionals, iteration, indirection, and justification. Again, please consult a Common Lisp reference for complete documentation.
&#x4E0A;&#x9762;&#x663E;&#x793A;&#x7684;&#x4E00;&#x4E9B;&#x6307;&#x4EE4;&#x6709;&#x66F4;&#x591A;&#x9009;&#x9879;&#x548C;&#x53C2;&#x6570;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x6307;&#x4EE4;&#xFF0C;&#x5305;&#x62EC;&#x6761;&#x4EF6;&#xFF0C;&#x8FED;&#x4EE3;&#xFF0C;&#x95F4;&#x63A5;&#x548C;&#x5BF9;&#x9F50;&#x7684;&#x6307;&#x4EE4;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x8BF7;&#x53C2;&#x9605; Common Lisp &#x53C2;&#x8003;&#x4EE5;&#x83B7;&#x53D6;&#x5B8C;&#x6574;&#x7684;&#x6587;&#x6863;&#x3002;</p>
<p>An implementation of a greatly simplified version of format appears in Section 12.6 of The Scheme Programming Language, 4th Edition.
&#x5728; &#x300A;Scheme &#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x300B;&#x7B2C; 4 &#x7248;&#x7684;&#x7B2C; 12.6 &#x8282;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x6781;&#x4E3A;&#x7B80;&#x5316;&#x7684; format &#x7248;&#x672C;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
<p>procedure: <code>(printf format-string obj ...)</code>
procedure: <code>(fprintf textual-output-port format-string obj ...)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>These procedures are simple wrappers for format. printf prints the formatted output to the current output, as with a first-argument of #t to format, and fprintf prints the formatted output to the textual-output-port, as when the first argument to format is a port.
&#x8FD9;&#x4E9B;&#x8FC7;&#x7A0B;&#x662F; format &#x7684;&#x7B80;&#x5355;&#x5C01;&#x88C5;&#x5668;&#x3002;printf &#x5C06;&#x683C;&#x5F0F;&#x5316;&#x7684;&#x8F93;&#x51FA;&#x6253;&#x5370;&#x5230;&#x5F53;&#x524D;&#x8F93;&#x51FA;&#xFF0C;&#x5C31;&#x50CF; format &#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x4E3A; #t &#x65F6;&#x4E00;&#x6837;&#xFF0C;&#x800C; fprintf &#x5C06;&#x683C;&#x5F0F;&#x5316;&#x7684;&#x8F93;&#x51FA;&#x6253;&#x5370;&#x5230; textual-output-port&#xFF0C;&#x5C31;&#x50CF; format &#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x4E3A;&#x7AEF;&#x53E3;&#x65F6;&#x4E00;&#x6837;&#x3002;</p>
<h2 id="914-&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x63A7;&#x5236;&#x64CD;&#x4F5C;">9.14. &#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x63A7;&#x5236;&#x64CD;&#x4F5C;</h2>
<p>The I/O control operations described in this section are used to control how the reader reads and printer writes, displays, or pretty-prints characters, symbols, gensyms, numbers, vectors, long or deeply nested lists or vectors, and graph-structured objects.
&#x672C;&#x8282;&#x4E2D;&#x63CF;&#x8FF0;&#x7684; I/O &#x63A7;&#x5236;&#x64CD;&#x4F5C;&#x7528;&#x4E8E;&#x63A7;&#x5236;&#x8BFB;&#x53D6;&#x5668;&#x5982;&#x4F55;&#x8BFB;&#x53D6;&#xFF0C;&#x4EE5;&#x53CA;&#x6253;&#x5370;&#x5668;&#x5982;&#x4F55; write, display, &#x6216; pretty-print &#x5B57;&#x7B26;&#xFF0C;&#x7B26;&#x53F7;&#xFF0C;gensyms&#xFF0C;&#x6570;&#x5B57;&#xFF0C;&#x5411;&#x91CF;&#xFF0C;&#x957F;&#x6216;&#x6DF1;&#x5EA6;&#x5D4C;&#x5957;&#x7684;&#x5217;&#x8868;&#x6216;&#x5411;&#x91CF;&#xFF0C;&#x548C;&#x56FE;&#x7ED3;&#x6784;&#x5BF9;&#x8C61;&#x3002;</p>
<p>procedure: <code>(char-name obj)</code>
returns: &#x53C2;&#x89C1;&#x4E0B;&#x6587;
procedure: <code>(char-name name char)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>char-name is used to associate names (symbols) with characters or to retrieve the most recently associated name or character for a given character or name. A name can map to only one character, but more than one name can map to the same character. The name most recently associated with a character determines how that character prints, and each name associated with a character may be used after the #\ character prefix to name that character on input.
char-name &#x7528;&#x4E8E;&#x5C06;&#x540D;&#x79F0;&#xFF08;&#x7B26;&#x53F7;&#xFF09;&#x4E0E;&#x5B57;&#x7B26;&#x5173;&#x8054;&#xFF0C;&#x6216;&#x8005;&#x83B7;&#x53D6;&#x7ED9;&#x5B9A;&#x5B57;&#x7B26;&#x6216;&#x540D;&#x79F0;&#x7684;&#x6700;&#x8FD1;&#x5173;&#x8054;&#x7684;&#x540D;&#x79F0;&#x6216;&#x5B57;&#x7B26;&#x3002;&#x540D;&#x79F0;&#x53EA;&#x80FD;&#x6620;&#x5C04;&#x5230;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x4F46;&#x591A;&#x4E2A;&#x540D;&#x79F0;&#x53EF;&#x4EE5;&#x6620;&#x5C04;&#x5230;&#x540C;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x3002;&#x6700;&#x8FD1;&#x4E0E;&#x5B57;&#x7B26;&#x5173;&#x8054;&#x7684;&#x540D;&#x79F0;&#x51B3;&#x5B9A;&#x4E86;&#x5B57;&#x7B26;&#x5982;&#x4F55;&#x6253;&#x5370;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x4E0E;&#x5B57;&#x7B26;&#x5173;&#x8054;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x5728;#\&#x5B57;&#x7B26;&#x524D;&#x7F00;&#x4E4B;&#x540E;&#xFF0C;&#x4EE5;&#x5728;&#x8F93;&#x5165;&#x4E2D;&#x547D;&#x540D;&#x8BE5;&#x5B57;&#x7B26;&#x3002;</p>
<p>Character associations created by char-name are ignored by the printer unless the parameter print-char-name is set to a true value. The reader recognizes character names established by char-name except after #!r6rs, which is implied within a library or R6RS top-level program.
&#x9664;&#x975E;&#x53C2;&#x6570;&#x5BF9;&#x8C61; print-char-name &#x8BBE;&#x7F6E;&#x4E3A;&#x771F;&#x503C;&#xFF0C;&#x5426;&#x5219;&#x6253;&#x5370;&#x5668;&#x5C06;&#x5FFD;&#x7565; char-name &#x521B;&#x5EFA;&#x7684;&#x5B57;&#x7B26;&#x5173;&#x8054;&#x3002;&#x8BFB;&#x53D6;&#x5668;&#x8BC6;&#x522B;&#x7531; char-name &#x521B;&#x5EFA;&#x7684;&#x5B57;&#x7B26;&#x540D;&#x79F0;&#xFF0C;&#x9664;&#x4E86;&#x8DDF;&#x5728;#!r6rs &#x4E4B;&#x540E;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x5176;&#x9690;&#x85CF;&#x5728;&#x5E93;&#x6216; R<sup>6</sup>RS &#x9876;&#x5C42;&#x7A0B;&#x5E8F;&#x4E2D;&#x3002;</p>
<p>In the one-argument form, obj must be a symbol or character. If it is a symbol and a character is associated with the symbol, char-name returns that character. If it is a symbol and no character is associated with the symbol, char-name returns #f. Similarly, if obj is a character, char-name returns the most recently associated symbol for the character or #f if no name is associated with the character. For example, with the default set of character names:
&#x5728;&#x5355;&#x53C2;&#x6570;&#x5F62;&#x5F0F;&#x4E2D;&#xFF0C;obj &#x5FC5;&#x987B;&#x662F;&#x7B26;&#x53F7;&#x6216;&#x5B57;&#x7B26;&#x3002;&#x5982;&#x679C;&#x5B83;&#x662F;&#x7B26;&#x53F7;&#x5E76;&#x4E14;&#x6709;&#x5B57;&#x7B26;&#x4E0E;&#x6B64;&#x7B26;&#x53F7;&#x76F8;&#x5173;&#x8054;&#xFF0C;&#x5219; char-name &#x8FD4;&#x56DE;&#x8BE5;&#x5B57;&#x7B26;&#x3002;&#x5982;&#x679C;&#x5B83;&#x662F;&#x7B26;&#x53F7;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x5B57;&#x7B26;&#x4E0E;&#x6B64;&#x7B26;&#x53F7;&#x76F8;&#x5173;&#x8054;&#xFF0C;&#x5219; char-name &#x8FD4;&#x56DE;#f. &#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x5982;&#x679C; obj &#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x5219; char-name &#x8FD4;&#x56DE;&#x8BE5;&#x5B57;&#x7B26;&#x6700;&#x8FD1;&#x5173;&#x8054;&#x7684;&#x7B26;&#x53F7;&#xFF0C;&#x6216;&#x8005;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4E0E;&#x8BE5;&#x5B57;&#x7B26;&#x5173;&#x8054;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;#f. &#x4F8B;&#x5982;&#xFF0C;&#x4F7F;&#x7528;&#x9ED8;&#x8BA4;&#x7684;&#x5B57;&#x7B26;&#x540D;&#x79F0;&#x96C6;&#xFF1A;</p>
<pre><code>(char-name #\space) \Rightarrow space
(char-name &apos;space) \Rightarrow #\space
(char-name &apos;nochar) \Rightarrow #f
(char-name #\a) \Rightarrow #f
</code></pre><p>When passed two arguments, name is added to the set of names associated with char, and any other association for name is dropped. char may be #f, in which case any other association for name is dropped and no new association is formed. In either case, any other names associated with char remain associated with char.
&#x4F20;&#x5165;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x65F6;&#xFF0C;name &#x5C06;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x4E0E; char &#x5173;&#x8054;&#x7684;&#x540D;&#x79F0;&#x96C6;&#x4E2D;&#xFF0C;&#x5E76;&#x5220;&#x9664; name &#x7684;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x5173;&#x8054;&#x3002;char &#x53EF;&#x4EE5;&#x662F;#f, &#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x540D;&#x79F0;&#x7684;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x5173;&#x8054;&#x90FD;&#x5C06;&#x88AB;&#x5220;&#x9664;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x4F1A;&#x5F62;&#x6210;&#x65B0;&#x7684;&#x5173;&#x8054;&#x3002;&#x5728;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E0E; char &#x76F8;&#x5173;&#x8054;&#x7684;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x540D;&#x79F0;&#x4ECD;&#x4E0E; char &#x76F8;&#x5173;&#x8054;&#x3002;</p>
<p>The following interactive session demonstrates the use of char-name to establish and remove associations between characters and names, including the association of more than one name with a character.
&#x4EE5;&#x4E0B;&#x7684;&#x4EA4;&#x4E92;&#x5F0F;&#x4F1A;&#x8BDD;&#x6F14;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; char-name &#x6765;&#x5EFA;&#x7ACB;&#x548C;&#x5220;&#x9664;&#x5B57;&#x7B26;&#x548C;&#x540D;&#x79F0;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x8054;&#xFF0C;&#x5305;&#x62EC;&#x591A;&#x4E2A;&#x540D;&#x79F0;&#x4E0E;&#x5B57;&#x7B26;&#x7684;&#x5173;&#x8054;&#x3002;</p>
<pre><code>(print-char-name #t)
(char-name &apos;etx) \Rightarrow #f
(char-name &apos;etx #\x3)
(char-name &apos;etx) \Rightarrow #\etx
(char-name #\x3) \Rightarrow etx
#\etx \Rightarrow #\etx
(eq? #\etx #\x3) \Rightarrow #t
#!r6rs #\etx \Rightarrow exception: invalid character name etx
#!chezscheme #\etx \Rightarrow #\etx
(char-name &apos;etx #\space)
(char-name #\x3) \Rightarrow #f
(char-name &apos;etx) \Rightarrow #\etx
#\space \Rightarrow #\etx
(char-name &apos;etx #f)
#\etx \Rightarrow exception: invalid character name etx
#\space \Rightarrow #\space
</code></pre><p>(When using the expression editor, it is necessary to type Control-J to force the editor to read the erroneous #\etx input on the two inputs above that result in read errors, since typing Enter causes the expression editor to read the input only if the input is well-formed.)
&#xFF08;&#x5F53;&#x4F7F;&#x7528;&#x8868;&#x8FBE;&#x5F0F;&#x7F16;&#x8F91;&#x5668;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x952E;&#x5165; Control-J &#x4EE5;&#x5F3A;&#x5236;&#x7F16;&#x8F91;&#x5668;&#x8BFB;&#x53D6;&#x4E0A;&#x9762;&#x4E24;&#x4E2A;&#x8F93;&#x5165;&#x4E0A;&#x7684;&#x9519;&#x8BEF;#\etx &#x8F93;&#x5165;&#xFF0C;&#x5176;&#x4F1A;&#x5BFC;&#x81F4;&#x8BFB;&#x53D6;&#x9519;&#x8BEF;&#xFF0C;&#x56E0;&#x4E3A;&#x952E;&#x5165; Enter &#x4F1A;&#x5BFC;&#x81F4;&#x8868;&#x8FBE;&#x5F0F;&#x7F16;&#x8F91;&#x5668;&#x4EC5;&#x5728;&#x8F93;&#x5165;&#x5F62;&#x5F0F;&#x5408;&#x6CD5;&#x65F6;&#x8BFB;&#x53D6;&#x8F93;&#x5165;&#x3002;&#xFF09;</p>
<p>The reader does not recognize hex scalar value escapes in character names, as it does in symbols, so #\new\x6c;ine is not equivalent to #\newline. In general, programmers should avoid the use of character name symbols that cannot be entered without the use of hex scalar value escapes or other symbol-name escape mechanisms, since such character names will not be readable.
&#x8BFB;&#x53D6;&#x5668;&#x4E0D;&#x4F1A;&#x50CF;&#x5BF9;&#x7B26;&#x53F7;&#x4E00;&#x6837;&#x8BC6;&#x522B;&#x5B57;&#x7B26;&#x540D;&#x79F0;&#x4E2D;&#x8F6C;&#x4E49;&#x7684;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6807;&#x91CF;&#x503C;&#xFF0C;&#x56E0;&#x6B64;#\new\x6c;ine &#x4E0D;&#x7B49;&#x540C;&#x4E8E;#\newline. &#x901A;&#x5E38;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x5E94;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x90A3;&#x4E9B;&#x4E0D;&#x4F7F;&#x7528;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6807;&#x91CF;&#x503C;&#x8F6C;&#x4E49;&#x6216;&#x5176;&#x4ED6;&#x7B26;&#x53F7;&#x540D;&#x8F6C;&#x4E49;&#x673A;&#x5236;&#x5219;&#x65E0;&#x6CD5;&#x8F93;&#x5165;&#x7684;&#x5B57;&#x7B26;&#x540D;&#x79F0;&#x7B26;&#x53F7;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x7C7B;&#x5B57;&#x7B26;&#x540D;&#x79F0;&#x5C06;&#x65E0;&#x6CD5;&#x8BFB;&#x53D6;&#x3002;</p>
<p>thread parameter: <code>print-char-name</code>
libraries: (chezscheme)</p>
<p>When print-char-name is set to #f (the default), associations created by char-name are ignored by write, put-datum, pretty-print, and the format &quot;<code>s&quot; directive. Otherwise, these procedures use the names established by char-name when printing character objects.
&#x5F53; print-char-name &#x8BBE;&#x7F6E;&#x4E3A;#f&#xFF08;&#x9ED8;&#x8BA4;&#x503C;&#xFF09;&#x65F6;&#xFF0C;char-name &#x521B;&#x5EFA;&#x7684;&#x5173;&#x8054;&#x5C06;&#x88AB; write&#xFF0C;put-datum&#xFF0C;pretty-print &#x548C; ~format &quot;~s&quot;</code> &#x6307;&#x4EE4;&#x5FFD;&#x7565;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x8FD9;&#x4E9B;&#x8FC7;&#x7A0B;&#x5728;&#x6253;&#x5370;&#x5B57;&#x7B26;&#x5BF9;&#x8C61;&#x65F6;&#x4F7F;&#x7528; char-name &#x5EFA;&#x7ACB;&#x7684;&#x540D;&#x79F0;&#x3002;</p>
<pre><code>(char-name &apos;etx #\x3)
(format &quot;~s&quot; #\x3) \Rightarrow &quot;#\\x3&quot;
(parameterize ([print-char-name #t])
  (format &quot;~s&quot; #\x3)) \Rightarrow &quot;#\\etx&quot;
</code></pre><p>thread parameter: <code>case-sensitive</code>
libraries: (chezscheme)</p>
<p>The case-sensitive parameter determines whether the reader is case-sensitive with respect to symbol and character names. When set to true (the default, as required by the Revised6 Report) the case of alphabetic characters within symbol names is significant. When set to #f, case is insignificant. More precisely, when set to #f, symbol and character names are folded (as if by string-foldcase); otherwise, they are left as they appear in the input.
&#x53C2;&#x6570;&#x5BF9;&#x8C61; case-sensitive &#x51B3;&#x5B9A;&#x8BFB;&#x53D6;&#x5668;&#x662F;&#x5426;&#x5BF9;&#x7B26;&#x53F7;&#x548C;&#x5B57;&#x7B26;&#x540D;&#x79F0;&#x533A;&#x5206;&#x5927;&#x5C0F;&#x5199;&#x3002;&#x5F53;&#x8BBE;&#x7F6E;&#x4E3A;&#x771F;&#xFF08;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x6839;&#x636E; R<sup>6</sup>RS &#x7684;&#x8981;&#x6C42;&#xFF09;&#x65F6;&#xFF0C;&#x7B26;&#x53F7;&#x540D;&#x79F0;&#x4E2D;&#x5B57;&#x6BCD;&#x5B57;&#x7B26;&#x7684;&#x5927;&#x5C0F;&#x5199;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;&#x5F53;&#x8BBE;&#x7F6E;&#x4E3A;#f &#x65F6;&#xFF0C;&#x5219;&#x5927;&#x5C0F;&#x5199;&#x65E0;&#x5173;&#x7D27;&#x8981;&#x3002;&#x66F4;&#x51C6;&#x786E;&#x5730;&#x8BF4;&#xFF0C;&#x5F53;&#x8BBE;&#x7F6E;&#x4E3A;#f &#x65F6;&#xFF0C;&#x7B26;&#x53F7;&#x548C;&#x5B57;&#x7B26;&#x540D;&#x79F0;&#x88AB;&#x6298;&#x53E0;&#xFF08;&#x5C31;&#x50CF;&#x4F7F;&#x7528; string-foldcase &#x4E00;&#x6837;&#xFF09;; &#x5426;&#x5219;&#xFF0C;&#x5B83;&#x4EEC;&#x4F1A;&#x4EE5;&#x5B83;&#x4EEC;&#x51FA;&#x73B0;&#x7684;&#x5F62;&#x5F0F;&#x4FDD;&#x7559;&#x5728;&#x8F93;&#x5165;&#x4E2D;&#x3002;</p>
<p>The value of the case-sensitive matters only if neither #!fold-case nor #!no-fold-case has appeared previously in the same input stream. That is, symbol and character name are folded if #!fold-case has been seen. They are not folded if #!no-fold-case has been seen. If neither has been seen, they are folded if and only if (case-sensitive) is #f.
&#x53EA;&#x6709;&#x5F53;#!fold-case &#x548C;#!no-fold-case &#x90FD;&#x6CA1;&#x6709;&#x5148;&#x51FA;&#x73B0;&#x5728;&#x540C;&#x4E00;&#x8F93;&#x5165;&#x6D41;&#x4E2D;&#x65F6;&#xFF0C;case-sensitive &#x7684;&#x503C;&#x624D;&#x6709;&#x4F5C;&#x7528;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x9047;&#x5230;#!fold-case&#xFF0C;&#x5219;&#x6298;&#x53E0;&#x7B26;&#x53F7;&#x548C;&#x5B57;&#x7B26;&#x540D;&#x3002;&#x5982;&#x679C;&#x9047;&#x5230;#!no-fold-case&#xFF0C;&#x5219;&#x5B83;&#x4EEC;&#x4E0D;&#x4F1A;&#x88AB;&#x6298;&#x53E0;&#x3002;&#x5982;&#x679C;&#x4E24;&#x8005;&#x90FD;&#x6CA1;&#x6709;&#x9047;&#x5230;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x4E14;&#x4EC5;&#x5F53; (case-sensitive) &#x4E3A; #f &#x65F6;&#x5B83;&#x4EEC;&#x88AB;&#x6298;&#x53E0;&#x3002;</p>
<pre><code>(case-sensitive) \Rightarrow #t
(eq? &apos;abc &apos;ABC) \Rightarrow #f
&apos;ABC \Rightarrow ABC
(case-sensitive #f)
&apos;ABC \Rightarrow abc
(eq? &apos;abc &apos;ABC) \Rightarrow #t
</code></pre><p>thread parameter: <code>print-graph</code>
libraries: (chezscheme)</p>
<p>When print-graph is set to a true value, write and pretty-print locate and print objects with shared structure, including cycles, in a notation that may be read subsequently with read. This notation employs the syntax &quot;#n=obj,&quot; where n is a nonnegative integer and obj is the printed representation of an object, to label the first occurrence of obj in the output. The syntax &quot;#n#&quot; is used to refer to the object labeled by n thereafter in the output. print-graph is set to #f by default.
&#x5F53; print-graph &#x8BBE;&#x7F6E;&#x4E3A;&#x771F;&#x503C;&#x65F6;&#xFF0C;write &#x548C; pretty-print &#x5B9A;&#x4F4D;&#x5E76;&#x6253;&#x5370;&#x5177;&#x6709;&#x5171;&#x4EAB;&#x7ED3;&#x6784;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5305;&#x62EC;&#x73AF;&#xFF0C;&#x4EE5;&#x4E00;&#x79CD;&#x53EF;&#x4EE5;&#x968F;&#x540E;&#x7528; read &#x8BFB;&#x53D6;&#x7684;&#x8868;&#x793A;&#x6CD5;&#x3002;&#x8FD9;&#x79CD;&#x8868;&#x793A;&#x6CD5;&#x4F7F;&#x7528;&#x8BED;&#x6CD5; &quot;#n=obj&quot;, &#x5176;&#x4E2D; n &#x662F;&#x975E;&#x8D1F;&#x6574;&#x6570;&#xFF0C;obj &#x662F;&#x5BF9;&#x8C61;&#x7684;&#x6253;&#x5370;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#xFF0C;&#x7528;&#x4E8E;&#x6807;&#x8BB0;&#x8F93;&#x51FA;&#x4E2D;&#x7B2C;&#x4E00;&#x6B21;&#x51FA;&#x73B0;&#x7684; obj. &#x8BED;&#x6CD5;&quot;#n#&quot;&#x7528;&#x4E8E;&#x5F15;&#x7528;&#x540E;&#x9762;&#x8F93;&#x51FA;&#x4E2D;&#x4EE5; n &#x6807;&#x8BB0;&#x7684;&#x5BF9;&#x8C61;&#x3002;print-graph &#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#x4E3A;#f&#x3002;</p>
<p>If graph printing is not enabled, the settings of print-length and print-level are insufficient to force finite output, and write or pretty-print detects a cycle in an object it is given to print, a warning is issued (an exception with condition type &amp;warning is raised) and the object is printed as if print-graph were enabled.
&#x5982;&#x679C;&#x6CA1;&#x6709;&#x542F;&#x7528;&#x56FE;&#x6253;&#x5370;&#xFF0C;&#x5219; print-length &#x548C; print-level &#x7684;&#x8BBE;&#x7F6E;&#x4E0D;&#x8DB3;&#x4EE5;&#x5F3A;&#x5236;&#x6709;&#x9650;&#x8F93;&#x51FA;&#xFF0C;&#x800C;&#x5F53; write &#x6216; pretty-print &#x68C0;&#x6D4B;&#x5230;&#x8981;&#x6253;&#x5370;&#x7684;&#x5BF9;&#x8C61;&#x4E2D;&#x6709;&#x73AF;&#x65F6;&#xFF0C;&#x5219;&#x4F1A;&#x53D1;&#x51FA;&#x8B66;&#x544A;&#xFF08;&#x629B;&#x51FA;&#x6761;&#x4EF6;&#x7C7B;&#x578B;&#x7684; &amp;warning &#x5F02;&#x5E38;&#xFF09;&#x5E76;&#x6253;&#x5370;&#x5BF9;&#x8C61;&#xFF0C;&#x5982;&#x540C; print-graph &#x542F;&#x7528;&#x65F6;&#x4E00;&#x6837;&#x3002;</p>
<p>Since objects printed through the ~s option in the format control strings of format, printf, and fprintf are printed as with write, the printing of such objects is also affected by print-graph.
&#x7531;&#x4E8E;&#x901A;&#x8FC7; format&#xFF0C;printf &#x548C; fprintf &#x7684;&#x683C;&#x5F0F;&#x63A7;&#x5236;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x7684;~s &#x9009;&#x9879;&#x6253;&#x5370;&#x7684;&#x5BF9;&#x8C61;&#x548C;&#x4F7F;&#x7528; write &#x6253;&#x5370;&#x7684;&#x4E00;&#x6837;&#xFF0C;&#x56E0;&#x6B64; print-graph &#x4E5F;&#x4F1A;&#x5F71;&#x54CD;&#x6B64;&#x7C7B;&#x5BF9;&#x8C61;&#x7684;&#x6253;&#x5370;&#x3002;</p>
<pre><code>(parameterize ([print-graph #t])
  (let ([x (list &apos;a &apos;b)])
    (format &quot;~s&quot; (list x x)))) \Rightarrow &quot;(#0=(a b) #0#)&quot;

(parameterize ([print-graph #t])
  (let ([x (list &apos;a &apos;b)])
    (set-car! x x)
    (set-cdr! x x)
    (format &quot;~s&quot; x))) \Rightarrow &quot;#0=(#0# . #0#)&quot;
</code></pre><p>The graph syntax is understood by the procedure read, allowing graph structures to be printed and read consistently.
&#x8FC7;&#x7A0B; read &#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x56FE;&#x8BED;&#x6CD5;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x4E00;&#x81F4;&#x5730;&#x6253;&#x5370;&#x548C;&#x8BFB;&#x53D6;&#x56FE;&#x7ED3;&#x6784;&#x3002;</p>
<p>thread parameter: <code>print-level</code>
thread parameter: <code>print-length</code>
libraries: (chezscheme)</p>
<p>These parameters can be used to limit the extent to which nested or multiple-element structures are printed. When called without arguments, print-level returns the current print level and print-length returns the current print length. When called with one argument, which must be a nonnegative fixnum or #f, print-level sets the current print level and print-length sets the current print length to the argument.
&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x53EF;&#x7528;&#x4E8E;&#x9650;&#x5236;&#x5D4C;&#x5957;&#x6216;&#x591A;&#x5143;&#x7D20;&#x7ED3;&#x6784;&#x7684;&#x6253;&#x5370;&#x8303;&#x56F4;&#x3002;&#x5F53;&#x4E0D;&#x5E26;&#x53C2;&#x6570;&#x8C03;&#x7528;&#x65F6;&#xFF0C;print-level &#x8FD4;&#x56DE;&#x5F53;&#x524D;&#x6253;&#x5370;&#x7EA7;&#x522B;&#xFF0C;print-length &#x8FD4;&#x56DE;&#x5F53;&#x524D;&#x6253;&#x5370;&#x957F;&#x5EA6;&#x3002;&#x5F53;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF08;&#x5FC5;&#x987B;&#x662F;&#x975E;&#x8D1F;&#x7684; fixnum &#x6216;#f&#xFF09;&#x8C03;&#x7528;&#x65F6;&#xFF0C;print-level &#x628A;&#x5F53;&#x524D;&#x7684;&#x6253;&#x5370;&#x7EA7;&#x522B;&#x8BBE;&#x7F6E;&#x4E3A;&#x5B9E;&#x53C2;&#xFF0C;print-length &#x5C06;&#x628A;&#x5F53;&#x524D;&#x7684;&#x6253;&#x5370;&#x957F;&#x5EA6;&#x8BBE;&#x7F6E;&#x4E3A;&#x5B9E;&#x53C2;&#x3002;</p>
<p>When print-level is set to a nonnegative integer n, write and pretty-print traverse only n levels deep into nested structures. If a structure being printed exceeds n levels of nesting, the substructure beyond that point is replaced in the output by an ellipsis ( &#x2026; ). print-level is set to #f by default, which places no limit on the number of levels printed.
&#x5F53; print-level &#x88AB;&#x8BBE;&#x7F6E;&#x4E3A;&#x975E;&#x8D1F;&#x6574;&#x6570; n &#x65F6;&#xFF0C;write &#x548C; pretty-print &#x4EC5;&#x5728;&#x5D4C;&#x5957;&#x7ED3;&#x6784;&#x4E2D;&#x904D;&#x5386;&#x5230;&#x7B2C; n &#x5C42;&#x3002;&#x5982;&#x679C;&#x5F53;&#x524D;&#x6253;&#x5370;&#x7684;&#x7ED3;&#x6784;&#x8D85;&#x8FC7; n &#x5C42;&#x5D4C;&#x5957;&#xFF0C;&#x5219;&#x8D85;&#x51FA;&#x8BE5;&#x5C42;&#x7684;&#x5B50;&#x7ED3;&#x6784;&#x5C06;&#x5728;&#x8F93;&#x51FA;&#x4E2D;&#x88AB;&#x7701;&#x7565;&#x53F7;&#xFF08;&#x2026;&#xFF09;&#x66FF;&#x6362;&#x3002;print-level &#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#x4E3A;#f&#xFF0C;&#x5373;&#x5BF9;&#x6253;&#x5370;&#x7684;&#x5C42;&#x6570;&#x6CA1;&#x6709;&#x9650;&#x5236;&#x3002;</p>
<p>When print-length is set to a nonnegative integer n, the procedures write and pretty-print print only n elements of a list or vector, replacing the remainder of the list or vector with an ellipsis ( &#x2026; ). print-length is set to #f by default, which places no limit on the number of elements printed.
&#x5F53; print-length &#x88AB;&#x8BBE;&#x7F6E;&#x4E3A;&#x975E;&#x8D1F;&#x6574;&#x6570; n &#x65F6;&#xFF0C;&#x8FC7;&#x7A0B; write &#x548C; pretty-print &#x4EC5;&#x6253;&#x5370;&#x5217;&#x8868;&#x6216;&#x5411;&#x91CF;&#x4E2D;&#x7684; n &#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x7528;&#x7701;&#x7565;&#x53F7;&#xFF08;&#x2026;&#xFF09;&#x66FF;&#x6362;&#x5217;&#x8868;&#x6216;&#x5411;&#x91CF;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x3002;print-length &#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#x4E3A;#f&#xFF0C;&#x5373;&#x5BF9;&#x6253;&#x5370;&#x7684;&#x5143;&#x7D20;&#x6570;&#x91CF;&#x6CA1;&#x6709;&#x9650;&#x5236;&#x3002;</p>
<p>Since objects printed through the ~s option in the format control strings of format, printf, and fprintf are printed as with write, the printing of such objects is also affected by print-level and print-length.
&#x7531;&#x4E8E;&#x901A;&#x8FC7; format&#xFF0C;printf &#x548C; fprintf &#x7684;&#x683C;&#x5F0F;&#x63A7;&#x5236;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x7684;~s &#x9009;&#x9879;&#x6253;&#x5370;&#x7684;&#x5BF9;&#x8C61;&#x548C;&#x4F7F;&#x7528; write &#x6253;&#x5370;&#x7684;&#x4E00;&#x6837;&#xFF0C;&#x56E0;&#x6B64;&#x6253;&#x5370;&#x6B64;&#x7C7B;&#x5BF9;&#x8C61;&#x4E5F;&#x4F1A;&#x53D7;&#x5230; print-level &#x548C; print-length &#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p>The parameters print-level and print-length are useful for controlling the volume of output in contexts where only a small portion of the output is needed to identify the object being printed. They are also useful in situations where circular structures may be printed (see also print-graph).
&#x5728;&#x53EA;&#x9700;&#x8981;&#x8F93;&#x51FA;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x6765;&#x8BC6;&#x522B;&#x6253;&#x5370;&#x5BF9;&#x8C61;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x53C2;&#x6570;&#x5BF9;&#x8C61; print-level &#x548C; print-length &#x5BF9;&#x4E8E;&#x63A7;&#x5236;&#x8F93;&#x51FA;&#x91CF;&#x662F;&#x5F88;&#x6709;&#x7528;&#x7684;&#x3002;&#x5B83;&#x4EEC;&#x5728;&#x53EF;&#x80FD;&#x6253;&#x5370;&#x73AF;&#x7ED3;&#x6784;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4E5F;&#x5F88;&#x6709;&#x7528;&#xFF08;&#x53E6;&#x8BF7;&#x53C2;&#x89C1; print-graph&#xFF09;&#x3002;</p>
<pre><code>(format &quot;~s&quot; &apos;((((a) b) c) d e f g)) \Rightarrow &quot;((((a) b) c) d e f g)&quot;

(parameterize ([print-level 2])
  (format &quot;~s&quot; &apos;((((a) b) c) d e f g))) \Rightarrow &quot;(((...) c) d e f g)&quot;

(parameterize ([print-length 3])
  (format &quot;~s&quot; &apos;((((a) b) c) d e f g))) \Rightarrow &quot;((((a) b) c) d e ...)&quot;

(parameterize ([print-level 2]
               [print-length 3])
  (format &quot;~s&quot; &apos;((((a) b) c) d e f g))) \Rightarrow &quot;(((...) c) d e ...)&quot;
</code></pre><p>thread parameter: <code>print-radix</code>
libraries: (chezscheme)</p>
<p>The print-radix parameter determines the radix in which numbers are printed by write, pretty-print, and display. Its value should be an integer between 2 and 36, inclusive. Its default value is 10.
print-radix &#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x51B3;&#x5B9A;&#x901A;&#x8FC7; write, pretty-print, &#x548C; display &#x6253;&#x5370;&#x6570;&#x5B57;&#x65F6;&#x7684;&#x57FA;&#x6570;&#x3002;&#x5B83;&#x7684;&#x503C;&#x5E94;&#x8BE5;&#x662F; 2 &#x5230; 36 &#x4E4B;&#x95F4;&#x7684;&#x6574;&#x6570;&#xFF0C;&#x5305;&#x62EC; 2 &#x548C; 36&#x3002;&#x5176;&#x9ED8;&#x8BA4;&#x503C;&#x4E3A; 10&#x3002;</p>
<p>When the value of print-radix is not 10, write and pretty-print print a radix prefix before the number (#b for radix 2, #o for radix 8, #x for radix 16, and #nr for any other radix n).
&#x5F53; print-radix &#x7684;&#x503C;&#x4E0D;&#x662F; 10 &#x65F6;&#xFF0C;write &#x548C; pretty-print &#x4F1A;&#x5728;&#x6570;&#x5B57;&#x524D;&#x6253;&#x5370;&#x4E00;&#x4E2A;&#x57FA;&#x6570;&#x524D;&#x7F00;&#xFF08;&#x57FA;&#x6570; 2 &#x4E3A;#b&#xFF0C;&#x57FA;&#x6570; 8 &#x4E3A;#o&#xFF0C;&#x57FA;&#x6570; 16 &#x4E3A; #x&#xFF0C;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x57FA;&#x6570; n &#x4E3A;#nr&#xFF09;&#x3002;</p>
<p>Since objects printed through the ~s and ~a options in the format control strings of format, printf, and fprintf are printed as with write and display, the printing of such objects is also affected by print-radix.
&#x7531;&#x4E8E;&#x901A;&#x8FC7; format&#xFF0C;printf &#x548C; fprintf &#x7684;&#x683C;&#x5F0F;&#x63A7;&#x5236;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x7684;~s &#x548C;~a &#x9009;&#x9879;&#x6253;&#x5370;&#x7684;&#x5BF9;&#x8C61;&#x4E0E;&#x4F7F;&#x7528; write &#x548C; display &#x6253;&#x5370;&#x7684;&#x4E00;&#x6837;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x7C7B;&#x5BF9;&#x8C61;&#x7684;&#x6253;&#x5370;&#x4E5F;&#x4F1A;&#x53D7;&#x5230; print-radix &#x5F71;&#x54CD;&#x3002;</p>
<pre><code>(format &quot;~s&quot; 11242957) \Rightarrow &quot;11242957&quot;

(parameterize ([print-radix 16])
  (format &quot;~s&quot; 11242957)) \Rightarrow &quot;#xAB8DCD&quot;

(parameterize ([print-radix 16])
  (format &quot;~a&quot; 11242957)) \Rightarrow &quot;AB8DCD&quot;
</code></pre><p>thread parameter: <code>print-gensym</code>
libraries: (chezscheme)</p>
<p>When print-gensym is set to #t (the default) gensyms are printed with an extended symbol syntax that includes both the pretty name and the unique name of the gensym: #{pretty-name unique-name}. When set to pretty, the pretty name only is shown, with the prefix #:. When set to pretty/suffix, the printer prints the gensym&apos;s &quot;pretty&quot; name along with a suffix based on the gensym&apos;s &quot;unique&quot; name, separated by a dot ( &quot;.&quot; ). If the gensym&apos;s unique name is generated automatically during the current session, the suffix is that portion of the unique name that is not common to all gensyms created during the current session. Otherwise, the suffix is the entire unique name. When set to #f, the pretty name only is shown, with no prefix.
&#x5F53; print-gensym &#x8BBE;&#x7F6E;&#x4E3A;#t&#xFF08;&#x9ED8;&#x8BA4;&#x503C;&#xFF09;&#x65F6;&#xFF0C;gensyms &#x5C06;&#x4F7F;&#x7528;&#x6269;&#x5C55;&#x7B26;&#x53F7;&#x8BED;&#x6CD5;&#x6253;&#x5370;&#xFF0C;&#x8BE5;&#x8BED;&#x6CD5;&#x5305;&#x62EC;&#x7F8E;&#x89C2;&#x540D;&#x79F0;&#x548C; gensym &#x7684;&#x552F;&#x4E00;&#x540D;&#x79F0;&#xFF1A;#{pretty-name unique-name}. &#x5F53;&#x8BBE;&#x7F6E;&#x4E3A; pretty &#x65F6;&#xFF0C;&#x4EC5;&#x663E;&#x793A;&#x7F8E;&#x89C2;&#x540D;&#x79F0;&#xFF0C;&#x5E26;&#x6709;&#x524D;&#x7F00;#:. &#x5F53;&#x8BBE;&#x7F6E;&#x4E3A; pretty/suffix &#x65F6;&#xFF0C;&#x6253;&#x5370;&#x5668;&#x6253;&#x5370; gensym &#x7684;&#x201C;&#x7F8E;&#x89C2;&#x201D;&#x540D;&#x79F0;&#x4EE5;&#x53CA;&#x57FA;&#x4E8E; gensym &#x7684;&#x201C;&#x552F;&#x4E00;&#x201D;&#x540D;&#x79F0;&#x751F;&#x6210;&#x7684;&#x540E;&#x7F00;&#xFF0C;&#x4EE5;&#x70B9;&#xFF08;&quot;.&quot;&#xFF09;&#x5206;&#x9694;&#x3002;&#x5982;&#x679C; gensym &#x7684;&#x552F;&#x4E00;&#x540D;&#x79F0;&#x662F;&#x5728;&#x5F53;&#x524D;&#x4F1A;&#x8BDD;&#x671F;&#x95F4;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x7684;&#xFF0C;&#x5219;&#x540E;&#x7F00;&#x662F;&#x552F;&#x4E00;&#x540D;&#x79F0;&#x4E2D;&#x4E0E;&#x5F53;&#x524D;&#x4F1A;&#x8BDD;&#x671F;&#x95F4;&#x521B;&#x5EFA;&#x7684;&#x6240;&#x6709; gensyms &#x4E0D;&#x540C;&#x7684;&#x90E8;&#x5206;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x540E;&#x7F00;&#x4E3A;&#x5B8C;&#x6574;&#x7684;&#x552F;&#x4E00;&#x540D;&#x79F0;&#x3002;&#x8BBE;&#x7F6E;&#x4E3A;#f &#x65F6;&#xFF0C;&#x4EC5;&#x663E;&#x793A;&#x4E0D;&#x5E26;&#x524D;&#x7F00;&#x7684;&#x7F8E;&#x89C2;&#x540D;&#x79F0;&#x3002;</p>
<p>Since objects printed through the ~s option in the format control strings of format, printf, errorf, etc., are printed as with write, the printing of such objects is also affected by print-gensym.
&#x7531;&#x4E8E;&#x901A;&#x8FC7; format&#xFF0C;printf &#x548C; errorf &#x7B49;&#x683C;&#x5F0F;&#x63A7;&#x5236;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x7684;~s &#x9009;&#x9879;&#x6253;&#x5370;&#x7684;&#x5BF9;&#x8C61;&#x4E0E;&#x4F7F;&#x7528; write &#x6253;&#x5370;&#x7684;&#x4E00;&#x6837;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x7C7B;&#x5BF9;&#x8C61;&#x7684;&#x6253;&#x5370;&#x4E5F;&#x4F1A;&#x53D7;&#x5230; print-gensym &#x5F71;&#x54CD;&#x3002;</p>
<p>When printing an object that may contain more than one occurrence of a gensym and print-graph is set to pretty or #f, it is useful to set print-graph to #t so that multiple occurrences of the same gensym are marked as identical in the output.
&#x5F53;&#x6253;&#x5370;&#x4E00;&#x4E2A;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x540C;&#x4E00; gensym &#x7684;&#x591A;&#x6B21;&#x51FA;&#x73B0;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x800C; print-graph &#x88AB;&#x8BBE;&#x7F6E;&#x4E3A; pretty &#x6216;#f &#x65F6;&#xFF0C;&#x5C06; print-graph &#x8BBE;&#x7F6E;&#x4E3A;#t &#x975E;&#x5E38;&#x6709;&#x7528;&#xFF0C;&#x8FD9;&#x6837;&#x591A;&#x6B21;&#x51FA;&#x73B0;&#x7684;&#x540C;&#x4E00; gensym &#x4F1A;&#x5728;&#x8F93;&#x51FA;&#x4E2D;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;&#x76F8;&#x540C;&#x7684;&#x3002;</p>
<pre><code>(let ([g (gensym)])
  (format &quot;~s&quot; g)) \Rightarrow &quot;#{g0 bdids2xl6v49vgwe-a}&quot;

(let ([g (gensym)])
  (parameterize ([print-gensym &apos;pretty])
    (format &quot;~s&quot; g))) \Rightarrow &quot;#:g1

(let ([g (gensym)])
  (parameterize ([print-gensym #f])
    (format &quot;~s&quot; g))) \Rightarrow &quot;g2&quot;

(let ([g (gensym)])
  (parameterize ([print-graph #t] [print-gensym &apos;pretty])
    (format &quot;~s&quot; (list g g)))) \Rightarrow &quot;(#0=#:g3 #0#)&quot;

(let ([g1 (gensym &quot;x&quot;)]
      [g2 (gensym &quot;x&quot;)]
      [g3 (gensym &quot;y&quot;)])
  (parameterize ([print-gensym &apos;pretty/suffix])
    (format &quot;~s ~s ~s&quot; g1 g2 g3))) \Rightarrow &quot;x.1 x.2 y.3&quot;
</code></pre><p>thread parameter: <code>print-brackets</code>
libraries: (chezscheme)</p>
<p>When print-brackets is set to a true value, the pretty printer (see pretty-print) uses square brackets rather than parentheses around certain subexpressions of common control structures, e.g., around let bindings and cond clauses. print-brackets is set to #t by default.
&#x5F53; print-bracket &#x8BBE;&#x7F6E;&#x4E3A;&#x771F;&#x503C;&#x65F6;&#xFF0C;&#x7F8E;&#x89C2;&#x6253;&#x5370;&#x5668;&#xFF08;&#x53C2;&#x89C1; pretty-print&#xFF09;&#x4F7F;&#x7528;&#x65B9;&#x62EC;&#x53F7;&#x800C;&#x4E0D;&#x662F;&#x5706;&#x62EC;&#x53F7;&#x6765;&#x62EC;&#x8D77;&#x5171;&#x6709;&#x63A7;&#x5236;&#x7ED3;&#x6784;&#x7684;&#x7279;&#x5B9A;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;let &#x7ED1;&#x5B9A;&#x548C; cond &#x5B50;&#x53E5;&#x3002;print-bracket &#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#x4E3A;#t&#x3002;</p>
<pre><code>(let ([p (open-output-string)])
  (pretty-print &apos;(let ([x 3]) x) p) \Rightarrow &quot;(let ([x 3]) x)
  (get-output-string p))             &quot;

(parameterize ([print-brackets #f])
  (let ([p (open-output-string)])
    (pretty-print &apos;(let ([x 3]) x) p) \Rightarrow &quot;(let ((x 3)) x)
    (get-output-string p)))            &quot;
</code></pre><p>thread parameter: <code>print-extended-identifiers</code>
libraries: (chezscheme)</p>
<p>Chez Scheme extends the syntax of identifiers as described in Section 1.1, except within a set of forms prefixed by #!r6rs (which is implied by in a library or top-level program).
Chez Scheme &#x6269;&#x5C55;&#x4E86; 1.1 &#x8282;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x8BED;&#x6CD5;&#xFF0C;&#x9664;&#x4E86;&#x5728;&#x4E00;&#x7EC4;&#x4EE5;#!r6rs &#x4E3A;&#x524D;&#x7F00;&#x7684;&#x5F62;&#x5F0F;&#x4E2D;&#xFF08;&#x6697;&#x542B;&#x5728;&#x5E93;&#x6216;&#x9876;&#x5C42;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF09;&#x3002;</p>
<p>When this parameter is set to false (the default), identifiers in the extended set are printed with hex scalar value escapes as necessary to conform to the R6RS syntax for identifiers. When this parameter is set to a true value, identifiers in the extended set are printed without the escapes. Identifiers whose names fall outside of both syntaxes are printed with the escapes regardless of the setting of this parameter.
&#x5F53;&#x6B64;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x8BBE;&#x7F6E;&#x4E3A;&#x5047;&#xFF08;&#x9ED8;&#x8BA4;&#x503C;&#xFF09;&#x65F6;&#xFF0C;&#x6253;&#x5370;&#x6269;&#x5C55;&#x96C6;&#x4E2D;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x5C06;&#x6839;&#x636E;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6807;&#x91CF;&#x503C;&#x8F6C;&#x4E49;&#xFF0C;&#x4EE5;&#x7B26;&#x5408;&#x6807;&#x8BC6;&#x7B26;&#x7684; R6RS &#x8BED;&#x6CD5;&#x3002;&#x5F53;&#x6B64;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x8BBE;&#x7F6E;&#x4E3A;&#x771F;&#x503C;&#x65F6;&#xFF0C;&#x6253;&#x5370;&#x6269;&#x5C55;&#x96C6;&#x4E2D;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x5C06;&#x4E0D;&#x8FDB;&#x884C;&#x8F6C;&#x4E49;&#x3002;&#x65E0;&#x8BBA;&#x6B64;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x8BBE;&#x7F6E;&#x4E3A;&#x4F55;&#x503C;&#xFF0C;&#x540D;&#x79F0;&#x8D85;&#x51FA;&#x4E24;&#x79CD;&#x8BED;&#x6CD5;&#x8303;&#x56F4;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x6253;&#x5370;&#x65F6;&#x90FD;&#x5C06;&#x4F7F;&#x7528;&#x8F6C;&#x4E49;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code>(parameterize ([print-extended-identifiers #f])
  (printf &quot;~s\n~s\n&quot;
    &apos;(1+ --- { } .xyz)
    (string-&gt;symbol &quot;123&quot;)))
</code></pre><p>&#x6253;&#x5370;</p>
<pre><code>(\x31;+ \x2D;-- \x7B; \x7D; \x2E;xyz)
\x31;23
</code></pre><p>&#x800C;</p>
<pre><code>(parameterize ([print-extended-identifiers #t])
  (printf &quot;~s\n~s\n&quot;
    &apos;(1+ --- { } .xyz)
    (string-&gt;symbol &quot;123&quot;)))
</code></pre><p>&#x6253;&#x5370;</p>
<pre><code>(1+ --- { } .xyz)
\x31;23
</code></pre><p>thread parameter: <code>print-vector-length</code>
libraries: (chezscheme)</p>
<p>When print-vector-length is set to a true value, write, put-datum, and pretty-print includes the length for all vectors between the &quot;#&quot; and open parenthesis, all bytevectors between the &quot;#vu8&quot; and open parenthesis, and all fxvectors between the &quot;#vfx&quot; and open parenthesis. This parameter is set to #f by default.
&#x5F53; print-vector-length &#x8BBE;&#x7F6E;&#x4E3A;&#x771F;&#x503C;&#x65F6;&#xFF0C;write&#xFF0C;put-datum &#x548C; pretty-print &#x5305;&#x542B;&#x6240;&#x6709;&#x5411;&#x91CF;&#x5728;&quot;#&quot;&#x548C;&#x5DE6;&#x62EC;&#x53F7;&#x4E4B;&#x95F4;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x6240;&#x6709;&#x5B57;&#x8282;&#x5411;&#x91CF;&#x5728;&quot;#vu8&quot;&#x548C;&#x5DE6;&#x62EC;&#x53F7;&#x4E4B;&#x95F4;&#x7684;&#x957F;&#x5EA6;&#xFF0C; &#x4EE5;&#x53CA;&#x6240;&#x6709; fxvector&#xFF08;&#x5B9A;&#x957F;&#x6570;&#x5411;&#x91CF;&#xFF09;&#x5728;&quot;#vfx&quot;&#x548C;&#x5DE6;&#x62EC;&#x53F7;&#x4E4B;&#x95F4;&#x7684;&#x957F;&#x5EA6;&#x3002;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6B64;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x4E3A;#f.</p>
<p>When print-vector-length is set to a true value, write, put-datum, and pretty-print also suppress duplicated trailing elements in the vector to reduce the amount of output. This form is also recognized by the reader.
&#x5F53; print-vector-length &#x8BBE;&#x7F6E;&#x4E3A;&#x771F;&#x503C;&#x65F6;&#xFF0C;write&#xFF0C;put-datum &#x548C; pretty-print &#x540C;&#x65F6;&#x4F1A;&#x7701;&#x7565;&#x5411;&#x91CF;&#x5C3E;&#x90E8;&#x7684;&#x91CD;&#x590D;&#x5143;&#x7D20;&#xFF0C;&#x4EE5;&#x51CF;&#x5C11;&#x8F93;&#x51FA;&#x91CF;&#x3002;&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#x4E5F;&#x53EF;&#x4EE5;&#x88AB;&#x8BFB;&#x53D6;&#x5668;&#x8BC6;&#x522B;&#x3002;</p>
<p>Since objects printed through the ~s option in the format control strings of format, printf, and fprintf are printed as with write, the printing of such objects is also affected by the setting of print-vector-length.
&#x7531;&#x4E8E;&#x901A;&#x8FC7; format&#xFF0C;printf &#x548C; fprintf &#x7684;&#x683C;&#x5F0F;&#x63A7;&#x5236;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x7684;~s &#x9009;&#x9879;&#x6253;&#x5370;&#x7684;&#x5BF9;&#x8C61;&#x4E0E;&#x4F7F;&#x7528; write &#x6253;&#x5370;&#x65F6;&#x4E00;&#x6837;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x7C7B;&#x5BF9;&#x8C61;&#x7684;&#x6253;&#x5370;&#x4E5F;&#x4F1A;&#x53D7;&#x5230; print-vector-length &#x7684;&#x8BBE;&#x7F6E;&#x5F71;&#x54CD;&#x3002;</p>
<pre><code>(format &quot;~s&quot; (vector &apos;a &apos;b &apos;c &apos;c &apos;c)) \Rightarrow &quot;#(a b c c c)&quot;

(parameterize ([print-vector-length #t])
  (format &quot;~s&quot; (vector &apos;a &apos;b &apos;c &apos;c &apos;c))) \Rightarrow &quot;#5(a b c)&quot;

(parameterize ([print-vector-length #t])
  (format &quot;~s&quot; (bytevector 1 2 3 4 4 4))) \Rightarrow &quot;#6vu8(1 2 3 4)&quot;

(parameterize ([print-vector-length #t])
  (format &quot;~s&quot; (fxvector 1 2 3 4 4 4))) \Rightarrow &quot;#6vfx(1 2 3 4)&quot;
</code></pre><p>thread parameter: <code>print-precision</code>
libraries: (chezscheme)</p>
<p>When print-precision is set to #f (the default), write, put-datum, pretty-print, and the format &quot;~s&quot; directive do not include the vertical-bar &quot;mantissa-width&quot; syntax after each floating-point number. When set to a nonnegative exact integer, the mantissa width is included, as per the precision argument to number-&gt;string.
&#x5F53; print-precision &#x8BBE;&#x7F6E;&#x4E3A;#f&#xFF08;&#x9ED8;&#x8BA4;&#x503C;&#xFF09;&#x65F6;&#xFF0C;write&#xFF0C;put-datum&#xFF0C;pretty-print &#x548C; format &#x7684; &#x201C;~s&#x201D;&#x6307;&#x4EE4;&#x5728;&#x6BCF;&#x4E2A;&#x6D6E;&#x70B9;&#x6570;&#x540E;&#x4E0D;&#x5305;&#x62EC;&#x7AD6;&#x6760;&#x201C;&#x5C0F;&#x6570;&#x5BBD;&#x5EA6;&#x201D;&#x8BED;&#x6CD5;&#x3002;&#x5F53;&#x8BBE;&#x7F6E;&#x4E3A;&#x975E;&#x8D1F;&#x7CBE;&#x786E;&#x6574;&#x6570;&#x65F6;&#xFF0C;&#x5C06;&#x5305;&#x62EC;&#x5C0F;&#x6570;&#x5BBD;&#x5EA6;&#xFF0C;&#x6839;&#x636E; number-&gt;string &#x7684; precision &#x53C2;&#x6570;&#x3002;</p>
<p>thread parameter: <code>print-unicode</code>
libraries: (chezscheme)</p>
<p>When print-unicode is set to #f, write, put-datum, pretty-print, and the format &quot;~s&quot; directive display Unicode characters with encodings 8016 (128) and above that appear within character objects, symbols, and strings using hexadecimal character escapes. When set to a true value (the default), they are displayed like other printing characters, as if by put-char.
&#x5F53; print-unicode &#x8BBE;&#x7F6E;&#x4E3A;#f &#x65F6;&#xFF0C;write&#xFF0C;put-datum&#xFF0C;pretty-print &#x548C; format &#x7684; &quot;~s&quot;&#x6307;&#x4EE4;&#x663E;&#x793A;&#x7F16;&#x7801; 8016&#xFF08;128&#xFF09;&#x53CA;&#x4EE5;&#x4E0A;&#x7684; Unicode &#x5B57;&#x7B26;&#xFF0C;&#x8FD9;&#x4E9B;&#x5B57;&#x7B26;&#x4F7F;&#x7528;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x5B57;&#x7B26;&#x8F6C;&#x4E49;&#x51FA;&#x73B0;&#x5728;&#x5B57;&#x7B26;&#x5BF9;&#x8C61;&#xFF0C;&#x7B26;&#x53F7;&#x548C;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x3002;&#x8BBE;&#x7F6E;&#x4E3A;&#x771F;&#x503C;&#xFF08;&#x9ED8;&#x8BA4;&#x503C;&#xFF09;&#x65F6;&#xFF0C;&#x5B83;&#x4EEC;&#x4F1A;&#x50CF;&#x5176;&#x4ED6;&#x6253;&#x5370;&#x5B57;&#x7B26;&#x4E00;&#x6837;&#x663E;&#x793A;&#xFF0C;&#x5C31;&#x50CF;&#x4F7F;&#x7528; put-char &#x4E00;&#x6837;&#x3002;</p>
<pre><code>(format &quot;~s&quot; #\x3bb) \Rightarrow &quot;#\\\lambda&quot;
(parameterize ([print-unicode #f])
  (format &quot;~s&quot; #\x3bb)) \Rightarrow &quot;#\\x3BB&quot;
</code></pre><h2 id="915-&#x5FEB;&#x901F;&#x52A0;&#x8F7D;&#xFF08;fasl&#xFF09;&#x8F93;&#x51FA;">9.15. &#x5FEB;&#x901F;&#x52A0;&#x8F7D;&#xFF08;Fasl&#xFF09;&#x8F93;&#x51FA;</h2>
<p>The procedures write and pretty-print print objects in a human readable format. For objects with external datum representations, the output produced by write and pretty-print is also machine-readable with read. Objects with external datum representations include pairs, symbols, vectors, strings, numbers, characters, booleans, and records but not procedures and ports.
&#x8FC7;&#x7A0B; write &#x548C; pretty-print &#x4EE5;&#x4EBA;&#x7C7B;&#x53EF;&#x8BFB;&#x7684;&#x683C;&#x5F0F;&#x6253;&#x5370;&#x5BF9;&#x8C61;&#x3002;&#x5BF9;&#x4E8E;&#x5177;&#x6709;&#x5916;&#x90E8;&#x6570;&#x636E;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;write &#x548C; pretty-print &#x4EA7;&#x751F;&#x7684;&#x8F93;&#x51FA;&#x540C;&#x6837;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; read &#x88AB;&#x673A;&#x5668;&#x8BFB;&#x53D6;&#x3002;&#x5177;&#x6709;&#x5916;&#x90E8;&#x6570;&#x636E;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#x7684;&#x5BF9;&#x8C61;&#x5305;&#x62EC;&#x70B9;&#x5BF9;&#xFF0C;&#x7B26;&#x53F7;&#xFF0C;&#x5411;&#x91CF;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x6570;&#x5B57;&#xFF0C;&#x5B57;&#x7B26;&#xFF0C;&#x5E03;&#x5C14;&#x503C;&#x548C;&#x8BB0;&#x5F55;&#xFF0C;&#x4F46;&#x4E0D;&#x5305;&#x62EC;&#x8FC7;&#x7A0B;&#x548C;&#x7AEF;&#x53E3;&#x3002;</p>
<p>An alternative fast loading, or fasl, format may be used for objects with external datum representations. The fasl format is not human readable, but it is machine readable and both more compact and more quickly processed by read. This format is always used for compiled code generated by compile-file, but it may also be used for data that needs to be written and read quickly, such as small databases encoded with Scheme data structures.
&#x4E00;&#x79CD;&#x53EF;&#x9009;&#x7684;&#x5FEB;&#x901F;&#x52A0;&#x8F7D;&#xFF08;&#x6216;&#x79F0; <em>fasl</em> &#xFF09;&#x683C;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5177;&#x6709;&#x5916;&#x90E8;&#x6570;&#x636E;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#x7684;&#x5BF9;&#x8C61;&#x3002;fasl &#x683C;&#x5F0F;&#x4E0D;&#x662F;&#x4EBA;&#x7C7B;&#x53EF;&#x8BFB;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x673A;&#x5668;&#x53EF;&#x8BFB;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x66F4;&#x52A0;&#x7D27;&#x51D1;&#xFF0C;&#x4E14;&#x53EF;&#x4EE5;&#x88AB; read &#x66F4;&#x5FEB;&#x5730;&#x5904;&#x7406;&#x3002;&#x6B64;&#x683C;&#x5F0F;&#x603B;&#x662F;&#x7528;&#x4E8E; compile-file &#x751F;&#x6210;&#x7684;&#x7F16;&#x8BD1;&#x4EE3;&#x7801;&#xFF0C;&#x4F46;&#x4E5F;&#x53EF;&#x7528;&#x4E8E;&#x9700;&#x8981;&#x5FEB;&#x901F;&#x5199;&#x5165;&#x548C;&#x8BFB;&#x53D6;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F8B;&#x5982;&#x4F7F;&#x7528; Scheme &#x6570;&#x636E;&#x7ED3;&#x6784;&#x7F16;&#x7801;&#x7684;&#x5C0F;&#x578B;&#x6570;&#x636E;&#x5E93;&#x3002;</p>
<p>Objects are printed in fasl format with fasl-write. Because the fasl format is a binary format, fasl output must be written to a binary port. For this reason, it is not possible to include data written in fasl format with textual data in the same file, as was the case in earlier versions of Chez Scheme. Similarly, the (textual) reader does not handle objects written in fasl format; the procedure fasl-read, which requires a binary input port, must be used instead.
&#x5BF9;&#x8C61;&#x4F7F;&#x7528; fasl-write &#x6253;&#x5370;&#x4E3A; fasl &#x683C;&#x5F0F;&#x3002;&#x7531;&#x4E8E; fasl &#x683C;&#x5F0F;&#x662F;&#x4E8C;&#x8FDB;&#x5236;&#x683C;&#x5F0F;&#xFF0C;&#x56E0;&#x6B64;&#x5FC5;&#x987B;&#x5C06; fasl &#x8F93;&#x51FA;&#x5199;&#x5165;&#x5230;&#x4E8C;&#x8FDB;&#x5236;&#x7AEF;&#x53E3;&#x3002;&#x51FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x5C06;&#x4EE5; fasl &#x683C;&#x5F0F;&#x5199;&#x5165;&#x7684;&#x6570;&#x636E;&#x4E0E;&#x6587;&#x672C;&#x6570;&#x636E;&#x5305;&#x542B;&#x5728;&#x540C;&#x4E00;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x5C31;&#x50CF;&#x5728;&#x65E9;&#x671F;&#x7248;&#x672C;&#x7684; Chez Scheme &#x4E2D;&#x4E00;&#x6837;&#x3002;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#xFF08;&#x6587;&#x672C;&#xFF09;&#x8BFB;&#x53D6;&#x5668;&#x4E0D;&#x5904;&#x7406;&#x4EE5; fasl &#x683C;&#x5F0F;&#x5199;&#x5165;&#x7684;&#x5BF9;&#x8C61;&#xFF1B;&#x5FC5;&#x987B;&#x8F6C;&#x800C;&#x4F7F;&#x7528;&#x9700;&#x8981;&#x4E8C;&#x8FDB;&#x5236;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x7684;&#x8FC7;&#x7A0B; fasl-read.</p>
<p>procedure: <code>(fasl-write obj binary-output-port)</code>
procedure: <code>(fasl-read binary-input-port)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>fasl-write writes the fasl representation of obj to binary-output-port. An exception is raised with condition-type &amp;assertion if obj or any portion of obj has no external fasl representation, e.g., if obj is or contains a procedure.
fasl-write &#x5C06; obj &#x7684; fasl &#x8868;&#x793A;&#x5F62;&#x5F0F;&#x5199;&#x5165; binary-output-port. &#x5982;&#x679C; obj &#x6216; obj &#x7684;&#x4EFB;&#x4F55;&#x90E8;&#x5206;&#x6CA1;&#x6709;&#x5916;&#x90E8; fasl &#x8868;&#x793A;&#x5F62;&#x5F0F;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C; obj &#x662F;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x6216;&#x5305;&#x542B;&#x8FC7;&#x7A0B;&#xFF0C;&#x5219;&#x4F1A;&#x629B;&#x51FA;&#x6761;&#x4EF6;&#x7C7B;&#x578B;&#x7684; &amp;assertion &#x5F02;&#x5E38;&#x3002;</p>
<p>fasl-read reads one object from binary-input-port, which must be positioned at the front of an object written in fasl format. fasl-read returns the eof object if the file is positioned at the end of file.
fasl-read &#x4ECE; binary-input-port &#x8BFB;&#x53D6;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x8BE5;&#x7AEF;&#x53E3;&#x5FC5;&#x987B;&#x4F4D;&#x4E8E;&#x4EE5; fasl &#x683C;&#x5F0F;&#x5199;&#x5165;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x524D;&#x9762;&#x3002;&#x5982;&#x679C;&#x6587;&#x4EF6;&#x4F4D;&#x4E8E;&#x6587;&#x4EF6;&#x672B;&#x5C3E;&#xFF0C;&#x5219; fasl-read &#x8FD4;&#x56DE; eof &#x5BF9;&#x8C61;&#x3002;</p>
<pre><code>(define bop (open-file-output-port &quot;tmp.fsl&quot;))
(fasl-write &apos;(a b c) bop)
(close-port bop)

(define bip (open-file-input-port &quot;tmp.fsl&quot;))
(fasl-read bip) \Rightarrow (a b c)
(fasl-read bip) \Rightarrow #!eof
(close-port bip)
</code></pre><p>procedure: <code>(fasl-file ifn ofn)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>ifn and ofn must be strings. fasl-file may be used to convert a file in human-readable format into an equivalent file written in fasl format. fasl-file reads each object in turn from the file named by ifn and writes the fasl format for the object onto the file named by ofn. If the file named by ofn already exists, it is replaced.
ifn &#x548C; ofn &#x5FC5;&#x987B;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x3002;fasl-file &#x53EF;&#x7528;&#x4E8E;&#x5C06;&#x4EBA;&#x7C7B;&#x53EF;&#x8BFB;&#x683C;&#x5F0F;&#x7684;&#x6587;&#x4EF6;&#x8F6C;&#x6362;&#x4E3A;&#x4EE5; fasl &#x683C;&#x5F0F;&#x5199;&#x5165;&#x7684;&#x7B49;&#x4EF7;&#x6587;&#x4EF6;&#x3002;fasl-file &#x4ECE; ifn &#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x4E2D;&#x4F9D;&#x6B21;&#x8BFB;&#x53D6;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x5C06;&#x8BE5;&#x5BF9;&#x8C61;&#x7684; fasl &#x683C;&#x5F0F;&#x5199;&#x5165;&#x5230;&#x7531; ofn &#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x4E2D;&#x3002;&#x5982;&#x679C; ofn &#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x5DF2;&#x5B58;&#x5728;&#xFF0C;&#x5219;&#x66FF;&#x6362;&#x5B83;&#x3002;</p>
<h2 id="916-&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x63A5;&#x53E3;">9.16. &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x63A5;&#x53E3;</h2>
<p>This section describes operations on files, directories, and pathnames.
&#x672C;&#x8282;&#x4ECB;&#x7ECD;&#x6709;&#x5173;&#x6587;&#x4EF6;&#xFF0C;&#x76EE;&#x5F55;&#x548C;&#x8DEF;&#x5F84;&#x540D;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<p>global parameter: <code>current-directory</code>
global parameter: <code>cd</code>
libraries: (chezscheme)</p>
<p>When invoked without arguments, current-directory returns a string representing the current working directory. Otherwise, the current working directory is changed to the directory specified by the argument, which must be a string representing a valid directory pathname.
&#x5F53;&#x4E0D;&#x5E26;&#x53C2;&#x6570;&#x8C03;&#x7528;&#x65F6;&#xFF0C;current-directory &#x8FD4;&#x56DE;&#x8868;&#x793A;&#x5F53;&#x524D;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x5F53;&#x524D;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x5C06;&#x66F4;&#x6539;&#x4E3A;&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x7684;&#x76EE;&#x5F55;&#xFF0C;&#x8BE5;&#x53C2;&#x6570;&#x5FC5;&#x987B;&#x662F;&#x8868;&#x793A;&#x6709;&#x6548;&#x76EE;&#x5F55;&#x8DEF;&#x5F84;&#x540D;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<p>cd is bound to the same parameter.
cd &#x88AB;&#x7ED1;&#x5B9A;&#x4E3A;&#x540C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x5BF9;&#x8C61;&#x3002;</p>
<p>procedure: <code>(directory-list path)</code>
&#x8FD4;&#x56DE;&#xFF1A;&#x6587;&#x4EF6;&#x540D;&#x5217;&#x8868;
libraries: (chezscheme)</p>
<p>path must be a string. The return value is a list of strings representing the names of files found in the directory named by path. directory-list raises an exception with condition type &amp;i/o-filename if path does not name a directory or if the process cannot list the directory.
path &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x8FD4;&#x56DE;&#x503C;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x5217;&#x8868;&#xFF0C;&#x8868;&#x793A;&#x5728; path &#x6307;&#x5B9A;&#x7684;&#x76EE;&#x5F55;&#x4E2D;&#x627E;&#x5230;&#x7684;&#x6587;&#x4EF6;&#x7684;&#x540D;&#x79F0;&#x3002;&#x5982;&#x679C; path &#x6CA1;&#x6709;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x6216;&#x8FDB;&#x7A0B;&#x65E0;&#x6CD5;&#x5217;&#x51FA;&#x76EE;&#x5F55;&#xFF0C;&#x5219; directory-list &#x4F1A;&#x629B;&#x51FA;&#x6761;&#x4EF6;&#x7C7B;&#x578B;&#x7684;&amp;i/o-filename &#x5F02;&#x5E38;&#x3002;</p>
<p>procedure: <code>(file-exists? path)</code>
procedure: <code>(file-exists? path follow?)</code>
&#x8FD4;&#x56DE;: &#x5982;&#x679C; <code>path</code> &#x6307;&#x5B9A;&#x7684;&#x6587;&#x4EF6;&#x5B58;&#x5728;&#xFF0C;&#x5219;&#x4E3A; <code>#t</code>, &#x5426;&#x5219;&#x4E3A; <code>#f</code>.
libraries: (chezscheme)</p>
<p>path must be a string. If the optional follow? argument is true (the default), file-exists? follows symbolic links; otherwise it does not. Thus, file-exists? will return #f when handed the pathname of a broken symbolic link unless follow? is provided and is #f.
path &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x5982;&#x679C;&#x53EF;&#x9009;&#x7684; follow? &#x53C2;&#x6570;&#x4E3A;&#x771F;&#xFF08;&#x9ED8;&#x8BA4;&#x503C;&#xFF09;&#xFF0C;&#x5219; file-exists? &#x4F1A;&#x8DDF;&#x968F;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#xFF1B;&#x5426;&#x5219;&#x5B83;&#x4E0D;&#x4F1A;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5F53;&#x4F20;&#x5165;&#x7684;&#x8DEF;&#x5F84;&#x540D;&#x4E3A;&#x635F;&#x574F;&#x7684;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#x65F6;&#xFF0C;file-exists? &#x4F1A;&#x8FD4;&#x56DE; #f, &#x9664;&#x975E;&#x63D0;&#x4F9B;&#x53C2;&#x6570; follow?, &#x4E14;&#x5176;&#x503C;&#x4E3A; #f.</p>
<p>The Revised6 Report file-exists? does not accept the optional follow? argument. Whether it follows symbolic links is unspecified.
R<sup>6</sup>RS &#x4E2D;&#x7684; file-exists? &#x4E0D;&#x63A5;&#x53D7;&#x53EF;&#x9009;&#x7684; follow? &#x53C2;&#x6570;&#x3002;&#x5B83;&#x662F;&#x5426;&#x8DDF;&#x968F;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#x662F;&#x672A;&#x6307;&#x5B9A;&#x7684;&#x3002;</p>
<p>procedure: <code>(file-regular? path)</code>
procedure: <code>(file-regular? path follow?)</code>
&#x8FD4;&#x56DE;: &#x5982;&#x679C; <code>path</code> &#x6307;&#x5B9A;&#x7684;&#x6587;&#x4EF6;&#x662F;&#x4E00;&#x4E2A;&#x5E38;&#x89C4;&#x6587;&#x4EF6;&#xFF0C;&#x5219;&#x4E3A; <code>#t</code>, &#x5426;&#x5219;&#x4E3A; <code>#f</code>.
libraries: (chezscheme)</p>
<p>path must be a string. If the optional follow? argument is true (the default), file-regular? follows symbolic links; otherwise it does not.
path &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x5982;&#x679C;&#x53EF;&#x9009;&#x7684; follow? &#x53C2;&#x6570;&#x4E3A;&#x771F;&#xFF08;&#x9ED8;&#x8BA4;&#x503C;&#xFF09;&#xFF0C;&#x5219; file-regular? &#x4F1A;&#x8DDF;&#x968F;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#xFF1B;&#x5426;&#x5219;&#x5B83;&#x4E0D;&#x4F1A;&#x3002;</p>
<p>procedure: <code>(file-directory? path)</code>
procedure: <code>(file-directory? path follow?)</code>
&#x8FD4;&#x56DE;: &#x5982;&#x679C; <code>path</code> &#x6307;&#x5B9A;&#x7684;&#x6587;&#x4EF6;&#x662F;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x5219;&#x4E3A; <code>#t</code>, &#x5426;&#x5219;&#x4E3A; <code>#f</code>.
libraries: (chezscheme)</p>
<p>path must be a string. If the optional follow? argument is true (the default), this procedure follows symbolic links; otherwise it does not.
path &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x5982;&#x679C;&#x53EF;&#x9009;&#x7684; follow? &#x53C2;&#x6570;&#x4E3A;&#x771F;&#xFF08;&#x9ED8;&#x8BA4;&#x503C;&#xFF09;&#xFF0C;&#x5219;&#x6B64;&#x8FC7;&#x7A0B;&#x4F1A;&#x8DDF;&#x968F;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#xFF1B;&#x5426;&#x5219;&#x5B83;&#x4E0D;&#x4F1A;&#x3002;</p>
<p>procedure: <code>(file-symbolic-link? path)</code>
&#x8FD4;&#x56DE;: &#x5982;&#x679C; <code>path</code> &#x6307;&#x5B9A;&#x7684;&#x6587;&#x4EF6;&#x662F;&#x4E00;&#x4E2A;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#xFF0C;&#x5219;&#x4E3A; <code>#t</code>, &#x5426;&#x5219;&#x4E3A; <code>#f</code>.
libraries: (chezscheme)</p>
<p>path must be a string. file-symbolic-link? never follows symbolic links in making its determination.
path &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;file-symbolic-link? &#x5728;&#x505A;&#x51FA;&#x5224;&#x5B9A;&#x65F6;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x8DDF;&#x968F;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#x3002;</p>
<p>procedure: <code>(file-access-time path/port)</code>
procedure: <code>(file-access-time path/port follow?)</code>
&#x8FD4;&#x56DE;&#xFF1A;&#x6307;&#x5B9A;&#x6587;&#x4EF6;&#x7684;&#x8BBF;&#x95EE;&#x65F6;&#x95F4;
procedure: <code>(file-change-time path/port)</code>
procedure: <code>(file-change-time path/port follow?)</code>
&#x8FD4;&#x56DE;&#xFF1A;&#x6307;&#x5B9A;&#x6587;&#x4EF6;&#x7684;&#x66F4;&#x6539;&#x65F6;&#x95F4;
procedure: <code>(file-modification-time path/port)</code>
procedure: <code>(file-modification-time path/port follow?)</code>
&#x8FD4;&#x56DE;&#xFF1A;&#x6307;&#x5B9A;&#x6587;&#x4EF6;&#x7684;&#x4FEE;&#x6539;&#x65F6;&#x95F4;
libraries: (chezscheme)</p>
<p>path/port must be a string or port. If path/port is a string, the time returned is for the file named by the string, and the optional follow? argument determines whether symbolic links are followed. If follow? is true (the default), this procedure follows symbolic links; otherwise it does not. If path/port is a port, it must be a file port, and the time returned is for the associated file. In this case, follow? is ignored.
path/port &#x5FC5;&#x987B;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x6216;&#x7AEF;&#x53E3;&#x3002;&#x5982;&#x679C; path/port &#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;&#x7684;&#x65F6;&#x95F4;&#x662F;&#x5173;&#x4E8E;&#x7531;&#x5B57;&#x7B26;&#x4E32;&#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x9009;&#x7684; follow? &#x53C2;&#x6570;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x8DDF;&#x968F;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#x3002;&#x5982;&#x679C; follow? &#x4E3A;&#x771F;&#xFF08;&#x9ED8;&#x8BA4;&#x503C;&#xFF09;&#xFF0C;&#x5219;&#x6B64;&#x8FC7;&#x7A0B;&#x4F1A;&#x8DDF;&#x968F;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#xFF1B;&#x5426;&#x5219;&#x5B83;&#x4E0D;&#x4F1A;&#x3002;&#x5982;&#x679C; path/port &#x662F;&#x7AEF;&#x53E3;&#xFF0C;&#x5219;&#x5B83;&#x5FC5;&#x987B;&#x662F;&#x6587;&#x4EF6;&#x7AEF;&#x53E3;&#xFF0C;&#x5E76;&#x4E14;&#x8FD4;&#x56DE;&#x7684;&#x65F6;&#x95F4;&#x662F;&#x5173;&#x4E8E;&#x5173;&#x8054;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F1A;&#x5FFD;&#x7565;&#x53C2;&#x6570; follow?.</p>
<p>The returned times are represented as time objects (Section 12.10).
&#x8FD4;&#x56DE;&#x7684;&#x65F6;&#x95F4;&#x8868;&#x793A;&#x4E3A;&#x65F6;&#x95F4;&#x5BF9;&#x8C61;&#xFF08;&#x7B2C; 12.10 &#x8282;&#xFF09;&#x3002;</p>
<p>procedure: <code>(mkdir path)</code>
procedure: <code>(mkdir path mode)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>path must be a string. mode must be a fixnum.
path &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;mode &#x5FC5;&#x987B;&#x662F; fixnum.</p>
<p>mkdir creates a directory with the name given by path. All path path components leading up to the last must already exist. If the optional mode argument is present, it overrides the default permissions for the new directory. Under Windows, the mode argument is ignored.
mkdir &#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x540D;&#x79F0;&#x7531; path &#x7ED9;&#x51FA;&#x7684;&#x76EE;&#x5F55;&#x3002;path &#x7684;&#x6240;&#x6709;&#x8DEF;&#x5F84;&#x7EC4;&#x4EF6;&#x4ECE;&#x5934;&#x5230;&#x5C3E;&#x90FD;&#x5FC5;&#x987B;&#x5DF2;&#x5B58;&#x5728;&#x3002;&#x5982;&#x679C;&#x63D0;&#x4F9B;&#x4E86;&#x53EF;&#x9009;&#x7684; mode &#x53C2;&#x6570;&#xFF0C;&#x5219;&#x5B83;&#x5C06;&#x8986;&#x76D6;&#x65B0;&#x76EE;&#x5F55;&#x7684;&#x9ED8;&#x8BA4;&#x6743;&#x9650;&#x3002;&#x5728; Windows &#x4E0B;&#xFF0C;mode &#x53C2;&#x6570;&#x5C06;&#x88AB;&#x5FFD;&#x7565;&#x3002;</p>
<p>mkdir raises an exception with condition type &amp;i/o-filename if the directory cannot be created.
&#x5982;&#x679C;&#x76EE;&#x5F55;&#x65E0;&#x6CD5;&#x521B;&#x5EFA;&#xFF0C;&#x5219; mkdir &#x4F1A;&#x629B;&#x51FA;&#x6761;&#x4EF6;&#x7C7B;&#x578B;&#x7684;&amp;i/o-filename &#x5F02;&#x5E38;&#x3002;</p>
<p>procedure: <code>(delete-file path)</code>
procedure: <code>(delete-file path error?)</code>
returns: &#x53C2;&#x89C1;&#x4E0B;&#x6587;
libraries: (chezscheme)</p>
<p>path must be a string. delete-file removes the file named by path. If the optional error? argument is #f (the default), delete-file returns a boolean value: #t if the operation is successful and #f if it is not. Otherwise, delete-file returns an unspecified value if the operation is successful and raises an exception with condition type &amp;i/o-filename if it is not.
path &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;delete-file &#x5220;&#x9664; path &#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x5982;&#x679C;&#x53EF;&#x9009;&#x7684; error? &#x53C2;&#x6570;&#x4E3A; #f&#xFF08;&#x9ED8;&#x8BA4;&#x503C;&#xFF09;&#xFF0C;&#x5219; delete-file &#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5E03;&#x5C14;&#x503C;&#xFF1A;&#x5982;&#x679C;&#x64CD;&#x4F5C;&#x6210;&#x529F;&#x5219;&#x8FD4;&#x56DE;#t&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x6210;&#x529F;&#x5219;&#x8FD4;&#x56DE;#f. &#x5426;&#x5219;&#xFF0C;&#x5982;&#x679C;&#x64CD;&#x4F5C;&#x6210;&#x529F;&#xFF0C;&#x5219; delete-file &#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x6210;&#x529F;&#xFF0C;&#x5219;&#x629B;&#x51FA;&#x6761;&#x4EF6;&#x7C7B;&#x578B;&#x7684;&amp;i/o-filename &#x5F02;&#x5E38;&#x3002;</p>
<p>The Revised6 Report delete-file does not accept the optional error? argument but behaves as if error? is true.
R<sup>6</sup>RS &#x4E2D;&#x7684; delete-file &#x4E0D;&#x63A5;&#x53D7;&#x53EF;&#x9009;&#x7684; error? &#x53C2;&#x6570;&#xFF0C;&#x4F46;&#x5176;&#x884C;&#x4E3A;&#x5982;&#x540C; error? &#x4E3A;&#x771F;&#x3002;</p>
<p>procedure: <code>(delete-directory path)</code>
procedure: <code>(delete-directory path error?)</code>
returns: &#x53C2;&#x89C1;&#x4E0B;&#x6587;
libraries: (chezscheme)</p>
<p>path must be a string. delete-directory removes the directory named by path. If the optional error? argument is #f (the default), delete-directory returns a boolean value: #t if the operation is successful and #f if it is not. Otherwise, delete-directory returns an unspecified value if the operation is successful and raises an exception with condition type &amp;i/o-filename if it is not. The behavior is unspecified if the directory is not empty, but on most systems the operations will not succeed.
path &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;delete-directory &#x5220;&#x9664; path &#x547D;&#x540D;&#x7684;&#x76EE;&#x5F55;&#x3002;&#x5982;&#x679C;&#x53EF;&#x9009;&#x7684; error? &#x53C2;&#x6570;&#x4E3A; #f&#xFF08;&#x9ED8;&#x8BA4;&#x503C;&#xFF09;&#xFF0C;delete-directory &#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5E03;&#x5C14;&#x503C;&#xFF1A;&#x5982;&#x679C;&#x64CD;&#x4F5C;&#x6210;&#x529F;&#x5219;&#x8FD4;&#x56DE;#t, &#x5982;&#x679C;&#x4E0D;&#x6210;&#x529F;&#x5219;&#x8FD4;&#x56DE;#f. &#x5426;&#x5219;&#xFF0C;&#x5982;&#x679C;&#x64CD;&#x4F5C;&#x6210;&#x529F;&#xFF0C;&#x5219; delete-directory &#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x6210;&#x529F;&#xFF0C;&#x5219;&#x629B;&#x51FA;&#x6761;&#x4EF6;&#x7C7B;&#x578B;&#x7684;&amp;i/o-filename &#x5F02;&#x5E38;&#x3002;&#x5982;&#x679C;&#x76EE;&#x5F55;&#x4E0D;&#x4E3A;&#x7A7A;&#xFF0C;&#x5219;&#x884C;&#x4E3A;&#x662F;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x4F46;&#x5728;&#x5927;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x64CD;&#x4F5C;&#x5C06;&#x4E0D;&#x4F1A;&#x6210;&#x529F;&#x3002;</p>
<p>procedure: <code>(rename-file old-pathname new-pathname)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>old-pathname and new-pathname must be strings. rename-file changes the name of the file named by old-pathname to new-pathname. If the file does not exist or cannot be renamed, an exception is raised with condition type &amp;i/o-filename.
old-pathname &#x548C; new-pathname &#x5FC5;&#x987B;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x3002;rename-file &#x5C06; old-pathname &#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x66F4;&#x6539;&#x4E3A; new-pathname. &#x5982;&#x679C;&#x6587;&#x4EF6;&#x4E0D;&#x5B58;&#x5728;&#x6216;&#x65E0;&#x6CD5;&#x91CD;&#x547D;&#x540D;&#xFF0C;&#x5219;&#x4F1A;&#x629B;&#x51FA;&#x6761;&#x4EF6;&#x7C7B;&#x578B;&#x7684;&amp;i/o-filename &#x5F02;&#x5E38;&#x3002;</p>
<p>procedure: <code>(chmod path mode)</code>
returns: unspecified
libraries: (chezscheme)</p>
<p>path must be a string. mode must be a fixnum.
path &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;mode &#x5FC5;&#x987B;&#x662F; fixnum.</p>
<p>chmod sets the permissions on the file named by path to mode. Bits 0, 1, and 2 of mode are the execute, write, and read permission bits for users other than the file&apos;s owner who are not in the file&apos;s group. Bits 3-5 are the execute, write, and read permission bits for users other than the file&apos;s owner but in the file&apos;s group. Bits 6-8 are the execute, write, and read permission bits for the file&apos;s owner. Bits 7-9 are the Unix sticky, set-group-id, and set-user-id bits. Under Windows, all but the user &quot;write&quot; bit are ignored. If the file does not exist or the permissions cannot be changed, an exception is raised with condition type &amp;i/o-filename.
chmod &#x5C06; path &#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x6743;&#x9650;&#x8BBE;&#x7F6E;&#x4E3A; mode. mode &#x7684;&#x7B2C; 0,1 &#x548C; 2 &#x4F4D;&#x662F;&#x6267;&#x884C;&#xFF0C;&#x5199;&#x5165;&#x548C;&#x8BFB;&#x53D6;&#x6743;&#x9650;&#x4F4D;&#xFF0C;&#x9488;&#x5BF9;&#x6587;&#x4EF6;&#x6240;&#x6709;&#x8005;&#x4EE5;&#x5916;&#xFF0C;&#x4E0D;&#x5728;&#x6587;&#x4EF6;&#x7EC4;&#x4E2D;&#x7684;&#x7528;&#x6237;&#x3002;&#x7B2C; 3-5 &#x4F4D;&#x662F;&#x9664;&#x6587;&#x4EF6;&#x6240;&#x6709;&#x8005;&#x4E4B;&#x5916;&#x4F46;&#x5728;&#x6587;&#x4EF6;&#x7EC4;&#x4E2D;&#x7684;&#x7528;&#x6237;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x5199;&#x5165;&#x548C;&#x8BFB;&#x53D6;&#x6743;&#x9650;&#x4F4D;&#x3002;&#x7B2C; 6-8 &#x4F4D;&#x662F;&#x6587;&#x4EF6;&#x6240;&#x6709;&#x8005;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x5199;&#x5165;&#x548C;&#x8BFB;&#x53D6;&#x6743;&#x9650;&#x4F4D;&#x3002;&#x7B2C; 7-9 &#x4F4D;&#x662F; Unix sticky&#xFF0C;set-group-id &#x548C; set-user-id &#x4F4D;&#x3002;&#x5728; Windows &#x4E0B;&#xFF0C;&#x9664;&#x4E86;&#x7528;&#x6237;&#x201C;&#x5199;&#x5165;&#x201D;&#x4F4D;&#x4E4B;&#x5916;&#x7684;&#x6240;&#x6709;&#x4F4D;&#x90FD;&#x88AB;&#x5FFD;&#x7565;&#x3002;&#x5982;&#x679C;&#x6587;&#x4EF6;&#x4E0D;&#x5B58;&#x5728;&#x6216;&#x65E0;&#x6CD5;&#x66F4;&#x6539;&#x6743;&#x9650;&#xFF0C;&#x5219;&#x4F1A;&#x629B;&#x51FA;&#x6761;&#x4EF6;&#x7C7B;&#x578B;&#x7684;&amp;i/o-filename &#x5F02;&#x5E38;&#x3002;</p>
<p>procedure: <code>(get-mode path)</code>
procedure: <code>(get-mode path follow?)</code>
&#x8FD4;&#x56DE;&#xFF1A;path &#x7684;&#x5F53;&#x524D;&#x6743;&#x9650;&#x6A21;&#x5F0F;
libraries: (chezscheme)</p>
<p>path must be a string. get-mode retrieves the permissions on the file named by path and returns them as a fixnum in the same form as the mode argument to chmod. If the optional follow? argument is true (the default), this procedure follows symbolic links; otherwise it does not.
path &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;get-mode &#x83B7;&#x53D6;&#x7531; path &#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x7684;&#x6743;&#x9650;&#xFF0C;&#x5E76;&#x4EE5;&#x4E0E; chmod &#x7684; mode &#x53C2;&#x6570;&#x76F8;&#x540C;&#x7684;&#x5F62;&#x5F0F;&#x5C06;&#x5B83;&#x4EEC;&#x4F5C;&#x4E3A; fixnum &#x8FD4;&#x56DE;&#x3002;&#x5982;&#x679C;&#x53EF;&#x9009;&#x7684; follow? &#x53C2;&#x6570;&#x4E3A;&#x771F;&#xFF08;&#x9ED8;&#x8BA4;&#x503C;&#xFF09;&#xFF0C;&#x5219;&#x6B64;&#x8FC7;&#x7A0B;&#x4F1A;&#x8DDF;&#x968F;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#xFF1B;&#x5426;&#x5219;&#x5B83;&#x4E0D;&#x4F1A;&#x3002;</p>
<p>procedure: <code>(directory-separator? char)</code>
&#x8FD4;&#x56DE;: &#x5982;&#x679C; <code>char</code> &#x662F;&#x6587;&#x4EF6;&#x5206;&#x9694;&#x7B26;&#xFF0C;&#x5219;&#x4E3A; <code>#t</code>, &#x5426;&#x5219;&#x4E3A; <code>#f</code>.
libraries: (chezscheme)</p>
<p>The character #\/ is a directory separator on all current machine types, and #\\ is a directory separator under Windows.
&#x5B57;&#x7B26;#\/&#x662F;&#x6240;&#x6709;&#x5F53;&#x524D;&#x8BA1;&#x7B97;&#x673A;&#x7C7B;&#x578B;&#x4E0A;&#x7684;&#x76EE;&#x5F55;&#x5206;&#x9694;&#x7B26;&#xFF0C;#\\&#x662F; Windows &#x4E0B;&#x7684;&#x76EE;&#x5F55;&#x5206;&#x9694;&#x7B26;&#x3002;</p>
<p>procedure: <code>(directory-separator)</code>
&#x8FD4;&#x56DE;&#xFF1A;&#x9996;&#x9009;&#x76EE;&#x5F55;&#x5206;&#x9694;&#x7B26;
libraries: (chezscheme)</p>
<p>The preferred directory separator is #\\ for Windows and #\/ for other systems.
Windows &#x4E0A;&#x7684;&#x9996;&#x9009;&#x76EE;&#x5F55;&#x5206;&#x9694;&#x7B26;&#x662F;#\\, &#x5176;&#x5B83;&#x7CFB;&#x7EDF;&#x4E0A;&#x662F; #\/.</p>
<p>procedure: <code>(path-first path)</code>
procedure: <code>(path-rest path)</code>
procedure: <code>(path-last path)</code>
procedure: <code>(path-parent path)</code>
procedure: <code>(path-extension path)</code>
procedure: <code>(path-root path)</code>
returns: path &#x7684;&#x6307;&#x5B9A;&#x7EC4;&#x4EF6;
procedure: <code>(path-absolute? path)</code>
&#x8FD4;&#x56DE;: &#x5982;&#x679C; <code>path</code> &#x662F;&#x7EDD;&#x5BF9;&#x8DEF;&#x5F84;&#xFF0C;&#x5219;&#x4E3A; <code>#t</code>, &#x5426;&#x5219;&#x4E3A; <code>#f</code>.
libraries: (chezscheme)</p>
<p>path must be a string. The return value is also a (possibly empty) string.
path &#x5FC5;&#x987B;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x8FD4;&#x56DE;&#x503C;&#x4E5F;&#x662F;&#xFF08;&#x53EF;&#x80FD;&#x4E3A;&#x7A7A;&#xFF09;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<p>The path first component is the first directory in the path, or the empty string if the path consists only of a single filename. The path rest component is the portion of the path that does not include the path first component or the directory separator (if any) that separates it from the rest of the path. The path last component is the last (filename) portion of path. The path parent component is the portion of path that does not include the path last component, if any, or the directory separator that separates it from the rest of the path.
&#x8DEF;&#x5F84;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7EC4;&#x4EF6;&#x662F;&#x8DEF;&#x5F84;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x5982;&#x679C;&#x8DEF;&#x5F84;&#x4EC5;&#x5305;&#x542B;&#x5355;&#x4E2A;&#x6587;&#x4EF6;&#x540D;&#xFF0C;&#x5219;&#x4E3A;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x8DEF;&#x5F84;&#x7684;&#x5269;&#x4F59;&#x7EC4;&#x4EF6;&#x662F;&#x8DEF;&#x5F84;&#x4E2D;&#x4E0D;&#x5305;&#x542B;&#x8DEF;&#x5F84;&#x7B2C;&#x4E00;&#x4E2A;&#x7EC4;&#x4EF6;&#x6216;&#x5C06;&#x5B83;&#x4E0E;&#x8DEF;&#x5F84;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x5206;&#x9694;&#x5F00;&#x7684;&#x76EE;&#x5F55;&#x5206;&#x9694;&#x7B26;&#xFF08;&#x5982;&#x679C;&#x6709;&#xFF09;&#x7684;&#x90E8;&#x5206;&#x3002;&#x8DEF;&#x5F84;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7EC4;&#x4EF6;&#x662F;&#x8DEF;&#x5F84;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x90E8;&#x5206;&#xFF08;&#x6587;&#x4EF6;&#x540D;&#xFF09;&#x3002;&#x8DEF;&#x5F84;&#x7236;&#x7EC4;&#x4EF6;&#x662F;&#x8DEF;&#x5F84;&#x4E2D;&#x4E0D;&#x5305;&#x542B;&#x8DEF;&#x5F84;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7EC4;&#x4EF6;&#x7684;&#x90E8;&#x5206;&#xFF08;&#x5982;&#x679C;&#x6709;&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x5C06;&#x5176;&#x4E0E;&#x8DEF;&#x5F84;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x5206;&#x9694;&#x5F00;&#x7684;&#x76EE;&#x5F55;&#x5206;&#x9694;&#x7B26;&#x3002;</p>
<p>If the first component of the path names a root directory (including drives and shares under Windows), home directory (e.g., ~/abc or ~user/abc), the current directory (.), or the parent directory (..), path-first returns that component. For paths that consist only of such a directory, both path-first and path-parent act as identity procedures, while path-rest and path-last return the empty string.
&#x5982;&#x679C;&#x8DEF;&#x5F84;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7EC4;&#x4EF6;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x6839;&#x76EE;&#x5F55;&#xFF08;&#x5305;&#x62EC; Windows &#x4E0B;&#x7684;&#x9A71;&#x52A8;&#x5668;&#x548C;&#x5171;&#x4EAB;&#x6587;&#x4EF6;&#x5939;&#xFF09;&#xFF0C;&#x4E3B;&#x76EE;&#x5F55;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;~/abc &#x6216;~user/abc&#xFF09;&#xFF0C;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#xFF08;.&#xFF09;&#x6216;&#x7236;&#x76EE;&#x5F55;&#xFF08;..&#xFF09; &#xFF0C;path-first &#x8FD4;&#x56DE;&#x8BE5;&#x7EC4;&#x4EF6;&#x3002;&#x5BF9;&#x4E8E;&#x4EC5;&#x5305;&#x542B;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x7684;&#x8DEF;&#x5F84;&#xFF0C;path-first &#x548C; path-parent &#x8868;&#x73B0;&#x4E3A;&#x540C;&#x6837;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x800C; path-rest &#x548C; path-last &#x8FD4;&#x56DE;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<p>The path extension component is the portion of path that follows the last dot (period) in the last component of a path name. The path root component is the portion of path that does not include the extension, if any, or the dot that precedes it.
&#x8DEF;&#x5F84;&#x6269;&#x5C55;&#x7EC4;&#x4EF6;&#x662F;&#x8DEF;&#x5F84;&#x540D;&#x79F0;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7EC4;&#x4EF6;&#x4E2D;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x70B9;&#x53F7;&#xFF08;&#x53E5;&#x70B9;&#xFF09;&#x4E4B;&#x540E;&#x7684;&#x8DEF;&#x5F84;&#x90E8;&#x5206;&#x3002;&#x8DEF;&#x5F84;&#x6839;&#x7EC4;&#x4EF6;&#x662F;&#x8DEF;&#x5F84;&#x4E2D;&#x4E0D;&#x5305;&#x542B;&#x6269;&#x5C55;&#x540D;&#x7684;&#x90E8;&#x5206;&#xFF08;&#x5982;&#x679C;&#x6709;&#xFF09;&#x6216;&#x5176;&#x524D;&#x9762;&#x7684;&#x70B9;&#x3002;</p>
<p>If the first component names a root directory (including drives and shares under Windows) or home directory, path-absolute? returns #t. Otherwise, path-absolute? returns #f.
&#x5982;&#x679C;&#x7B2C;&#x4E00;&#x4E2A;&#x7EC4;&#x4EF6;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x6839;&#x76EE;&#x5F55;&#xFF08;&#x5305;&#x62EC; Windows &#x4E0B;&#x7684;&#x9A71;&#x52A8;&#x5668;&#x548C;&#x5171;&#x4EAB;&#x6587;&#x4EF6;&#x5939;&#xFF09;&#x6216;&#x4E3B;&#x76EE;&#x5F55;&#xFF0C;path-absolute? &#x8FD4;&#x56DE;#t. &#x5426;&#x5219;&#xFF0C;path-absolute? &#x8FD4;&#x56DE;#f.</p>
<p>&#x4E0B;&#x8868;&#x6807;&#x8BC6;&#x4E86;&#x51E0;&#x4E2A;&#x793A;&#x4F8B;&#x8DEF;&#x5F84;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x4E0B;&#x5212;&#x7EBF;&#x8868;&#x793A;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="org-left">

<col class="org-left">

<col class="org-left">

<col class="org-left">

<col class="org-left">

<col class="org-left">

<col class="org-left">

<col class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">path</th>
<th scope="col" class="org-left">abs</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">rest</th>
<th scope="col" class="org-left">parent</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">root</th>
<th scope="col" class="org-left">ext</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">a</td>
<td class="org-left">#f</td>
<td class="org-left">\_</td>
<td class="org-left">a</td>
<td class="org-left">\_</td>
<td class="org-left">a</td>
<td class="org-left">a</td>
<td class="org-left">\_</td>
</tr>


<tr>
<td class="org-left">a/</td>
<td class="org-left">#f</td>
<td class="org-left">a</td>
<td class="org-left">\_</td>
<td class="org-left">a</td>
<td class="org-left">\_</td>
<td class="org-left">a/</td>
<td class="org-left">\_</td>
</tr>


<tr>
<td class="org-left">a/b</td>
<td class="org-left">#f</td>
<td class="org-left">a</td>
<td class="org-left">b</td>
<td class="org-left">a</td>
<td class="org-left">b</td>
<td class="org-left">a/b</td>
<td class="org-left">\_</td>
</tr>


<tr>
<td class="org-left">a/b.c</td>
<td class="org-left">#f</td>
<td class="org-left">a</td>
<td class="org-left">b.c</td>
<td class="org-left">a</td>
<td class="org-left">b.c</td>
<td class="org-left">a/b</td>
<td class="org-left">c</td>
</tr>


<tr>
<td class="org-left">/a/b.c</td>
<td class="org-left">#t</td>
<td class="org-left">/</td>
<td class="org-left">a/b.c</td>
<td class="org-left">/a</td>
<td class="org-left">b.c</td>
<td class="org-left">/a/b</td>
<td class="org-left">c</td>
</tr>


<tr>
<td class="org-left">~/a/b.c</td>
<td class="org-left">#t</td>
<td class="org-left">~</td>
<td class="org-left">a/b.c</td>
<td class="org-left">~/a</td>
<td class="org-left">b.c</td>
<td class="org-left">~/a/b</td>
<td class="org-left">c</td>
</tr>


<tr>
<td class="org-left">~u/a/b.c</td>
<td class="org-left">#t</td>
<td class="org-left">~u</td>
<td class="org-left">a/b.c</td>
<td class="org-left">~u/a</td>
<td class="org-left">b.c</td>
<td class="org-left">~u/a/b</td>
<td class="org-left">c</td>
</tr>


<tr>
<td class="org-left">../..</td>
<td class="org-left">#f</td>
<td class="org-left">..</td>
<td class="org-left">..</td>
<td class="org-left">..</td>
<td class="org-left">..</td>
<td class="org-left">../..</td>
<td class="org-left">\_</td>
</tr>
</tbody>
</table>

<p>The second table shows the components when Windows drives and shares are involved.
&#x7B2C;&#x4E8C;&#x4E2A;&#x8868;&#x663E;&#x793A;&#x6D89;&#x53CA; Windows &#x9A71;&#x52A8;&#x5668;&#x548C;&#x5171;&#x4EAB;&#x6587;&#x4EF6;&#x5939;&#x65F6;&#x7684;&#x7EC4;&#x4EF6;&#x3002;</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="org-left">

<col class="org-left">

<col class="org-left">

<col class="org-left">

<col class="org-left">

<col class="org-left">

<col class="org-left">

<col class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">path</th>
<th scope="col" class="org-left">abs</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">rest</th>
<th scope="col" class="org-left">parent</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">root</th>
<th scope="col" class="org-left">ext</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">c:</td>
<td class="org-left">#f</td>
<td class="org-left">c:</td>
<td class="org-left">\_</td>
<td class="org-left">c:</td>
<td class="org-left">\_</td>
<td class="org-left">c:</td>
<td class="org-left">\_</td>
</tr>


<tr>
<td class="org-left">c:/</td>
<td class="org-left">#t</td>
<td class="org-left">c:/</td>
<td class="org-left">\_</td>
<td class="org-left">c:/</td>
<td class="org-left">\_</td>
<td class="org-left">c:/</td>
<td class="org-left">\_</td>
</tr>


<tr>
<td class="org-left">c:a/b</td>
<td class="org-left">#f</td>
<td class="org-left">c:</td>
<td class="org-left">a/b</td>
<td class="org-left">c:a</td>
<td class="org-left">b</td>
<td class="org-left">c:a/b</td>
<td class="org-left">\_</td>
</tr>


<tr>
<td class="org-left">//s/a/b.c</td>
<td class="org-left">#t</td>
<td class="org-left">//s</td>
<td class="org-left">a/b.c</td>
<td class="org-left">//s/a</td>
<td class="org-left">b.c</td>
<td class="org-left">//s/a/b</td>
<td class="org-left">c</td>
</tr>


<tr>
<td class="org-left">//s.com</td>
<td class="org-left">#t</td>
<td class="org-left">//s.com</td>
<td class="org-left">\_</td>
<td class="org-left">//s.com</td>
<td class="org-left">\_</td>
<td class="org-left">//s.com</td>
<td class="org-left">\_</td>
</tr>
</tbody>
</table>

<p>The following procedure can be used to reproduce the tables above.
&#x4EE5;&#x4E0B;&#x8FC7;&#x7A0B;&#x53EF;&#x7528;&#x4E8E;&#x91CD;&#x65B0;&#x751F;&#x6210;&#x4E0A;&#x8868;&#x3002;</p>
<pre><code>(define print-table
  (lambda path*
    (define print-row
      (lambda (abs? path first rest parent last root extension)
        (printf &quot;~a~11t~a~17t~a~28t~a~39t~a~50t~a~61t~a~73t~a\n&quot;
          abs? path first rest parent last root extension)))
    (print-row &quot;path&quot; &quot;abs&quot; &quot;first&quot; &quot;rest&quot; &quot;parent&quot; &quot;last&quot; &quot;root&quot; &quot;ext&quot;)
    (for-each
      (lambda (path)
        (define uscore (lambda (s) (if (eqv? s &quot;&quot;) &quot;_&quot; s)))
        (apply print-row path
          (map (lambda (s) (if (eqv? s &quot;&quot;) &quot;_&quot; s))
               (list (path-absolute? path) (path-first path)
                 (path-rest path) (path-parent path) (path-last path)
                 (path-root path) (path-extension path)))))
      path*)))
</code></pre><p>For example, the first table can be produced with:
&#x4F8B;&#x5982;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x7B2C;&#x4E00;&#x4E2A;&#x8868;&#x683C;&#xFF1A;</p>
<pre><code>(print-table &quot;a&quot; &quot;a/&quot; &quot;a/b&quot; &quot;a/b.c&quot; &quot;/&quot; &quot;/a/b.c&quot; &quot;~/a/b.c&quot;
  &quot;~u/a/b.c&quot; &quot;../..&quot;)
</code></pre><p>while the second can be produced (under Windows) with:
&#x800C;&#x7B2C;&#x4E8C;&#x4E2A;&#x8868;&#x683C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x751F;&#x6210;&#xFF08;&#x5728; Windows &#x4E0B;&#xFF09;&#xFF1A;</p>
<pre><code>(print-table &quot;c:&quot; &quot;c:/&quot; &quot;c:a/b&quot; &quot;//s/a/b.c&quot; &quot;//s.com&quot;)
</code></pre><h2 id="917-&#x901A;&#x7528;&#x7AEF;&#x53E3;&#x793A;&#x4F8B;">9.17. &#x901A;&#x7528;&#x7AEF;&#x53E3;&#x793A;&#x4F8B;</h2>
<p>This section presents the definitions for three types of generic ports: two-way ports, transcript ports, and process ports.
&#x672C;&#x8282;&#x4ECB;&#x7ECD;&#x4E09;&#x79CD;&#x901A;&#x7528;&#x7AEF;&#x53E3;&#x7684;&#x5B9A;&#x4E49;&#xFF1A;&#x53CC;&#x5411;&#x7AEF;&#x53E3;&#xFF0C;&#x8F6C;&#x5F55;&#x7AEF;&#x53E3;&#x548C;&#x8FDB;&#x7A0B;&#x7AEF;&#x53E3;&#x3002;</p>
<p>Two-way ports.  The first example defines make-two-way-port, which constructs a textual input/output port from a given pair of textual input and output ports. For example:
&#x53CC;&#x5411;&#x7AEF;&#x53E3;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x5B9A;&#x4E49;&#x4E86; make-two-way-port, &#x5B83;&#x4ECE;&#x7ED9;&#x5B9A;&#x7684;&#x4E00;&#x5BF9;&#x6587;&#x672C;&#x8F93;&#x5165;&#x548C;&#x6587;&#x672C;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x6784;&#x9020;&#x6587;&#x672C;&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code>(define ip (open-input-string &quot;this is the input&quot;))
(define op (open-output-string))
(define p (make-two-way-port ip op))
</code></pre><p>The port returned by make-two-way-port is both an input and an output port, and it is also a textual port:
make-two-way-port &#x8FD4;&#x56DE;&#x7684;&#x7AEF;&#x53E3;&#x65E2;&#x662F;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x53C8;&#x662F;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF0C;&#x5B83;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x6587;&#x672C;&#x7AEF;&#x53E3;&#xFF1A;</p>
<pre><code>(port? p) \Rightarrow #t
(input-port? p) \Rightarrow #t
(output-port? p) \Rightarrow #t
(textual-port? p) \Rightarrow #t
</code></pre><p>Items read from a two-way port come from the constituent input port, and items written to a two-way port go to the constituent output port:
&#x4ECE;&#x53CC;&#x5411;&#x7AEF;&#x53E3;&#x8BFB;&#x53D6;&#x7684;&#x9879;&#x76EE;&#x6765;&#x81EA;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x90E8;&#x5206;&#xFF0C;&#x5199;&#x5165;&#x53CC;&#x5411;&#x7AEF;&#x53E3;&#x7684;&#x9879;&#x76EE;&#x53D1;&#x9001;&#x5230;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x90E8;&#x5206;&#xFF1A;</p>
<pre><code>(read p) \Rightarrow this
(write &apos;hello p)
(get-output-string op) \Rightarrow hello
</code></pre><p>The definition of make-two-way-port is straightforward. To keep the example simple, no local buffering is performed, although it would be more efficient to do so.
make-two-way-port &#x7684;&#x5B9A;&#x4E49;&#x5F88;&#x76F4;&#x767D;&#x3002;&#x4E3A;&#x4E86;&#x4F7F;&#x793A;&#x4F8B;&#x4FDD;&#x6301;&#x7B80;&#x5355;&#xFF0C;&#x4E0D;&#x6267;&#x884C;&#x672C;&#x5730;&#x7F13;&#x51B2;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x6837;&#x505A;&#x4F1A;&#x66F4;&#x6709;&#x6548;&#x3002;</p>
<pre><code>(define make-two-way-port
  (lambda (ip op)
    (define handler
      (lambda (msg . args)
        (record-case (cons msg args)
          [block-read (p s n) (block-read ip s n)]
          [block-write (p s n) (block-write op s n)]
          [char-ready? (p) (char-ready? ip)]
          [clear-input-port (p) (clear-input-port ip)]
          [clear-output-port (p) (clear-output-port op)]
          [close-port (p) (mark-port-closed! p)]
          [flush-output-port (p) (flush-output-port op)]
          [file-position (p . pos) (apply file-position ip pos)]
          [file-length (p) (file-length ip)]
          [peek-char (p) (peek-char ip)]
          [port-name (p) &quot;two-way&quot;]
          [read-char (p) (read-char ip)]
          [unread-char (c p) (unread-char c ip)]
          [write-char (c p) (write-char c op)]
          [else (assertion-violationf &apos;two-way-port
                  &quot;operation ~s not handled&quot;
                  msg)])))
    (make-input/output-port handler &quot;&quot; &quot;&quot;)))
</code></pre><p>Most of the messages are passed directly to one of the constituent ports. Exceptions are close-port, which is handled directly by marking the port closed, port-name, which is also handled directly. file-position and file-length are rather arbitrarily passed off to the input port.
&#x5927;&#x591A;&#x6570;&#x6D88;&#x606F;&#x90FD;&#x76F4;&#x63A5;&#x4F20;&#x9012;&#x7ED9;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7EC4;&#x6210;&#x7AEF;&#x53E3;&#x3002;close-port &#x662F;&#x4E2A;&#x4F8B;&#x5916;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x628A;&#x7AEF;&#x53E3;&#x6807;&#x8BB0;&#x4E3A;&#x5173;&#x95ED;&#x6765;&#x76F4;&#x63A5;&#x5904;&#x7406;&#xFF0C;port-name, &#x4E5F;&#x662F;&#x76F4;&#x63A5;&#x5904;&#x7406;&#x3002;file-position &#x548C; file-length &#x5219;&#x76F4;&#x63A5;&#x4F20;&#x9012;&#x7ED9;&#x8F93;&#x5165;&#x7AEF;&#x53E3;&#x3002;</p>
<p>Transcript ports.  The next example defines make-transcript-port, which constructs a textual input/output port from three ports: a textual input port ip and two textual output ports, op and tp. Input read from a transcript port comes from ip, and output written to a transcript port goes to op. In this manner, transcript ports are similar to two-way ports. Unlike two-way ports, input from ip and output to op is also written to tp, so that tp reflects both input from ip and output to op.
&#x8F6C;&#x5F55;&#x7AEF;&#x53E3;&#x3002;&#x4E0B;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x5B9A;&#x4E49;&#x4E86; make-transcript-port&#xFF0C;&#x5B83;&#x4ECE;&#x4E09;&#x4E2A;&#x7AEF;&#x53E3;&#x6784;&#x5EFA;&#x6587;&#x672C;&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#xFF1A;&#x6587;&#x672C;&#x8F93;&#x5165;&#x7AEF;&#x53E3; ip &#x548C;&#x4E24;&#x4E2A;&#x6587;&#x672C;&#x8F93;&#x51FA;&#x7AEF;&#x53E3; op &#x548C; tp. &#x4ECE;&#x8F6C;&#x5F55;&#x7AEF;&#x53E3;&#x8BFB;&#x53D6;&#x7684;&#x8F93;&#x5165;&#x6765;&#x81EA; ip&#xFF0C;&#x5199;&#x5165;&#x8F6C;&#x5F55;&#x7AEF;&#x53E3;&#x7684;&#x8F93;&#x51FA;&#x53D1;&#x9001;&#x5230; op. &#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4E0B;&#xFF0C;&#x8F6C;&#x5F55;&#x7AEF;&#x53E3;&#x7C7B;&#x4F3C;&#x4E8E;&#x53CC;&#x5411;&#x7AEF;&#x53E3;&#x3002;&#x4E0E;&#x53CC;&#x5411;&#x7AEF;&#x53E3;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x6765;&#x81EA; ip &#x7684;&#x8F93;&#x5165;&#x548C;&#x53D1;&#x9001;&#x5230; op &#x7684;&#x8F93;&#x51FA;&#x4E5F;&#x5199;&#x5165;&#x5230; tp, &#x56E0;&#x6B64; tp &#x53CD;&#x6620;&#x4E86;&#x6765;&#x81EA; ip &#x7684;&#x8F93;&#x5165;&#x548C;&#x53D1;&#x9001;&#x5230; op &#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<p>Transcript ports may be used to define the Scheme procedures transcript-on and transcript-off, or the Chez Scheme procedure transcript-cafe. For example, here is a definition of transcript-cafe:
&#x8F6C;&#x5F55;&#x7AEF;&#x53E3;&#x53EF;&#x7528;&#x4E8E;&#x5B9A;&#x4E49; Scheme &#x8FC7;&#x7A0B; transcript-on &#x548C; transcript-off&#xFF0C;&#x6216; Chez Scheme &#x8FC7;&#x7A0B; transcript-cafe. &#x4F8B;&#x5982;&#xFF0C;&#x4EE5;&#x4E0B;&#x662F; transcript-cafe &#x7684;&#x4E00;&#x4E2A;&#x5B9A;&#x4E49;&#xFF1A;</p>
<pre><code>(define transcript-cafe
  (lambda (pathname)
    (let ([tp (open-output-file pathname &apos;replace)])
      (let ([p (make-transcript-port
                 (console-input-port)
                 (console-output-port)
                 tp)])
       ; set both console and current ports so that
       ; the waiter and read/write will be in sync
        (parameterize ([console-input-port p]
                       [console-output-port p]
                       [current-input-port p]
                       [current-output-port p])
          (let-values ([vals (new-cafe)])
            (close-port p)
            (close-port tp)
            (apply values vals)))))))
</code></pre><p>The implementation of transcript ports is significantly more complex than the implementation of two-way ports defined above, primarily because it buffers input and output locally. Local buffering is needed to allow the transcript file to reflect accurately the actual input and output performed in the presence of unread-char, clear-output-port, and clear-input-port. Here is the code:
&#x8F6C;&#x5F55;&#x7AEF;&#x53E3;&#x7684;&#x5B9E;&#x73B0;&#x6BD4;&#x4E0A;&#x9762;&#x5B9A;&#x4E49;&#x7684;&#x53CC;&#x5411;&#x7AEF;&#x53E3;&#x7684;&#x5B9E;&#x73B0;&#x590D;&#x6742;&#x5F97;&#x591A;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x5728;&#x672C;&#x5730;&#x7F13;&#x51B2;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x3002;&#x9700;&#x8981;&#x672C;&#x5730;&#x7F13;&#x51B2;&#x4EE5;&#x5141;&#x8BB8;&#x8F6C;&#x5F55;&#x6587;&#x4EF6;&#x51C6;&#x786E;&#x53CD;&#x6620;&#x5728;&#x5B58;&#x5728; unread-char&#xFF0C;clear-output-port &#x548C; clear-input-port &#x65F6;&#x6267;&#x884C;&#x7684;&#x5B9E;&#x9645;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x3002;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>(define make-transcript-port
  (lambda (ip op tp)
    (define (handler msg . args)
      (record-case (cons msg args)
        [block-read (p str cnt)
         (with-interrupts-disabled
           (let ([b (port-input-buffer p)]
                 [i (port-input-index p)]
                 [s (port-input-size p)])
             (if (&lt; i s)
                 (let ([cnt (fxmin cnt (fx- s i))])
                   (do ([i i (fx+ i 1)]
                        [j 0 (fx+ j 1)])
                       ((fx= j cnt)
                        (set-port-input-index! p i)
                        cnt)
                       (string-set! str j (string-ref b i))))
                 (let ([cnt (block-read ip str cnt)])
                   (unless (eof-object? cnt)
                     (block-write tp str cnt))
                   cnt))))]
        [char-ready? (p)
         (or (&lt; (port-input-index p) (port-input-size p))
             (char-ready? ip))]
        [clear-input-port (p)
         ; set size to zero rather than index to size
         ; in order to invalidate unread-char
         (set-port-input-size! p 0)]
        [clear-output-port (p)
         (set-port-output-index! p 0)]
        [close-port (p)
         (with-interrupts-disabled
           (flush-output-port p)
           (set-port-output-size! p 0)
           (set-port-input-size! p 0)
           (mark-port-closed! p))]
        [file-position (p . pos)
         (if (null? pos)
             (most-negative-fixnum)
             (assertion-violationf &apos;transcript-port &quot;cannot reposition&quot;))]
        [flush-output-port (p)
         (with-interrupts-disabled
           (let ([b (port-output-buffer p)]
                 [i (port-output-index p)])
             (unless (fx= i 0)
               (block-write op b i)
               (block-write tp b i)
               (set-port-output-index! p 0)
               (set-port-bol! p
                 (char=? (string-ref b (fx- i 1)) #\newline))))
           (flush-output-port op)
           (flush-output-port tp))]
        [peek-char (p)
         (with-interrupts-disabled
           (let ([b (port-input-buffer p)]
                 [i (port-input-index p)]
                 [s (port-input-size p)])
             (if (fx&lt; i s)
                 (string-ref b i)
                 (begin
                   (flush-output-port p)
                   (let ([s (block-read ip b)])
                     (if (eof-object? s)
                         s
                         (begin
                           (block-write tp b s)
                           (set-port-input-size! p s)
                           (string-ref b 0))))))))]
        [port-name (p) &quot;transcript&quot;]
        [constituent-ports (p) (values ip op tp)]
        [read-char (p)
         (with-interrupts-disabled
           (let ([c (peek-char p)])
             (unless (eof-object? c)
               (set-port-input-index! p
                 (fx+ (port-input-index p) 1)))
             c))]
        [unread-char (c p)
         (with-interrupts-disabled
           (let ([b (port-input-buffer p)]
                 [i (port-input-index p)]
                 [s (port-input-size p)])
             (when (fx= i 0)
               (assertion-violationf &apos;unread-char
                 &quot;tried to unread too far on ~s&quot;
                 p))
             (set-port-input-index! p (fx- i 1))
             ; following could be skipped; it&apos;s supposed
             ; to be the same character anyway
             (string-set! b (fx- i 1) c)))]
        [write-char (c p)
         (with-interrupts-disabled
           (let ([b (port-output-buffer p)]
                 [i (port-output-index p)]
                 [s (port-output-size p)])
             (string-set! b i c)
            ; could check here to be sure that we really
            ; need to flush; we may end up here even if
            ; the buffer isn&apos;t full
             (block-write op b (fx+ i 1))
             (block-write tp b (fx+ i 1))
             (set-port-output-index! p 0)
             (set-port-bol! p (char=? c #\newline))))]
        [block-write (p str cnt)
         (with-interrupts-disabled
          ; flush buffered data
           (let ([b (port-output-buffer p)]
                 [i (port-output-index p)])
             (unless (fx= i 0)
               (block-write op b i)
               (block-write tp b i)
               (set-port-output-index! p 0)
               (set-port-bol! p (char=? (string-ref b (fx- i 1)) #\newline))))
          ; write new data
           (unless (fx= cnt 0)
             (block-write op str cnt)
             (block-write tp str cnt)
             (set-port-bol! p
               (char=? (string-ref str (fx- cnt 1)) #\newline))))]
        [else (assertion-violationf &apos;transcript-port
                &quot;operation ~s not handled&quot;
                msg)]))
    (let ([ib (make-string 1024)] [ob (make-string 1024)])
      (let ([p (make-input/output-port handler ib ob)])
        (set-port-input-size! p 0)
        (set-port-output-size! p (fx- (string-length ob) 1))
        p))))
</code></pre><p>The chosen length of both the input and output ports is the same; this is not necessary. They could have different lengths, or one could be buffered locally and the other not buffered locally. Local buffering could be disabled effectively by providing zero-length buffers.
&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x7AEF;&#x53E3;&#x9009;&#x62E9;&#x7684;&#x957F;&#x5EA6;&#x662F;&#x76F8;&#x540C;&#x7684;; &#x8FD9;&#x4E0D;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x3002;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x4EE5;&#x4E00;&#x4E2A;&#x5728;&#x672C;&#x5730;&#x7F13;&#x51B2;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x4E0D;&#x5728;&#x672C;&#x5730;&#x7F13;&#x51B2;&#x3002;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;&#x96F6;&#x957F;&#x5EA6;&#x7F13;&#x51B2;&#x533A;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x5730;&#x7981;&#x7528;&#x672C;&#x5730;&#x7F13;&#x51B2;&#x3002;</p>
<p>After we create the port, the input size is set to zero since there is not yet any data to be read. The port output size is set to one less than the length of the buffer. This is done so that write-char always has one character position left over into which to write its character argument. Although this is not necessary, it does simplify the code somewhat while allowing the buffer to be flushed as soon as the last character is available.
&#x521B;&#x5EFA;&#x7AEF;&#x53E3;&#x540E;&#xFF0C;&#x8F93;&#x5165;&#x5927;&#x5C0F;&#x8BBE;&#x7F6E;&#x4E3A;&#x96F6;&#xFF0C;&#x56E0;&#x4E3A;&#x6B64;&#x65F6;&#x8FD8;&#x6CA1;&#x6709;&#x8981;&#x8BFB;&#x53D6;&#x7684;&#x6570;&#x636E;&#x3002;&#x7AEF;&#x53E3;&#x8F93;&#x51FA;&#x5927;&#x5C0F;&#x8BBE;&#x7F6E;&#x4E3A;&#x7F13;&#x51B2;&#x533A;&#x957F;&#x5EA6;&#x51CF;&#x4E00;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x662F;&#x4E3A;&#x4E86;&#x4F7F; write-char &#x603B;&#x6709;&#x4E00;&#x4E2A;&#x5269;&#x4F59;&#x7684;&#x5B57;&#x7B26;&#x4F4D;&#x7F6E;&#x6765;&#x5199;&#x5165;&#x5176;&#x5B57;&#x7B26;&#x53C2;&#x6570;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4E0D;&#x662F;&#x5FC5;&#x987B;&#x7684;&#xFF0C;&#x4F46;&#x5B83;&#x786E;&#x5B9E;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x7B80;&#x5316;&#x4E86;&#x4EE3;&#x7801;&#xFF0C;&#x540C;&#x65F6;&#x5141;&#x8BB8;&#x7F13;&#x51B2;&#x533A;&#x5728;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x53EF;&#x7528;&#x65F6;&#x53EF;&#x4EE5;&#x7ACB;&#x5373;&#x5237;&#x65B0;&#x3002;</p>
<p>Block reads and writes are performed on the constituent ports for efficiency and (in the case of writes) to ensure that the operations are performed immediately.
&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF0C;&#x4EE5;&#x53CA;&#xFF08;&#x5728;&#x5199;&#x5165;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF09;&#x786E;&#x4FDD;&#x64CD;&#x4F5C;&#x7ACB;&#x5373;&#x6267;&#x884C;&#xFF0C;&#x5757;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x662F;&#x5728;&#x7EC4;&#x6210;&#x7AEF;&#x53E3;&#x4E0A;&#x6267;&#x884C;&#x3002;</p>
<p>The call to flush-output-port in the handling of read-char insures that all output written to op appears before input is read from ip. Since block-read is typically used to support higher-level operations that are performing their own buffering, or for direct input and output in support of I/O-intensive applications, the flush call has been omitted from that part of the handler.
&#x5728;&#x5904;&#x7406; read-char &#x65F6;&#x8C03;&#x7528; flush-output-port &#x786E;&#x4FDD;&#x5728;&#x4ECE; ip &#x8BFB;&#x53D6;&#x8F93;&#x5165;&#x4E4B;&#x524D;&#x628A;&#x6240;&#x6709;&#x8F93;&#x51FA;&#x5199;&#x5165;&#x5230; op. &#x7531;&#x4E8E; block-read &#x901A;&#x5E38;&#x7528;&#x4E8E;&#x652F;&#x6301;&#x6267;&#x884C;&#x5176;&#x81EA;&#x8EAB;&#x7F13;&#x51B2;&#x7684;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x64CD;&#x4F5C;&#xFF0C;&#x6216;&#x8005;&#x7528;&#x4E8E;&#x652F;&#x6301; I/O &#x5BC6;&#x96C6;&#x578B;&#x5E94;&#x7528;&#x7684;&#x76F4;&#x63A5;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#xFF0C;&#x56E0;&#x6B64;&#x4ECE;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x7684;&#x8BE5;&#x90E8;&#x5206;&#x7701;&#x7565;&#x4E86;&#x5237;&#x65B0;&#x8C03;&#x7528;&#x3002;</p>
<p>Critical sections are used whenever the handler manipulates one of the buffers, to protect against untimely interrupts that could lead to reentry into the handler. The critical sections are unnecessary if no such reentry is possible, i.e., if only one &quot;thread&quot; of the computation can have access to the port.
&#x53EA;&#x8981;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x64CD;&#x4F5C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x5C31;&#x4F1A;&#x4F7F;&#x7528;&#x4E34;&#x754C;&#x533A;&#x5757;&#xFF0C;&#x4EE5;&#x9632;&#x6B62;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x91CD;&#x65B0;&#x8FDB;&#x5165;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x7684;&#x8FC7;&#x65E9;&#x4E2D;&#x65AD;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x53EF;&#x80FD;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x91CD;&#x65B0;&#x8FDB;&#x5165;&#xFF0C;&#x5373;&#xFF0C;&#x5982;&#x679C;&#x8BA1;&#x7B97;&#x4E2D;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x201C;&#x7EBF;&#x7A0B;&#x201D;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x8BE5;&#x7AEF;&#x53E3;&#xFF0C;&#x5219;&#x4E0D;&#x9700;&#x8981;&#x4E34;&#x754C;&#x533A;&#x5757;&#x3002;</p>
<p>Process ports.  The final example demonstrates how to incorporate the socket interface defined in Section 4.9 into a generic port that allows transparent communication with subprocesses via normal Scheme input/output operations.
<strong>&#x8FDB;&#x7A0B;&#x7AEF;&#x53E3;</strong> &#x3002;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x6F14;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x5C06;&#x7B2C; 4.9 &#x8282;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x5957;&#x63A5;&#x5B57;&#x63A5;&#x53E3;&#x5408;&#x5E76;&#x5230;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x7AEF;&#x53E3;&#x4E2D;&#xFF0C;&#x8BE5;&#x7AEF;&#x53E3;&#x5141;&#x8BB8;&#x901A;&#x8FC7;&#x6807;&#x51C6;&#x7684; Scheme &#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x64CD;&#x4F5C;&#x4E0E;&#x5B50;&#x8FDB;&#x7A0B;&#x8FDB;&#x884C;&#x900F;&#x660E;&#x901A;&#x4FE1;&#x3002;</p>
<p>A process port is created with open-process, which accepts a shell command as a string. open-process sets up a socket, forks a child process, sets up two-way communication via the socket, and invokes the command in a subprocess.
&#x8FDB;&#x7A0B;&#x7AEF;&#x53E3;&#x7531; open-process &#x521B;&#x5EFA;&#xFF0C;&#x8BE5;&#x8FC7;&#x7A0B;&#x7684;&#x53C2;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x5F62;&#x5F0F;&#x7684; shell &#x547D;&#x4EE4;&#x3002;open-process &#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x5957;&#x63A5;&#x5B57;&#xFF0C;fork &#x4E00;&#x4E2A;&#x5B50;&#x8FDB;&#x7A0B;&#xFF0C;&#x901A;&#x8FC7;&#x5957;&#x63A5;&#x5B57;&#x5EFA;&#x7ACB;&#x53CC;&#x5411;&#x901A;&#x4FE1;&#xFF0C;&#x5E76;&#x5728;&#x5B50;&#x8FDB;&#x7A0B;&#x4E2D;&#x8C03;&#x7528;&#x8BE5;&#x547D;&#x4EE4;&#x3002;</p>
<p>The sample session below demonstrates the use of open-process, running and communicating with another Scheme process started with the &quot;-q&quot; switch to suppress the greeting and prompts.
&#x4E0B;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x4F1A;&#x8BDD;&#x6F14;&#x793A;&#x4E86; open-process &#x7684;&#x7528;&#x6CD5;&#xFF0C;&#x8FD0;&#x884C;&#x5E76;&#x4E0E;&#x53E6;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x201C;-q&#x201D;&#x5F00;&#x5173;&#x542F;&#x52A8;&#x7684; Scheme &#x8FDB;&#x7A0B;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#xFF0C;&#x4EE5;&#x5E9F;&#x6B62;&#x95EE;&#x5019;&#x8BED;&#x548C;&#x63D0;&#x793A;&#x7B26;&#x3002;</p>
<pre><code>&gt; (define p (open-process &quot;exec scheme -q&quot;))
&gt; (define s (make-string 1000 #\nul))
&gt; (pretty-print &apos;(+ 3 4) p)
&gt; (read p)
7
&gt; (pretty-print &apos;(define (f x) (if (= x 0) 1 (* x (f (- x 1))))) p)
&gt; (pretty-print &apos;(f 10) p)
&gt; (read p)
3628800
&gt; (pretty-print &apos;(exit) p)
&gt; (read p)
#!eof
&gt; (close-port p)
</code></pre><p>Since process ports, like transcript ports, are two-way, the implementation is somewhat similar. The main difference is that a transcript port reads from and writes to its subordinate ports, whereas a process port reads from and writes to a socket. When a process port is opened, the socket is created and subprocess invoked, and when the port is closed, the socket is closed and the subprocess is terminated.
&#x7531;&#x4E8E;&#x8FDB;&#x7A0B;&#x7AEF;&#x53E3;&#x548C;&#x8F6C;&#x5F55;&#x7AEF;&#x53E3;&#x4E00;&#x6837;&#x662F;&#x53CC;&#x5411;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x6709;&#x4E9B;&#x7C7B;&#x4F3C;&#x3002;&#x4E3B;&#x8981;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF0C;&#x8F6C;&#x5F55;&#x7AEF;&#x53E3;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x5176;&#x4E0B;&#x7EA7;&#x7AEF;&#x53E3;&#xFF0C;&#x800C;&#x8FDB;&#x7A0B;&#x7AEF;&#x53E3;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x5957;&#x63A5;&#x5B57;&#x3002;&#x6253;&#x5F00;&#x8FDB;&#x7A0B;&#x7AEF;&#x53E3;&#x65F6;&#xFF0C;&#x5C06;&#x521B;&#x5EFA;&#x5957;&#x63A5;&#x5B57;&#x5E76;&#x8C03;&#x7528;&#x5B50;&#x8FDB;&#x7A0B;&#xFF0C;&#x5F53;&#x7AEF;&#x53E3;&#x5173;&#x95ED;&#x65F6;&#xFF0C;&#x5C06;&#x5173;&#x95ED;&#x5957;&#x63A5;&#x5B57;&#x5E76;&#x7EC8;&#x6B62;&#x5B50;&#x8FDB;&#x7A0B;&#x3002;</p>
<pre><code>(define open-process
  (lambda (command)
    (define handler
      (lambda (pid socket)
        (define (flush-output who p)
          (let ([i (port-output-index p)])
            (when (fx&gt; i 0)
              (check who (c-write socket (port-output-buffer p) i))
              (set-port-output-index! p 0))))
        (lambda (msg . args)
          (record-case (cons msg args)
            [block-read (p str cnt)
             (with-interrupts-disabled
               (let ([b (port-input-buffer p)]
                     [i (port-input-index p)]
                     [s (port-input-size p)])
                 (if (&lt; i s)
                     (let ([cnt (fxmin cnt (fx- s i))])
                       (do ([i i (fx+ i 1)]
                            [j 0 (fx+ j 1)])
                          ((fx= j cnt)
                           (set-port-input-index! p i)
                           cnt)
                          (string-set! str j (string-ref b i))))
                     (begin
                       (flush-output &apos;block-read p)
                       (let ([n (check &apos;block-read
                                  (c-read socket str cnt))])
                         (if (fx= n 0)
                             #!eof
                             n))))))]
            [char-ready? (p)
             (or (&lt; (port-input-index p) (port-input-size p))
                 (bytes-ready? socket))]
            [clear-input-port (p)
             ; set size to zero rather than index to size
             ; in order to invalidate unread-char
             (set-port-input-size! p 0)]
            [clear-output-port (p) (set-port-output-index! p 0)]
            [close-port (p)
             (with-interrupts-disabled
               (flush-output &apos;close-port p)
               (set-port-output-size! p 0)
               (set-port-input-size! p 0)
               (mark-port-closed! p)
               (terminate-process pid))]
            [file-length (p) 0]
            [file-position (p . pos)
             (if (null? pos)
                 (most-negative-fixnum)
                 (assertion-violationf &apos;process-port &quot;cannot reposition&quot;))]
            [flush-output-port (p)
             (with-interrupts-disabled
               (flush-output &apos;flush-output-port p))]
            [peek-char (p)
             (with-interrupts-disabled
               (let ([b (port-input-buffer p)]
                     [i (port-input-index p)]
                     [s (port-input-size p)])
                 (if (fx&lt; i s)
                     (string-ref b i)
                     (begin
                       (flush-output &apos;peek-char p)
                       (let ([s (check &apos;peek-char
                                  (c-read socket b (string-length b)))])
                         (if (fx= s 0)
                             #!eof
                             (begin (set-port-input-size! p s)
                                    (string-ref b 0))))))))]
            [port-name (p) &quot;process&quot;]
            [read-char (p)
             (with-interrupts-disabled
               (let ([b (port-input-buffer p)]
                     [i (port-input-index p)]
                     [s (port-input-size p)])
                 (if (fx&lt; i s)
                     (begin
                       (set-port-input-index! p (fx+ i 1))
                       (string-ref b i))
                     (begin
                       (flush-output &apos;peek-char p)
                       (let ([s (check &apos;read-char
                                  (c-read socket b (string-length b)))])
                         (if (fx= s 0)
                             #!eof
                             (begin (set-port-input-size! p s)
                                    (set-port-input-index! p 1)
                                    (string-ref b 0))))))))]
            [unread-char (c p)
             (with-interrupts-disabled
               (let ([b (port-input-buffer p)]
                     [i (port-input-index p)]
                     [s (port-input-size p)])
                 (when (fx= i 0)
                   (assertion-violationf &apos;unread-char
                     &quot;tried to unread too far on ~s&quot;
                     p))
                 (set-port-input-index! p (fx- i 1))
                ; following could be skipped; supposed to be
                ; same character
                 (string-set! b (fx- i 1) c)))]
            [write-char (c p)
             (with-interrupts-disabled
               (let ([b (port-output-buffer p)]
                     [i (port-output-index p)]
                     [s (port-output-size p)])
                 (string-set! b i c)
                 (check &apos;write-char (c-write socket b (fx+ i 1)))
                 (set-port-output-index! p 0)))]
            [block-write (p str cnt)
             (with-interrupts-disabled
              ; flush buffered data
               (flush-output &apos;block-write p)
              ; write new data
               (check &apos;block-write (c-write socket str cnt)))]
            [else
             (assertion-violationf &apos;process-port
               &quot;operation ~s not handled&quot;
               msg)]))))
    (let* ([server-socket-name (tmpnam 0)]
           [server-socket (setup-server-socket server-socket-name)])
      (dofork 
        (lambda () ; child
          (check &apos;close (close server-socket))
          (let ([sock (setup-client-socket server-socket-name)])
            (dodup 0 sock)
            (dodup 1 sock))
          (check &apos;execl (execl4 &quot;/bin/sh&quot; &quot;/bin/sh&quot; &quot;-c&quot; command))
          (assertion-violationf &apos;open-process &quot;subprocess exec failed&quot;))
        (lambda (pid) ; parent
          (let ([sock (accept-socket server-socket)])
            (check &apos;close (close server-socket))
            (let ([ib (make-string 1024)] [ob (make-string 1024)])
              (let ([p (make-input/output-port
                         (handler pid sock)
                         ib ob)])
                (set-port-input-size! p 0)
                (set-port-output-size! p (fx- (string-length ob) 1))
                p))))))))
</code></pre><p>Chez Scheme Version 9 User&apos;s Guide
Copyright &#xA9; 2018 Cisco Systems, Inc.
Licensed under the Apache License Version 2.0 (full copyright notice.).
Revised January 2019 for Chez Scheme Version 9.5.1
about this book </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="08.NumericOperations.html" class="navigation navigation-prev " aria-label="Previous page: 08. 数字操作">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="10.LibrariesAndTop-levelPrograms.html" class="navigation navigation-next " aria-label="Next page: 10. 库和顶层程序">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"09. 输入输出操作","level":"1.11","depth":1,"next":{"title":"10. 库和顶层程序","level":"1.12","depth":1,"path":"10.LibrariesAndTop-levelPrograms.md","ref":"10.LibrariesAndTop-levelPrograms.md","articles":[]},"previous":{"title":"08. 数字操作","level":"1.10","depth":1,"path":"08.NumericOperations.md","ref":"08.NumericOperations.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"09.InputOutputOperations.md","mtime":"2020-04-26T22:38:54.402Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-04-26T22:39:25.823Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

